#pragma once

/**
 * Name: SCUM
 * Version: 0.7.162
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Enums
	// --------------------------------------------------
	/**
	 * Enum ConZ.EPrisonerMontage
	 */
	enum class EPrisonerMontage : uint8_t
	{
		None                          = 0,
		WeaponEquipRifle              = 1,
		WeaponUnequipRifle            = 2,
		WeaponEquipHandgun            = 3,
		WeaponUnequipHandgun          = 4,
		Urinate                       = 5,
		UrinateForced                 = 6,
		Defecate                      = 7,
		DefecateForced                = 8,
		Vomit                         = 9,
		VomitForced                   = 10,
		SearchObject                  = 11,
		SearchPrisoner                = 12,
		SearchZombie                  = 13,
		PatchWounds                   = 14,
		PatchWoundsEnd                = 15,
		DrinkInteraction              = 16,
		Eat                           = 17,
		EatCan                        = 18,
		Drink                         = 19,
		Throw                         = 20,
		LongThrow                     = 21,
		LongThrowLoop                 = 22,
		ShortThrow                    = 23,
		ThrowbackGrenade              = 24,
		SwapWeapons                   = 25,
		ChopTree                      = 26,
		ChopTreeEnd                   = 27,
		ChopLog                       = 28,
		ChopLogEnd                    = 29,
		BreakStone                    = 30,
		BreakStoneEnd                 = 31,
		SwapItemsNotWeaponToNotWeapon = 32,
		SwapItemsWeaponToWeapon       = 33,
		SwapItemsNotWeaponToWeapon    = 34,
		SwapItemsWeaponToNotWeapon    = 35,
		SwapItemsThrowingItemToWeapon = 36,
		SwapItemsWeaponToThrowingItem = 37,
		Craft                         = 38,
		Uncraft                       = 39,
		CheckTime                     = 40,
		CheckTimeWhileItemInHands     = 41,
		CheckTimeWhileWeaponInHands   = 42,
		CheckTemperature              = 43,
		GestureShowFinger             = 44,
		GestureStandSurrender         = 45,
		GestureWaveHi                 = 46,
		GestureYouAreDead             = 47,
		GestureFY                     = 48,
		GesturePoint                  = 49,
		GestureHeart                  = 50,
		GestureBallpalm               = 51,
		GestureFacepalm               = 52,
		GestureFingerGun              = 53,
		GestureLaughing               = 54,
		GestureSmellWave              = 55,
		GestureSquat                  = 56,
		GestureCharge                 = 57,
		GestureFreeze                 = 58,
		GestureGetDown                = 59,
		GestureGetUp                  = 60,
		GestureHalt                   = 61,
		GestureHurryUp                = 62,
		GesturePointMe                = 63,
		GesturePointYou               = 64,
		GestureRally                  = 65,
		GestureThumbsUp               = 66,
		GestureThumbsDown             = 67,
		GestureUnderstandNot          = 68,
		GestureUnderstandYes          = 69,
		CommitSuicide                 = 70,
		CommitSuicideRare             = 71,
		CommitSuicideCaptured         = 72,
		LockpickRegular               = 73,
		Whistle                       = 74,
		TuneBow                       = 75,
		RepairVehicle                 = 76,
		WashCloth                     = 77,
		Bury                          = 78,
		BuryRest                      = 79,
		ResumeBury                    = 80,
		SitOnGroundStart              = 81,
		SitOnGroundEnd                = 82,
		LayOnGroundStart              = 83,
		LayOnGroundEnd                = 84,
		IgniteFlare                   = 85,
		ArmTrap                       = 86,
		FishingEnter                  = 87,
		FishingLeave                  = 88,
		FishingCast                   = 89,
		FishingLongCastEnd            = 90,
		FishingShortCastEnd           = 91,
		FishingPullStart              = 92,
		FishingPullEnd                = 93,
		FishingFishCaught             = 94,
		FishingKeepFish               = 95,
		FishingDiscardFish            = 96,
		FishingWireBreak              = 97,
		ForceUnlockStanding           = 98,
		ForceUnlockStandingEnd        = 99,
		ForceUnlockStandingStop       = 100,
		Spill                         = 101,
		StompOutFire                  = 102,
		BasicDance1                   = 103,
		BasicDance2                   = 104,
		BasicDance3                   = 105,
		BasicDance4                   = 106,
		BasicDance5                   = 107,
		AdvanceDance1                 = 108,
		AdvanceDance2                 = 109,
		AdvanceDance3                 = 110,
		AdvanceDance4                 = 111,
		AdvanceDance5                 = 112,
		AdvanceDance6                 = 113,
		AdvanceDance7                 = 114,
		InjectSelf                    = 115,
		InjectOther                   = 116,
		Count                         = 117,
		MAX                           = 118
	};

	/**
	 * Enum ConZ.EPrisonerAnimationSet
	 */
	enum class EPrisonerAnimationSet : uint8_t
	{
		Base                   = 0,
		Rifle                  = 1,
		RifleRelaxed           = 2,
		UnarmedCombat          = 3,
		Handgun                = 4,
		BowRelaxed             = 5,
		Bow                    = 6,
		CarryingItem           = 7,
		HandsBound             = 8,
		BaseLimping            = 9,
		RifleLimping           = 10,
		RifleRelaxedLimping    = 11,
		UnarmedCombatLimping   = 12,
		HandgunLimping         = 13,
		BowRelaxedLimping      = 14,
		BowLimping             = 15,
		CarryingItemLimping    = 16,
		HandsBoundLimping      = 17,
		ChainsawRelaxed        = 18,
		ChainsawRelaxedLimping = 19,
		Chainsaw               = 20,
		ChainsawLimping        = 21,
		Count                  = 22,
		MAX                    = 23
	};

	/**
	 * Enum ConZ.EWidgetDisplayInfoType
	 */
	enum class EWidgetDisplayInfoType : uint8_t
	{
		None            = 0,
		FirstOverSecond = 1,
		Single          = 2,
		MAX             = 3
	};

	/**
	 * Enum ConZ.EInteractionType
	 */
	enum class EInteractionType : uint8_t
	{
		None                                  = 0,
		Search                                = 1,
		Examine                               = 2,
		PickUp                                = 3,
		PickUpAllExamined                     = 4,
		PickUpAllSelected                     = 5,
		Use                                   = 6,
		Operate                               = 7,
		Drop                                  = 8,
		DropAllSelected                       = 9,
		Throw                                 = 10,
		Open                                  = 11,
		Close                                 = 12,
		Lock                                  = 13,
		Unlock                                = 14,
		Push                                  = 15,
		GodModeFill                           = 16,
		Fill                                  = 17,
		AdjustHeight                          = 18,
		ConfirmHeight                         = 19,
		Tank                                  = 20,
		Craft                                 = 21,
		Uncraft                               = 22,
		Create                                = 23,
		FixTire                               = 24,
		Fix                                   = 25,
		Refuel                                = 26,
		Charge                                = 27,
		FillResourceContainer                 = 28,
		Eat                                   = 29,
		EatAll                                = 30,
		Drink                                 = 31,
		DrinkAll                              = 32,
		Inject                                = 33,
		CheckTaste                            = 34,
		Equip                                 = 35,
		UnEquip                               = 36,
		Cut                                   = 37,
		Collect                               = 38,
		LightFire                             = 39,
		AddFuel                               = 40,
		Extinguish                            = 41,
		Prepare                               = 42,
		Cook                                  = 43,
		Chop                                  = 44,
		SmokeFood                             = 45,
		Destroy                               = 46,
		Store                                 = 47,
		TakeInHands                           = 48,
		Clean                                 = 49,
		WashCloth                             = 50,
		WashClothAll                          = 51,
		RemoveFromHands                       = 52,
		CarryItem                             = 53,
		AddToQuickAccess                      = 54,
		AddToThrowAccess                      = 55,
		RemoveFromQuickAccess                 = 56,
		RemoveFromThrowAccess                 = 57,
		ChamberBullet                         = 58,
		LoadAmmo                              = 59,
		UnloadAmmo                            = 60,
		CheckAmmo                             = 61,
		Swap                                  = 62,
		Tune                                  = 63,
		Treat                                 = 64,
		Join                                  = 65,
		Split                                 = 66,
		Unpack                                = 67,
		Anchor                                = 68,
		CheckTemperature                      = 69,
		RollRevolverDrum                      = 70,
		CommitSuicide                         = 71,
		TreatPatient                          = 72,
		InviteToSquad                         = 73,
		RemoveFromSquad                       = 74,
		LeaveSquad                            = 75,
		Urinate                               = 76,
		Defecate                              = 77,
		Vomit                                 = 78,
		CheckTime                             = 79,
		Resuscitate                           = 80,
		BindHands                             = 81,
		TightenBinds                          = 82,
		RemoveBinds                           = 83,
		LoosenBinds                           = 84,
		BreakBinds                            = 85,
		Bury                                  = 86,
		Unbury                                = 87,
		Rest                                  = 88,
		SitOnGround                           = 89,
		LayOnGround                           = 90,
		ExamineInventory                      = 91,
		Loot                                  = 92,
		ClaimKill                             = 93,
		Disarm                                = 94,
		GestureShowFinger                     = 95,
		GestureStandSurrender                 = 96,
		GestureWaveHi                         = 97,
		GestureYouAreDead                     = 98,
		GestureFY                             = 99,
		GesturePoint                          = 100,
		GestureHeart                          = 101,
		GestureBallpalm                       = 102,
		GestureFacepalm                       = 103,
		GestureFingerGun                      = 104,
		GestureLaughing                       = 105,
		GestureSmellWave                      = 106,
		GestureSquat                          = 107,
		GestureCharge                         = 108,
		GestureFreeze                         = 109,
		GestureGetDown                        = 110,
		GestureGetUp                          = 111,
		GestureHalt                           = 112,
		GestureHurryUp                        = 113,
		GesturePointMe                        = 114,
		GesturePointYou                       = 115,
		GestureRally                          = 116,
		GestureThumbsUp                       = 117,
		GestureThumbsDown                     = 118,
		GestureUnderstandNot                  = 119,
		GestureUnderstandYes                  = 120,
		PlayInstrument                        = 121,
		Whistle                               = 122,
		CutHair                               = 123,
		CutFacialHair                         = 124,
		EnterPhotoMode                        = 125,
		PacifyAnimal                          = 126,
		TameAnimal                            = 127,
		LearnAnimal                           = 128,
		CommandAnimal                         = 129,
		FeedAnimal                            = 130,
		Buy                                   = 131,
		Maintain                              = 132,
		Lockpick                              = 133,
		RemoveLocks                           = 134,
		RemoveLocksAdmin                      = 135,
		ForceUnlock                           = 136,
		AddUpgrade                            = 137,
		RadioTurnOn                           = 138,
		RadioTurnOff                          = 139,
		RadioIncreaseVolume                   = 140,
		RadioDecreaseVolume                   = 141,
		RadioChangeRadioStation               = 142,
		StackAdd                              = 143,
		StackSplit                            = 144,
		RepairBaseElement                     = 145,
		RepairBaseElementArea                 = 146,
		RepairBaseElementsUnder25Percent      = 147,
		RepairBaseElementsUnder50Percent      = 148,
		RepairBaseElementsUnder75Percent      = 149,
		ClaimBase                             = 150,
		ShowBaseFlagInfluence                 = 151,
		HideBaseFlagInfluence                 = 152,
		StartBaseFlagOvertake                 = 153,
		StopBaseFlagOvertake                  = 154,
		UpgradeBaseElement                    = 155,
		FlipPlaceable                         = 156,
		OpenContainer                         = 157,
		ChangeItemText                        = 158,
		CommitItemText                        = 159,
		TurnOn                                = 160,
		TurnOff                               = 161,
		IncreaseAngle                         = 162,
		DecreaseAngle                         = 163,
		IncreaseLightIntensity                = 164,
		DecreaseLightIntensity                = 165,
		AddMotionTrigger                      = 166,
		AddLaserTrigger                       = 167,
		AddTripwireTrigger                    = 168,
		AddTimedTrigger                       = 169,
		RemoveTrigger                         = 170,
		ShowTrigger                           = 171,
		ArmTrap                               = 172,
		DisarmTrap                            = 173,
		RefuelTrap                            = 174,
		StartFishing                          = 175,
		ActivateKillbox                       = 176,
		FillItemWithReplenishableResource     = 177,
		FillItemWithInfiniteResource          = 178,
		DrinkFromReplenishableResource        = 179,
		WashClothWithReplenishableResource    = 180,
		WashClothAllWithReplenishableResource = 181,
		Spill                                 = 182,
		CheckResourceType                     = 183,
		SetPrivateAccess                      = 184,
		SetPublicAccess                       = 185,
		SetRank1Access                        = 186,
		SetRank2Access                        = 187,
		SetRank3Access                        = 188,
		SetRank4Access                        = 189,
		MusicPlayerTurnOn                     = 190,
		MusicPlayerPlay                       = 191,
		MusicPlayerNext                       = 192,
		MusicPlayerPrevious                   = 193,
		MusicPlayerShuffle                    = 194,
		MusicPlayerRepeat                     = 195,
		MusicPlayerIncreaseVolume             = 196,
		MusicPlayerDecreaseVolume             = 197,
		MusicPlayerRadio                      = 198,
		BasicDance1                           = 199,
		BasicDance2                           = 200,
		BasicDance3                           = 201,
		BasicDance4                           = 202,
		BasicDance5                           = 203,
		AdvanceDance1                         = 204,
		AdvanceDance2                         = 205,
		AdvanceDance3                         = 206,
		AdvanceDance4                         = 207,
		AdvanceDance5                         = 208,
		AdvanceDance6                         = 209,
		AdvanceDance7                         = 210,
		TradeBuy                              = 211,
		TradeSell                             = 212,
		OpenBankAccount                       = 213,
		Withdraw100Money                      = 214,
		Withdraw250Money                      = 215,
		Withdraw1000Money                     = 216,
		WithdrawRemainingMoney                = 217,
		Deposit100Money                       = 218,
		Deposit250Money                       = 219,
		Deposit1000Money                      = 220,
		DepositAllMoney                       = 221,
		Pair                                  = 222,
		Unpair                                = 223,
		SayVoiceline                          = 224,
		RemoveClothingAt0                     = 225,
		RemoveClothingAt1                     = 226,
		RemoveClothingAt2                     = 227,
		RemoveClothingAt3                     = 228,
		RemoveClothingAt4                     = 229,
		RemoveClothingAt5                     = 230,
		AddClothingAt0                        = 231,
		AddClothingAt1                        = 232,
		AddClothingAt2                        = 233,
		AddClothingAt3                        = 234,
		AddClothingAt4                        = 235,
		AddClothingAt5                        = 236,
		MAX                                   = 237
	};

	/**
	 * Enum ConZ.ENoiseLevel
	 */
	enum class ENoiseLevel : uint8_t
	{
		Mute       = 0,
		VerySilent = 1,
		Silent     = 2,
		Moderate   = 3,
		Loud       = 4,
		VeryLoud   = 5,
		Count      = 6,
		MAX        = 7
	};

	/**
	 * Enum ConZ.EItemRarity
	 */
	enum class EItemRarity : uint8_t
	{
		ExtremelyRare = 0,
		VeryRare      = 1,
		Rare          = 2,
		Uncommon      = 3,
		Common        = 4,
		Abundant      = 5,
		Count         = 6,
		MAX           = 7
	};

	/**
	 * Enum ConZ.EItemExhausted
	 */
	enum class EItemExhausted : uint8_t
	{
		DoNothing = 0,
		Destroy   = 1,
		Uncraft   = 2,
		MAX       = 3
	};

	/**
	 * Enum ConZ.EDoorStateFlags
	 */
	enum class EDoorStateFlags : uint8_t
	{
		None       = 0,
		Open       = 1,
		Locked     = 2,
		Empty      = 3,
		ChangeSide = 4,
		HasLock    = 5,
		MAX        = 6
	};

	/**
	 * Enum ConZ.ELockDifficulty
	 */
	enum class ELockDifficulty : uint8_t
	{
		VeryEasy = 0,
		Basic    = 1,
		Medium   = 2,
		Advanced = 3,
		Num      = 4,
		MAX      = 5
	};

	/**
	 * Enum ConZ.EDoorType
	 */
	enum class EDoorType : uint8_t
	{
		Regular  = 0,
		BaseDoor = 1,
		MAX      = 2
	};

	/**
	 * Enum ConZ.ERawByteStreamType
	 */
	enum class ERawByteStreamType : uint8_t
	{
		Generic                   = 0,
		AdminCommandSquadInfoDump = 1,
		AdminCommandLootDump      = 2,
		MAX                       = 3
	};

	/**
	 * Enum ConZ.ERespawnOption
	 */
	enum class ERespawnOption : uint8_t
	{
		Random  = 0,
		Sector  = 1,
		Shelter = 2,
		Squad   = 3,
		MAX     = 4
	};

	/**
	 * Enum ConZ.EConZSquadMemberRank
	 */
	enum class EConZSquadMemberRank : uint8_t
	{
		None      = 0,
		Member    = 1,
		Enforcer  = 2,
		Underboss = 3,
		Boss      = 4,
		MAX       = 5
	};

	/**
	 * Enum ConZ.EFishSpecies
	 */
	enum class EFishSpecies : uint8_t
	{
		None         = 0,
		Bass         = 1,
		Catfish      = 2,
		Pike         = 3,
		Carp         = 4,
		Amur         = 5,
		Bleak        = 6,
		Chub         = 7,
		Ruffe        = 8,
		PrussianCarp = 9,
		CrucianCarp  = 10,
		Sardine      = 11,
		Dentex       = 12,
		Orata        = 13,
		Tuna         = 14,
		Count        = 15,
		MAX          = 16
	};

	/**
	 * Enum ConZ.EChatType
	 */
	enum class EChatType : uint8_t
	{
		Default       = 0,
		Local         = 1,
		Global        = 2,
		Squad         = 3,
		Admin         = 4,
		CommandsOnly  = 5,
		ServerMessage = 6,
		Error         = 7,
		MAX           = 8
	};

	/**
	 * Enum ConZ.EConZGender
	 */
	enum class EConZGender : uint8_t
	{
		Unspecified = 0,
		Female      = 1,
		Male        = 2,
		Count       = 3,
		MAX         = 4
	};

	/**
	 * Enum ConZ.ESortOrder
	 */
	enum class ESortOrder : uint8_t
	{
		Ascending  = 0,
		Descending = 1,
		MAX        = 2
	};

	/**
	 * Enum ConZ.EEventsRankingStatsOrderByField
	 */
	enum class EEventsRankingStatsOrderByField : uint8_t
	{
		FamePoints  = 0,
		EventScore  = 1,
		EventKills  = 2,
		EventDeaths = 3,
		MAX         = 4
	};

	/**
	 * Enum ConZ.ESkillLevel
	 */
	enum class ESkillLevel : uint8_t
	{
		NoSkill       = 0,
		Basic         = 1,
		Medium        = 2,
		Advanced      = 3,
		AboveAdvanced = 4,
		Count         = 5,
		MAX           = 6
	};

	/**
	 * Enum ConZ.EAnimalAction
	 */
	enum class EAnimalAction : uint8_t
	{
		None       = 0,
		Eat        = 1,
		Rest       = 2,
		Attack     = 3,
		Sit        = 4,
		Wait       = 5,
		Intimidate = 6,
		Alert      = 7,
		Turn       = 8,
		MAX        = 9
	};

	/**
	 * Enum ConZ.EFishingState
	 */
	enum class EFishingState : uint8_t
	{
		None            = 0,
		Idle            = 1,
		EnterActive     = 2,
		Active          = 3,
		LeaveActive     = 4,
		CastInitiated   = 5,
		LongCast        = 6,
		ShortCast       = 7,
		LongCasting     = 8,
		ShortCasting    = 9,
		LongCastingEnd  = 10,
		ShortCastingEnd = 11,
		Bait            = 12,
		PullStart       = 13,
		PullEnd         = 14,
		Hook            = 15,
		FishCaught      = 16,
		KeepFish        = 17,
		DiscardFish     = 18,
		WireBreak       = 19,
		MAX             = 20
	};

	/**
	 * Enum ConZ.EFishingActionNotifyType
	 */
	enum class EFishingActionNotifyType : uint8_t
	{
		None              = 0,
		EnterActive       = 1,
		LeaveActive       = 2,
		StartCastEnd      = 3,
		CastingThreshold  = 4,
		ShortRelease      = 5,
		Release           = 6,
		LongCastEnd       = 7,
		ShortCastEnd      = 8,
		FishingActionEnd  = 9,
		PullStartFinished = 10,
		PullEndFinished   = 11,
		ShowCaughtFish    = 12,
		KeepFish          = 13,
		DiscardFish       = 14,
		WireBreakEnd      = 15,
		MAX               = 16
	};

	/**
	 * Enum ConZ.EClothesType
	 */
	enum class EClothesType : uint8_t
	{
		None              = 0,
		Back              = 1,
		HeadUpper         = 2,
		HeadLower         = 3,
		Eyes              = 4,
		Ears              = 5,
		HeadUpperSkeletal = 6,
		Head              = 7,
		Neck              = 8,
		Body_Armor        = 9,
		Body_LongSleeves  = 10,
		Body_ShortSleeves = 11,
		Waist             = 12,
		Hands             = 13,
		Legs              = 14,
		Feet              = 15,
		Underwear         = 16,
		PenisWarmer       = 17,
		Suit              = 18,
		Count             = 19,
		MAX               = 20
	};

	/**
	 * Enum ConZ.EBodyPart
	 */
	enum class EBodyPart : uint8_t
	{
		Unknown       = 0,
		Head          = 1,
		Chest         = 2,
		Abdomen       = 3,
		ArmLeftLower  = 4,
		ArmLeftUpper  = 5,
		ArmRightLower = 6,
		ArmRightUpper = 7,
		LegLeftLower  = 8,
		LegLeftUpper  = 9,
		LegRightLower = 10,
		LegRightUpper = 11,
		Count         = 12,
		MAX           = 13
	};

	/**
	 * Enum ConZ.EEnvironmentClass
	 */
	enum class EEnvironmentClass : uint8_t
	{
		Indoor_Small  = 0,
		Indoor_Medium = 1,
		Indoor_Large  = 2,
		Outdoor_Large = 3,
		Count         = 4,
		MAX           = 5
	};

	/**
	 * Enum ConZ.EDetectHitCollisionType
	 */
	enum class EDetectHitCollisionType : uint8_t
	{
		None = 0,
		Head = 1,
		Body = 2,
		Legs = 3,
		MAX  = 4
	};

	/**
	 * Enum ConZ.ECharacterActionEndState
	 */
	enum class ECharacterActionEndState : uint8_t
	{
		None            = 0,
		Regular         = 1,
		ConditionNotMet = 2,
		Canceled        = 3,
		Failed          = 4,
		Terminated      = 5,
		MAX             = 6
	};

	/**
	 * Enum ConZ.ECharacterActionAckType
	 */
	enum class ECharacterActionAckType : uint8_t
	{
		None  = 0,
		Begin = 1,
		End   = 2,
		MAX   = 3
	};

	/**
	 * Enum ConZ.EAttackType
	 */
	enum class EAttackType : uint8_t
	{
		Slash  = 0,
		Pierce = 1,
		MAX    = 2
	};

	/**
	 * Enum ConZ.EHitSeverity
	 */
	enum class EHitSeverity : uint8_t
	{
		VeryLight = 0,
		Light     = 1,
		Medium    = 2,
		Heavy     = 3,
		VeryHeavy = 4,
		Count     = 5,
		MAX       = 6
	};

	/**
	 * Enum ConZ.ECharacterImpactSourceSoundCategory
	 */
	enum class ECharacterImpactSourceSoundCategory : uint8_t
	{
		Any          = 0,
		Head_Bare    = 1,
		Hands_Bare   = 2,
		Hands_Gloved = 3,
		Legs_Bare    = 4,
		Claws        = 5,
		Jaws         = 6,
		Blunt_Wood   = 7,
		Blunt_Metal  = 8,
		Sharp_Metal  = 9,
		MAX          = 10
	};

	/**
	 * Enum ConZ.EAITeam
	 */
	enum class EAITeam : uint8_t
	{
		Prisoner = 0,
		Zombie   = 1,
		Animal   = 2,
		TEC1     = 3,
		Vehicle  = 4,
		Neutral  = 5,
		Num      = 6,
		None     = 7,
		MAX      = 8
	};

	/**
	 * Enum ConZ.EConZPxDominanceGroup
	 */
	enum class EConZPxDominanceGroup : uint8_t
	{
		Default     = 0,
		MediumPawns = 1,
		LargePawns  = 2,
		MAX         = 3
	};

	/**
	 * Enum ConZ.EPrisonerBorderCrossingPenalty
	 */
	enum class EPrisonerBorderCrossingPenalty : uint8_t
	{
		None        = 0,
		Penalty1    = 1,
		Penalty2    = 2,
		Penalty3    = 3,
		Penalty4    = 4,
		DeadPenalty = 5,
		MAX         = 6
	};

	/**
	 * Enum ConZ.EPrisonerCommonSpawnLocation
	 */
	enum class EPrisonerCommonSpawnLocation : uint8_t
	{
		None   = 0,
		Random = 1,
		Sector = 2,
		Home   = 3,
		Squad  = 4,
		Event  = 5,
		MAX    = 6
	};

	/**
	 * Enum ConZ.ETabMode
	 */
	enum class ETabMode : uint8_t
	{
		None      = 0,
		Inventory = 1,
		BCU       = 2,
		Crafting  = 3,
		Journal   = 4,
		Squad     = 5,
		Events    = 6,
		Health    = 7,
		Buy       = 8,
		Sell      = 9,
		Last      = 10,
		MAX       = 11
	};

	/**
	 * Enum ConZ.EWeaponMalfunction
	 */
	enum class EWeaponMalfunction : uint8_t
	{
		None                 = 0,
		BadRound             = 1,
		StovePipe            = 2,
		RoundNotLoaded       = 3,
		DoubleFeed           = 4,
		StuckBullet          = 5,
		ClipPartiallyEjected = 6,
		Count                = 7,
		MAX                  = 8
	};

	/**
	 * Enum ConZ.EAmmunitionCartridgeState
	 */
	enum class EAmmunitionCartridgeState : uint8_t
	{
		Default    = 0,
		Used       = 1,
		Bad        = 2,
		BadAndUsed = 3,
		MAX        = 4
	};

	/**
	 * Enum ConZ.EThrowingAnimationType
	 */
	enum class EThrowingAnimationType : uint8_t
	{
		Default    = 0,
		FromWeapon = 1,
		FromCombat = 2,
		FromIdle   = 3,
		MAX        = 4
	};

	/**
	 * Enum ConZ.EPrisonerMovementPace
	 */
	enum class EPrisonerMovementPace : uint8_t
	{
		NotMoving = 0,
		Slow      = 1,
		Medium    = 2,
		Fast      = 3,
		Count     = 4,
		First     = 5,
		Last      = 6,
		MAX       = 7
	};

	/**
	 * Enum ConZ.EPrisonerNearbyFoliageType
	 */
	enum class EPrisonerNearbyFoliageType : uint8_t
	{
		None = 0,
		Tree = 1,
		Bush = 2,
		MAX  = 3
	};

	/**
	 * Enum ConZ.EPrisonerCombatMode
	 */
	enum class EPrisonerCombatMode : uint8_t
	{
		None         = 0,
		MeleeUnarmed = 1,
		MeleeWeapon  = 2,
		Firearm      = 3,
		MAX          = 4
	};

	/**
	 * Enum ConZ.EHoldBreathState
	 */
	enum class EHoldBreathState : uint8_t
	{
		None             = 0,
		BreathIn         = 1,
		HoldBreath       = 2,
		BreathOut        = 3,
		Breathless       = 4,
		BreathInRecovery = 5,
		Count            = 6,
		MAX              = 7
	};

	/**
	 * Enum ConZ.EPrisonerWettablePart
	 */
	enum class EPrisonerWettablePart : uint8_t
	{
		Head      = 0,
		UpperBody = 1,
		LowerBody = 2,
		Feet      = 3,
		Count     = 4,
		MAX       = 5
	};

	/**
	 * Enum ConZ.EPrisonerMeleeTargetSelectionMode
	 */
	enum class EPrisonerMeleeTargetSelectionMode : uint8_t
	{
		Manual        = 0,
		SemiAutomatic = 1,
		Automatic     = 2,
		MAX           = 3
	};

	/**
	 * Enum ConZ.EMotionIntensity
	 */
	enum class EMotionIntensity : uint8_t
	{
		None   = 0,
		Light  = 1,
		Medium = 2,
		Heavy  = 3,
		MAX    = 4
	};

	/**
	 * Enum ConZ.EPrisonerStance
	 */
	enum class EPrisonerStance : uint8_t
	{
		Standing  = 0,
		Crouching = 1,
		Prone     = 2,
		Swimming  = 3,
		Count     = 4,
		MAX       = 5
	};

	/**
	 * Enum ConZ.EVehicleWeaponAimingStance
	 */
	enum class EVehicleWeaponAimingStance : uint8_t
	{
		Default = 0,
		Leaning = 1,
		Count   = 2,
		MAX     = 3
	};

	/**
	 * Enum ConZ.ESkillAttribute
	 */
	enum class ESkillAttribute : uint8_t
	{
		Constitution = 0,
		Dexterity    = 1,
		Intelligence = 2,
		Strength     = 3,
		MAX          = 4
	};

	/**
	 * Enum ConZ.EDeluxeVersion
	 */
	enum class EDeluxeVersion : uint8_t
	{
		SupporterPack1       = 0,
		SupporterPack2       = 1,
		Character_DannyTrejo = 2,
		MAX                  = 3
	};

	/**
	 * Enum ConZ.EPlayableInstrumentTone
	 */
	enum class EPlayableInstrumentTone : uint8_t
	{
		C     = 0,
		Db    = 1,
		D     = 2,
		Eb    = 3,
		E     = 4,
		F     = 5,
		Gb    = 6,
		G     = 7,
		Ab    = 8,
		A     = 9,
		Bb    = 10,
		B     = 11,
		C2    = 12,
		Count = 13,
		MAX   = 14
	};

	/**
	 * Enum ConZ.EHandsHolstersType
	 */
	enum class EHandsHolstersType : uint8_t
	{
		Hands        = 0,
		HolsterLeft  = 1,
		HolsterRight = 2,
		MAX          = 3
	};

	/**
	 * Enum ConZ.EDamageChannel
	 */
	enum class EDamageChannel : uint8_t
	{
		UncategorizedDamage = 0,
		FallDamage          = 1,
		PuppetDamage        = 2,
		SuicidePuppetDamage = 3,
		SentryDamage        = 4,
		AnimalDamage        = 5,
		BaseDefenseDamage   = 6,
		VehicleDamage       = 7,
		BoxingDamage        = 8,
		MeleeWeaponDamage   = 9,
		ThrowingDamage      = 10,
		ProjectileDamage    = 11,
		ExplosiveDamage     = 12,
		TrapDamage          = 13,
		DamageToBases       = 14,
		DamageToVehicles    = 15,
		Count               = 16,
		MAX                 = 17
	};

	/**
	 * Enum ConZ.ECarryingItemState
	 */
	enum class ECarryingItemState : uint8_t
	{
		None = 0,
		Idle = 1,
		MAX  = 2
	};

	/**
	 * Enum ConZ.EPlayingInstrumentState
	 */
	enum class EPlayingInstrumentState : uint8_t
	{
		None    = 0,
		Exiting = 1,
		Idle    = 2,
		Playing = 3,
		MAX     = 4
	};

	/**
	 * Enum ConZ.EScopingWithItemInHandsState
	 */
	enum class EScopingWithItemInHandsState : uint8_t
	{
		None               = 0,
		Starting           = 1,
		Scoping            = 2,
		StoppingWithEffect = 3,
		StoppingNoEffect   = 4,
		MAX                = 5
	};

	/**
	 * Enum ConZ.EWeaponFiringMode
	 */
	enum class EWeaponFiringMode : uint8_t
	{
		Automatic  = 0,
		SingleShot = 1,
		Burst      = 2,
		Count      = 3,
		MAX        = 4
	};

	/**
	 * Enum ConZ.EUnmountFlags
	 */
	enum class EUnmountFlags : uint8_t
	{
		None                       = 0,
		TeleportOutside            = 1,
		SaveMounteesToDatabase     = 2,
		ShouldFindUnmountTransform = 3,
		ForceUnmount               = 4,
		MAX                        = 5
	};

	/**
	 * Enum ConZ.EWeaponAimingType
	 */
	enum class EWeaponAimingType : uint8_t
	{
		None          = 0,
		Hip           = 1,
		DownTheSights = 2,
		MAX           = 3
	};

	/**
	 * Enum ConZ.EDodgeDirectionType
	 */
	enum class EDodgeDirectionType : uint8_t
	{
		Front = 0,
		Back  = 1,
		Left  = 2,
		Right = 3,
		MAX   = 4
	};

	/**
	 * Enum ConZ.EPrisonerMountSlotFlags
	 */
	enum class EPrisonerMountSlotFlags : uint8_t
	{
		None                    = 0,
		HasMountedSlot          = 1,
		ShouldHideAttachedItems = 2,
		MAX                     = 3
	};

	/**
	 * Enum ConZ.EWeaponMalfunctionEvent
	 */
	enum class EWeaponMalfunctionEvent : uint8_t
	{
		RoundAdded                 = 0,
		ChamberOpened              = 1,
		ChamberOpenedCasingEjected = 2,
		ChamberOpenedRoundEjected  = 3,
		ChamberClosed              = 4,
		ChamberClosedRoundLoaded   = 5,
		AttachmentAdded            = 6,
		MAX                        = 7
	};

	/**
	 * Enum ConZ.EWeaponType
	 */
	enum class EWeaponType : uint8_t
	{
		Rifle   = 0,
		Handgun = 1,
		Bow     = 2,
		Count   = 3,
		MAX     = 4
	};

	/**
	 * Enum ConZ.EWeaponActionNotifyType
	 */
	enum class EWeaponActionNotifyType : uint8_t
	{
		None                           = 0,
		ChamberOpened                  = 1,
		ChamberClosed                  = 2,
		ChamberOpenedClosed            = 3,
		BowInsertArrow                 = 4,
		BowRemoveArrow                 = 5,
		CompoundBowTuneDrawWeight      = 6,
		StaminaDrained                 = 7,
		DropMagazine                   = 8,
		ClearMalfunction               = 9,
		ChamberOpenedSync              = 10,
		ChamberClosedSync              = 11,
		ChamberOpenedClosedSync        = 12,
		ClearMalfunctionRoundNotLoaded = 13,
		ShowEjectCasing                = 14,
		ShowEjectLiveRound             = 15,
		CrossbowCock                   = 16,
		Fire                           = 17,
		SetupForReload                 = 18,
		DrumRolled                     = 19,
		MAX                            = 20
	};

	/**
	 * Enum ConZ.EWeaponBehaviourMode
	 */
	enum class EWeaponBehaviourMode : uint8_t
	{
		Default = 0,
		Inspect = 1,
		MAX     = 2
	};

	/**
	 * Enum ConZ.EWeaponMuzzleEffectsSpawType
	 */
	enum class EWeaponMuzzleEffectsSpawType : uint8_t
	{
		AttachedToBarrel = 0,
		AtLocation       = 1,
		MAX              = 2
	};

	/**
	 * Enum ConZ.EWeaponCategory
	 */
	enum class EWeaponCategory : uint8_t
	{
		ThrowingWeapons = 0,
		RangedWeapons   = 1,
		Handguns        = 2,
		SubmachineGuns  = 3,
		Rifles          = 4,
		Shotguns        = 5,
		AutomaticRifles = 6,
		SniperRifles    = 7,
		Bow             = 8,
		Count           = 9,
		MAX             = 10
	};

	/**
	 * Enum ConZ.EWeaponFiringStateType
	 */
	enum class EWeaponFiringStateType : uint8_t
	{
		Automatic     = 0,
		SemiAutomatic = 1,
		Manual        = 2,
		MAX           = 3
	};

	/**
	 * Enum ConZ.EPrisonerHUDMode
	 */
	enum class EPrisonerHUDMode : uint8_t
	{
		Normal      = 0,
		Target      = 1,
		Map         = 2,
		DroneNormal = 3,
		DroneMap    = 4,
		MAX         = 5
	};

	/**
	 * Enum ConZ.EBodySlot
	 */
	enum class EBodySlot : uint8_t
	{
		Head  = 0,
		Chest = 1,
		Legs  = 2,
		Feet  = 3,
		Count = 4,
		MAX   = 5
	};

	/**
	 * Enum ConZ.EClothesPart
	 */
	enum class EClothesPart : uint8_t
	{
		None      = 0,
		BodyUpper = 1,
		BodyLower = 2,
		Head      = 3,
		Eyes      = 4,
		Neck      = 5,
		Hands     = 6,
		ArmUpper  = 7,
		ArmLower  = 8,
		Legs      = 9,
		Feet      = 10,
		Count     = 11,
		MAX       = 12
	};

	/**
	 * Enum ConZ.EOptionalState
	 */
	enum class EOptionalState : uint8_t
	{
		None   = 0,
		Add    = 1,
		Remove = 2,
		MAX    = 3
	};

	/**
	 * Enum ConZ.ERecipeAvailabilityState
	 */
	enum class ERecipeAvailabilityState : uint8_t
	{
		None            = 0,
		SkillLow        = 1,
		NoIngredients   = 2,
		SomeIngredients = 3,
		AllIngredients  = 4,
		MAX             = 5
	};

	/**
	 * Enum ConZ.EInventoryNodeWidgetType
	 */
	enum class EInventoryNodeWidgetType : uint8_t
	{
		None               = 0,
		Inventory          = 1,
		InventoryContainer = 2,
		HandsAndHolsters   = 3,
		QuickAccess        = 4,
		ClothesSideLayer   = 5,
		ToolTip            = 6,
		Vicinity           = 7,
		VicinityContainer  = 8,
		MAX                = 9
	};

	/**
	 * Enum ConZ.EListSpawnedVehiclesAdminCommandVehicleCategory
	 */
	enum class EListSpawnedVehiclesAdminCommandVehicleCategory : uint8_t
	{
		MotorizedVehicles    = 0,
		HumanPoweredVehicles = 1,
		SUVs                 = 2,
		Quads                = 3,
		Pickups              = 4,
		Tractors             = 5,
		Wheelbarrows         = 6,
		Motorcycles          = 7,
		Count                = 8,
		MAX                  = 9
	};

	/**
	 * Enum ConZ.EFlyingFindPathFailureResponse
	 */
	enum class EFlyingFindPathFailureResponse : uint8_t
	{
		None                 = 0,
		RandomNewDestination = 1,
		ReturnToPrevious     = 2,
		ForceMovement        = 3,
		MAX                  = 4
	};

	/**
	 * Enum ConZ.EAnimalSpecies
	 */
	enum class EAnimalSpecies : uint8_t
	{
		None    = 0,
		Bear    = 1,
		Bird    = 2,
		Boar    = 3,
		Chicken = 4,
		Cow     = 5,
		Crow    = 6,
		Deer    = 7,
		Donkey  = 8,
		Goat    = 9,
		Horse   = 10,
		Pig     = 11,
		Rabbit  = 12,
		Seagull = 13,
		Sheep   = 14,
		Wolf    = 15,
		Count   = 16,
		MAX     = 17
	};

	/**
	 * Enum ConZ.EAnimalStance
	 */
	enum class EAnimalStance : uint8_t
	{
		Breathing = 0,
		Idle      = 1,
		Agressive = 2,
		Alerted   = 3,
		MAX       = 4
	};

	/**
	 * Enum ConZ.EAnimalActivityCycle
	 */
	enum class EAnimalActivityCycle : uint8_t
	{
		Diurnal   = 0,
		Nocturnal = 1,
		Both      = 2,
		MAX       = 3
	};

	/**
	 * Enum ConZ.EAnimal2Sound
	 */
	enum class EAnimal2Sound : uint8_t
	{
		None       = 0,
		Idle       = 1,
		Angry      = 2,
		Attack     = 3,
		TakeDamage = 4,
		Kill       = 5,
		Scared     = 6,
		Alerted    = 7,
		MAX        = 8
	};

	/**
	 * Enum ConZ.EAnimNotifyStaminDrainType
	 */
	enum class EAnimNotifyStaminDrainType : uint8_t
	{
		OnBegin   = 0,
		Continous = 1,
		MAX       = 2
	};

	/**
	 * Enum ConZ.AnimNotifyState_FadeForAction
	 */
	enum class EAnimNotifyState_FadeForAction : uint8_t
	{
		AnimNotifyState_FadeForAction_All                 = 0,
		AnimNotifyState_FadeForAction_InFirstPersonView   = 1,
		AnimNotifyState_FadeForAction_InThirdPersonView   = 2,
		AnimNotifyState_FadeForAction_AnimNotifyState_MAX = 3
	};

	/**
	 * Enum ConZ.EWaterZoneType
	 */
	enum class EWaterZoneType : uint8_t
	{
		None    = 0,
		Shallow = 1,
		Deep    = 2,
		Weeds   = 3,
		MAX     = 4
	};

	/**
	 * Enum ConZ.ECraftingRecipeCategory
	 */
	enum class ECraftingRecipeCategory : uint8_t
	{
		None           = 0,
		Tools          = 1,
		Weapons        = 2,
		Drinks         = 3,
		Food           = 4,
		Clothes        = 5,
		BaseBuilding   = 6,
		Fortifications = 7,
		Security       = 8,
		MAX            = 9
	};

	/**
	 * Enum ConZ.EBlueprintItemActionType
	 */
	enum class EBlueprintItemActionType : uint8_t
	{
		BlueprintPlaced    = 0,
		BlueprintFilled    = 1,
		BlueprintCompleted = 2,
		MAX                = 3
	};

	/**
	 * Enum ConZ.ESplineAxis
	 */
	enum class ESplineAxis : uint8_t
	{
		X   = 0,
		Y   = 1,
		Z   = 2,
		MAX = 3
	};

	/**
	 * Enum ConZ.EWireType
	 */
	enum class EWireType : uint8_t
	{
		Green  = 0,
		Yellow = 1,
		Red    = 2,
		Count  = 3,
		MAX    = 4
	};

	/**
	 * Enum ConZ.EBoundBodyPart
	 */
	enum class EBoundBodyPart : uint8_t
	{
		Hands = 0,
		Feet  = 1,
		MAX   = 2
	};

	/**
	 * Enum ConZ.EBruiseZone
	 */
	enum class EBruiseZone : uint8_t
	{
		Left   = 0,
		Middle = 1,
		Right  = 2,
		Count  = 3,
		MAX    = 4
	};

	/**
	 * Enum ConZ.EBruiseLayer
	 */
	enum class EBruiseLayer : uint8_t
	{
		Light  = 0,
		Medium = 1,
		Hard   = 2,
		Count  = 3,
		MAX    = 4
	};

	/**
	 * Enum ConZ.ECardinalDirection
	 */
	enum class ECardinalDirection : uint8_t
	{
		None  = 0,
		North = 1,
		East  = 2,
		South = 3,
		West  = 4,
		MAX   = 5
	};

	/**
	 * Enum ConZ.EChainsawEngineState
	 */
	enum class EChainsawEngineState : uint8_t
	{
		TurnedOff = 0,
		TurnedOn  = 1,
		MAX       = 2
	};

	/**
	 * Enum ConZ.EChainsawOwnerRelatedFunctionalityState
	 */
	enum class EChainsawOwnerRelatedFunctionalityState : uint8_t
	{
		Default        = 0,
		PlayingSound   = 1,
		PendingTurnOn  = 2,
		PendingTurnOff = 3,
		MAX            = 4
	};

	/**
	 * Enum ConZ.ECharacterActionActivity
	 */
	enum class ECharacterActionActivity : uint8_t
	{
		None             = 0,
		AimDownTheSights = 1,
		MAX              = 2
	};

	/**
	 * Enum ConZ.ECharacterActionTerminatingEvent
	 */
	enum class ECharacterActionTerminatingEvent : uint8_t
	{
		Generic         = 0,
		InputKeyEsc     = 1,
		ToolUnavailable = 2,
		FirePressed     = 3,
		MAX             = 4
	};

	/**
	 * Enum ConZ.ECharacterActionNotifyType
	 */
	enum class ECharacterActionNotifyType : uint8_t
	{
		None                     = 0,
		AddMagazine              = 1,
		RemoveMagazine           = 2,
		InsertCartridge          = 3,
		InsertCartridgeAtFront   = 4,
		SwapWeapons              = 5,
		Chop                     = 6,
		CommitSuicide            = 7,
		IgniteFlare              = 8,
		BuryBreach               = 9,
		BuryDump                 = 10,
		ThrowFPReleased          = 11,
		ThrowTPReleased          = 12,
		ThrowFinished            = 13,
		StopUsingHandCorrections = 14,
		PinPulled                = 15,
		Unmount                  = 16,
		ChangeWeaponFiringMode   = 17,
		OpenDoor                 = 18,
		CloseDoor                = 19,
		RemoveAmmoFromWeapon     = 20,
		CheckWeaponAmmo          = 21,
		CheckWeaponFiringMode    = 22,
		ChainsawStartEngineLoop  = 23,
		ShowItemStatus           = 24,
		SpawnParticles           = 25,
		DestroyParticles         = 26,
		StartFire                = 27,
		Urinate                  = 28,
		ShowPenis                = 29,
		HidePenis                = 30,
		MAX                      = 31
	};

	/**
	 * Enum ConZ.ECharacterActionState
	 */
	enum class ECharacterActionState : uint8_t
	{
		None                 = 0,
		WaitingBeginOnServer = 1,
		Executing            = 2,
		Ended                = 3,
		MAX                  = 4
	};

	/**
	 * Enum ConZ.ECharacterActionFlags
	 */
	enum class ECharacterActionFlags : uint8_t
	{
		None                     = 0,
		ClientWaitBeginOnServer  = 1,
		AllWaitEndOnOwningClient = 2,
		CanBeAborted             = 3,
		MAX                      = 4
	};

	/**
	 * Enum ConZ.ECharacterActionConstraint
	 */
	enum class ECharacterActionConstraint : uint8_t
	{
		None       = 0,
		Move       = 1,
		Turn       = 2,
		Stance     = 3,
		ProneInOut = 4,
		Lean       = 5,
		MAX        = 6
	};

	/**
	 * Enum ConZ.ECharacterLegsImpactSoundCategory
	 */
	enum class ECharacterLegsImpactSoundCategory : uint8_t
	{
		Any            = 0,
		Bare           = 1,
		Blocked        = 2,
		LightlyClothed = 3,
		MAX            = 4
	};

	/**
	 * Enum ConZ.ECharacterArmsImpactSoundCategory
	 */
	enum class ECharacterArmsImpactSoundCategory : uint8_t
	{
		Any            = 0,
		Bare           = 1,
		Blocked        = 2,
		LightlyClothed = 3,
		MAX            = 4
	};

	/**
	 * Enum ConZ.ECharacterTorsoImpactSoundCategory
	 */
	enum class ECharacterTorsoImpactSoundCategory : uint8_t
	{
		Any            = 0,
		Bare           = 1,
		Blocked        = 2,
		LightlyClothed = 3,
		MAX            = 4
	};

	/**
	 * Enum ConZ.ECharacterHeadImpactSoundCategory
	 */
	enum class ECharacterHeadImpactSoundCategory : uint8_t
	{
		Any     = 0,
		Bare    = 1,
		Blocked = 2,
		Helmet  = 3,
		MAX     = 4
	};

	/**
	 * Enum ConZ.ECharacterPainSoundSeverity
	 */
	enum class ECharacterPainSoundSeverity : uint8_t
	{
		Light    = 0,
		Medium   = 1,
		Heavy    = 2,
		Stun     = 3,
		Knockout = 4,
		Death    = 5,
		MAX      = 6
	};

	/**
	 * Enum ConZ.ECharacterSpawnerRange
	 */
	enum class ECharacterSpawnerRange : uint8_t
	{
		Long  = 0,
		Short = 1,
		MAX   = 2
	};

	/**
	 * Enum ConZ.ESpawnType
	 */
	enum class ESpawnType : uint8_t
	{
		POI      = 0,
		Exterior = 1,
		Interior = 2,
		MAX      = 3
	};

	/**
	 * Enum ConZ.ECharacterStatsOrderByField
	 */
	enum class ECharacterStatsOrderByField : uint8_t
	{
		FamePoints  = 0,
		EventScore  = 1,
		EventKills  = 2,
		EventDeaths = 3,
		MAX         = 4
	};

	/**
	 * Enum ConZ.EMusicPlayerCommandType
	 */
	enum class EMusicPlayerCommandType : uint8_t
	{
		TurnOnOff        = 0,
		PlayPause        = 1,
		RadioMusicPlayer = 2,
		MAX              = 3
	};

	/**
	 * Enum ConZ.EInteractionTargetType
	 */
	enum class EInteractionTargetType : uint8_t
	{
		Self                = 0,
		HoveredInteractable = 1,
		Specified           = 2,
		MAX                 = 3
	};

	/**
	 * Enum ConZ.EClientSettingCategory
	 */
	enum class EClientSettingCategory : uint8_t
	{
		Game     = 0,
		Mouse    = 1,
		Video    = 2,
		Graphics = 3,
		Sound    = 4,
		Controls = 5,
		Count    = 6,
		MAX      = 7
	};

	/**
	 * Enum ConZ.ECollisionDamageType
	 */
	enum class ECollisionDamageType : uint8_t
	{
		Undefined  = 0,
		Melee      = 1,
		Projectile = 2,
		Throw      = 3,
		MAX        = 4
	};

	/**
	 * Enum ConZ.ECompassType
	 */
	enum class ECompassType : uint8_t
	{
		None                     = 0,
		NorthOnly                = 1,
		CardinalOnly             = 2,
		CardinalAndIntercardinal = 3,
		Everything               = 4,
		Count                    = 5,
		MAX                      = 6
	};

	/**
	 * Enum ConZ.EAnimalMovementPace
	 */
	enum class EAnimalMovementPace : uint8_t
	{
		Sneak = 0,
		Walk  = 1,
		Trot  = 2,
		Run   = 3,
		MAX   = 4
	};

	/**
	 * Enum ConZ.EAnimalAgressivness
	 */
	enum class EAnimalAgressivness : uint8_t
	{
		Timid     = 0,
		Moderate  = 1,
		Agressive = 2,
		MAX       = 3
	};

	/**
	 * Enum ConZ.EAnimalMode
	 */
	enum class EAnimalMode : uint8_t
	{
		None     = 0,
		Roam     = 1,
		Alert    = 2,
		Observe  = 3,
		TrotAway = 4,
		Aggro    = 5,
		Flee     = 6,
		MAX      = 7
	};

	/**
	 * Enum ConZ.EConfigFile
	 */
	enum class EConfigFile : uint8_t
	{
		None             = 0,
		Engine           = 1,
		GameUserSettings = 2,
		ServerSettings   = 3,
		MAX              = 4
	};

	/**
	 * Enum ConZ.EBaseBuildingDebugMode
	 */
	enum class EBaseBuildingDebugMode : uint8_t
	{
		None             = 0,
		Basic            = 1,
		RadialDamage     = 2,
		InteractionZones = 3,
		BaseBounds       = 4,
		MAX              = 5
	};

	/**
	 * Enum ConZ.EConZBaseErrorMessage
	 */
	enum class EConZBaseErrorMessage : uint8_t
	{
		None                        = 0,
		CantPlaceMask               = 1,
		CantPlaceDuplicateFlag      = 2,
		CantPlaceEnemyFlag          = 3,
		CantPlaceMustBeOnFoundation = 4,
		CantPlaceOnOtherElements    = 5,
		CantPlaceNoBase             = 6,
		CantPlaceNoFlag             = 7,
		CantPlaceMaxInstances       = 8,
		MAX                         = 9
	};

	/**
	 * Enum ConZ.EConZBaseEventType
	 */
	enum class EConZBaseEventType : uint8_t
	{
		None               = 0,
		ElementConstructed = 1,
		ElementRepaired    = 2,
		MAX                = 3
	};

	/**
	 * Enum ConZ.EConZPlacementHeightType
	 */
	enum class EConZPlacementHeightType : uint8_t
	{
		LowestPointHeight  = 0,
		HighestPointHeight = 1,
		AveragePointHeight = 2,
		MAX                = 3
	};

	/**
	 * Enum ConZ.FConZBaseFlagType
	 */
	enum class EFConZBaseFlagType : uint8_t
	{
		FConZBaseFlagType_None                  = 0,
		FConZBaseFlagType_Friendly              = 1,
		FConZBaseFlagType_Enemy                 = 2,
		FConZBaseFlagType_FConZBaseFlagType_MAX = 3
	};

	/**
	 * Enum ConZ.EElementSnapMarkerSocketType
	 */
	enum class EElementSnapMarkerSocketType : uint8_t
	{
		None            = 0,
		Horizontal      = 1,
		VerticalTop     = 2,
		VerticalBottom  = 3,
		TowerLevel1     = 4,
		TowerLevel2     = 5,
		Door            = 6,
		WallSocket      = 7,
		CeilingSocket   = 8,
		Stairs          = 9,
		WallPlatform    = 10,
		BedTop          = 11,
		HorizontalLeft  = 12,
		HorizontalRight = 13,
		EmptySocket13   = 14,
		EmptySocket14   = 15,
		EmptySocket15   = 16,
		MAX             = 17
	};

	/**
	 * Enum ConZ.EBaseElementType
	 */
	enum class EBaseElementType : uint8_t
	{
		None            = 0,
		Default         = 1,
		WoodenPalisade  = 2,
		SandBox         = 3,
		Door            = 4,
		Well            = 5,
		Platform        = 6,
		Watchtower      = 7,
		GunRack         = 8,
		Foundation      = 9,
		Flag            = 10,
		WallOrnament    = 11,
		CeilingOrnament = 12,
		Cabin           = 13,
		Stairs          = 14,
		NewWalls        = 15,
		WallGunRack     = 16,
		All             = 17,
		MAX             = 18
	};

	/**
	 * Enum ConZ.EConZBoatMeshType
	 */
	enum class EConZBoatMeshType : uint8_t
	{
		None            = 0,
		SM_MotorBoat_01 = 1,
		SM_MotorBoat_02 = 2,
		MAX             = 3
	};

	/**
	 * Enum ConZ.EBoatSailsState
	 */
	enum class EBoatSailsState : uint8_t
	{
		Folded   = 0,
		Deployed = 1,
		Broken   = 2,
		MAX      = 3
	};

	/**
	 * Enum ConZ.EBoatMountControlType
	 */
	enum class EBoatMountControlType : uint8_t
	{
		MotorProppeled = 0,
		Rowing         = 1,
		Paddling       = 2,
		Sailing        = 3,
		MAX            = 4
	};

	/**
	 * Enum ConZ.ECharacterHostileState
	 */
	enum class ECharacterHostileState : uint8_t
	{
		None                      = 0,
		Idle                      = 1,
		AlertedWithoutLineOfSight = 2,
		AlertedWithLineOfSight    = 3,
		MAX                       = 4
	};

	/**
	 * Enum ConZ.EMultiplayerDisabledReason
	 */
	enum class EMultiplayerDisabledReason : uint8_t
	{
		None                     = 0,
		FileIntegrityCompromised = 1,
		DllIntegrityCompromised  = 2,
		MAX                      = 3
	};

	/**
	 * Enum ConZ.EPlayPreparationsState
	 */
	enum class EPlayPreparationsState : uint8_t
	{
		StreamingCheck       = 0,
		AuthSend             = 1,
		AuthReceive          = 2,
		InitialSyncSend      = 3,
		InitialSyncReceive   = 4,
		ProcessInitialSync   = 5,
		SucceededSyncSend    = 6,
		SucceededSyncReceive = 7,
		Succeeded            = 8,
		Failed               = 9,
		MAX                  = 10
	};

	/**
	 * Enum ConZ.EConZWaterSplineType
	 */
	enum class EConZWaterSplineType : uint8_t
	{
		None   = 0,
		River  = 1,
		Lake   = 2,
		Ocean  = 3,
		Island = 4,
		MAX    = 5
	};

	/**
	 * Enum ConZ.ECraftingItemCategory
	 */
	enum class ECraftingItemCategory : uint8_t
	{
		None            = 0,
		ToolsAndWeapons = 1,
		Items           = 2,
		Food            = 3,
		BaseBuilding    = 4,
		MAX             = 5
	};

	/**
	 * Enum ConZ.ECraftingIngredientConsumptionHint
	 */
	enum class ECraftingIngredientConsumptionHint : uint8_t
	{
		None    = 0,
		Use     = 1,
		Destroy = 2,
		MAX     = 3
	};

	/**
	 * Enum ConZ.ECraftingType
	 */
	enum class ECraftingType : uint8_t
	{
		Use      = 0,
		Assemble = 1,
		Destroy  = 2,
		Attach   = 3,
		MAX      = 4
	};

	/**
	 * Enum ConZ.ECustomZoneEvent
	 */
	enum class ECustomZoneEvent : uint8_t
	{
		FallDamage          = 0,
		PuppetDamage        = 1,
		SuicidePuppetDamage = 2,
		SentryDamage        = 3,
		AnimalDamage        = 4,
		BaseDefenseDamage   = 5,
		VehicleDamage       = 6,
		BoxingDamage        = 7,
		MeleeWeaponDamage   = 8,
		ThrowingDamage      = 9,
		ProjectileDamage    = 10,
		ExplosiveDamage     = 11,
		TrapDamage          = 12,
		DamageToBases       = 13,
		DamageToVehicles    = 14,
		PlayerLockpicking   = 15,
		WorldLockpicking    = 16,
		BaseBuilding        = 17,
		VehicleParking      = 18,
		Count               = 19,
		MAX                 = 20
	};

	/**
	 * Enum ConZ.EDefaultCustomZoneState
	 */
	enum class EDefaultCustomZoneState : uint8_t
	{
		NotDefault = 0,
		Unmodified = 1,
		Modified   = 2,
		Deleted    = 3,
		MAX        = 4
	};

	/**
	 * Enum ConZ.ECustomZoneShape
	 */
	enum class ECustomZoneShape : uint8_t
	{
		Circle    = 0,
		Rectangle = 1,
		MAX       = 2
	};

	/**
	 * Enum ConZ.ECustomZoneEventHandlingMethod
	 */
	enum class ECustomZoneEventHandlingMethod : uint8_t
	{
		Ignore = 0,
		Allow  = 1,
		Block  = 2,
		Count  = 3,
		MAX    = 4
	};

	/**
	 * Enum ConZ.ECustomZoneSettingsMapMode
	 */
	enum class ECustomZoneSettingsMapMode : uint8_t
	{
		None               = 0,
		AddCircleRegion    = 1,
		AddRectangleRegion = 2,
		RemoveRegion       = 3,
		MAX                = 4
	};

	/**
	 * Enum ConZ.EDamageMagnitudeType
	 */
	enum class EDamageMagnitudeType : uint8_t
	{
		Small    = 0,
		Medium   = 1,
		Large    = 2,
		Knockout = 3,
		MAX      = 4
	};

	/**
	 * Enum ConZ.EHitDirectionType
	 */
	enum class EHitDirectionType : uint8_t
	{
		Front = 0,
		Left  = 1,
		Back  = 2,
		Right = 3,
		MAX   = 4
	};

	/**
	 * Enum ConZ.EDayPeriod
	 */
	enum class EDayPeriod : uint8_t
	{
		Nighttime = 0,
		Dawn      = 1,
		Daytime   = 2,
		Dusk      = 3,
		MAX       = 4
	};

	/**
	 * Enum ConZ.EDbConnectionOpenMode
	 */
	enum class EDbConnectionOpenMode : uint8_t
	{
		None      = 0,
		ReadOnly  = 1,
		ReadWrite = 2,
		MAX       = 3
	};

	/**
	 * Enum ConZ.EDialogAnimationState
	 */
	enum class EDialogAnimationState : uint8_t
	{
		None = 0,
		Show = 1,
		Hide = 2,
		MAX  = 3
	};

	/**
	 * Enum ConZ.EMineral
	 */
	enum class EMineral : uint8_t
	{
		Calcium    = 0,
		Iron       = 1,
		Magnesium  = 2,
		Phosphorus = 3,
		Potassium  = 4,
		Zinc       = 5,
		Copper     = 6,
		Manganese  = 7,
		Selenium   = 8,
		Count      = 9,
		MAX        = 10
	};

	/**
	 * Enum ConZ.EVitamin
	 */
	enum class EVitamin : uint8_t
	{
		A     = 0,
		B1    = 1,
		B2    = 2,
		B3    = 3,
		B4    = 4,
		B5    = 5,
		B6    = 6,
		B9    = 7,
		B12   = 8,
		C     = 9,
		D     = 10,
		E     = 11,
		K     = 12,
		Count = 13,
		MAX   = 14
	};

	/**
	 * Enum ConZ.EDisposition
	 */
	enum class EDisposition : uint8_t
	{
		Neutral = 0,
		Good    = 1,
		Bad     = 2,
		MAX     = 3
	};

	/**
	 * Enum ConZ.EDistantMeshStreamingBehavior
	 */
	enum class EDistantMeshStreamingBehavior : uint8_t
	{
		Default              = 0,
		LoadAsSoonAsPossible = 1,
		MAX                  = 2
	};

	/**
	 * Enum ConZ.EDoorUnlockDataType
	 */
	enum class EDoorUnlockDataType : uint8_t
	{
		Default = 0,
		Killbox = 1,
		MAX     = 2
	};

	/**
	 * Enum ConZ.ESlotType
	 */
	enum class ESlotType : uint8_t
	{
		None             = 0,
		LockSlot         = 1,
		ZapperSlot       = 2,
		RemoteSensorSlot = 3,
		MAX              = 4
	};

	/**
	 * Enum ConZ.EDroneSound
	 */
	enum class EDroneSound : uint8_t
	{
		None   = 0,
		Idle   = 1,
		Attack = 2,
		Kill   = 3,
		MAX    = 4
	};

	/**
	 * Enum ConZ.EDroneSightingMode
	 */
	enum class EDroneSightingMode : uint8_t
	{
		Follow   = 0,
		Flyby    = 1,
		Crashing = 2,
		Num      = 3,
		MAX      = 4
	};

	/**
	 * Enum ConZ.EDroneState
	 */
	enum class EDroneState : uint8_t
	{
		Initial     = 0,
		Leaving     = 1,
		Approaching = 2,
		Following   = 3,
		Flybying    = 4,
		Crashing    = 5,
		Num         = 6,
		MAX         = 7
	};

	/**
	 * Enum ConZ.EDropZoneGameEventPhase
	 */
	enum class EDropZoneGameEventPhase : uint8_t
	{
		Warmup  = 0,
		Search  = 1,
		Drop    = 2,
		Capture = 3,
		MAX     = 4
	};

	/**
	 * Enum ConZ.EFishBehavior
	 */
	enum class EFishBehavior : uint8_t
	{
		None           = 0,
		Normal         = 1,
		Fleeing        = 2,
		Aggressive     = 3,
		Attacking      = 4,
		Alerted        = 5,
		ForcedMovement = 6,
		Count          = 7,
		MAX            = 8
	};

	/**
	 * Enum ConZ.EFlareIgniteState
	 */
	enum class EFlareIgniteState : uint8_t
	{
		None       = 0,
		Start      = 1,
		Burning    = 2,
		Extinguish = 3,
		Finished   = 4,
		MAX        = 5
	};

	/**
	 * Enum ConZ.ESelectSource
	 */
	enum class ESelectSource : uint8_t
	{
		Child   = 0,
		Parent  = 1,
		Unknown = 2,
		MAX     = 3
	};

	/**
	 * Enum ConZ.EDigestionGroup
	 */
	enum class EDigestionGroup : uint8_t
	{
		Water                 = 0,
		Juices                = 1,
		SemiLiquid            = 2,
		Fruits1               = 3,
		Fruits3               = 4,
		Fruits4               = 5,
		Fruits5               = 6,
		Vegetables1           = 7,
		Vegetables2           = 8,
		Vegetables3           = 9,
		Vegetables4           = 10,
		SemiConcentratedCarbs = 11,
		ConcentratedCarbs1    = 12,
		ConcentratedCarbs2    = 13,
		ConcentratedCarbs3    = 14,
		SeedsNuts1            = 15,
		SeedsNuts2            = 16,
		Dairy1                = 17,
		Dairy2                = 18,
		Dairy3                = 19,
		Animal1               = 20,
		Animal2               = 21,
		Animal3               = 22,
		Animal4               = 23,
		Animal5               = 24,
		Animal6               = 25,
		Fish1                 = 26,
		Fish2                 = 27,
		Vitamins              = 28,
		CookedMeals           = 29,
		OilFat                = 30,
		MAX                   = 31
	};

	/**
	 * Enum ConZ.EGameEventPlayerRoundResult
	 */
	enum class EGameEventPlayerRoundResult : uint8_t
	{
		None = 0,
		Win  = 1,
		Lose = 2,
		Draw = 3,
		MAX  = 4
	};

	/**
	 * Enum ConZ.EGameEventNotificationType
	 */
	enum class EGameEventNotificationType : uint8_t
	{
		EventStarted          = 0,
		EventCanceled         = 1,
		EventEnded            = 2,
		NotEnoughParticipants = 3,
		ParticipantJoined     = 4,
		ParticipantLeft       = 5,
		MAX                   = 6
	};

	/**
	 * Enum ConZ.EGameEventParticipantState
	 */
	enum class EGameEventParticipantState : uint8_t
	{
		Registered = 0,
		Spawning   = 1,
		Alive      = 2,
		Dead       = 3,
		Left       = 4,
		MAX        = 5
	};

	/**
	 * Enum ConZ.EGameEventState
	 */
	enum class EGameEventState : uint8_t
	{
		Announced    = 0,
		RoundStarted = 1,
		RoundEnded   = 2,
		Ended        = 3,
		MAX          = 4
	};

	/**
	 * Enum ConZ.EGameEventBorderState
	 */
	enum class EGameEventBorderState : uint8_t
	{
		Off    = 0,
		On     = 1,
		Bright = 2,
		MAX    = 3
	};

	/**
	 * Enum ConZ.EGameEventTransportState
	 */
	enum class EGameEventTransportState : uint8_t
	{
		StandBy    = 0,
		Travelling = 1,
		Leaving    = 2,
		Landing    = 3,
		LiftOff    = 4,
		MAX        = 5
	};

	/**
	 * Enum ConZ.EGameResourceConsumptionMethod
	 */
	enum class EGameResourceConsumptionMethod : uint8_t
	{
		Eating   = 0,
		Drinking = 1,
		MAX      = 2
	};

	/**
	 * Enum ConZ.EGrappleEndType
	 */
	enum class EGrappleEndType : uint8_t
	{
		Normal      = 0,
		Successful  = 1,
		Interrupted = 2,
		MAX         = 3
	};

	/**
	 * Enum ConZ.ERagdollTransitionState
	 */
	enum class ERagdollTransitionState : uint8_t
	{
		None                   = 0,
		GoTo                   = 1,
		RecoverFrom            = 2,
		RecoverFromImmediately = 3,
		MAX                    = 4
	};

	/**
	 * Enum ConZ.EHitReactState
	 */
	enum class EHitReactState : uint8_t
	{
		None      = 0,
		Hit       = 1,
		Stun      = 2,
		Knockout  = 3,
		GettingUp = 4,
		Ragdoll   = 5,
		MAX       = 6
	};

	/**
	 * Enum ConZ.EGoToRagdollCaller
	 */
	enum class EGoToRagdollCaller : uint8_t
	{
		Default = 0,
		Montage = 1,
		MAX     = 2
	};

	/**
	 * Enum ConZ.EHUDVisibilityFlag
	 */
	enum class EHUDVisibilityFlag : uint8_t
	{
		None           = 0,
		UserInput      = 1,
		IntroCinematic = 2,
		PlasticSurgery = 3,
		All            = 4,
		MAX            = 5
	};

	/**
	 * Enum ConZ.EHUDMessageType
	 */
	enum class EHUDMessageType : uint8_t
	{
		Regular   = 0,
		Important = 1,
		MAX       = 2
	};

	/**
	 * Enum ConZ.EWarningType
	 */
	enum class EWarningType : uint8_t
	{
		Danger     = 0,
		Explosion  = 1,
		LifeThreat = 2,
		Watching   = 3,
		Traps      = 4,
		MAX        = 5
	};

	/**
	 * Enum ConZ.EInteractionState
	 */
	enum class EInteractionState : uint8_t
	{
		Busy                 = 0,
		NoInteractionDefined = 1,
		CanInteract          = 2,
		UnableToInteract     = 3,
		MAX                  = 4
	};

	/**
	 * Enum ConZ.EInventoryNodeWidgetDataType
	 */
	enum class EInventoryNodeWidgetDataType : uint8_t
	{
		Number     = 0,
		Text       = 1,
		Icon       = 2,
		Visibility = 3,
		Animation  = 4,
		MAX        = 5
	};

	/**
	 * Enum ConZ.EItemDebugMode
	 */
	enum class EItemDebugMode : uint8_t
	{
		None  = 0,
		Basic = 1,
		Count = 2,
		MAX   = 3
	};

	/**
	 * Enum ConZ.EItemFlags
	 */
	enum class EItemFlags : uint8_t
	{
		None                      = 0,
		IsCrafted                 = 1,
		IsBusy                    = 2,
		Examined                  = 3,
		IsPartOfEvent             = 4,
		BlinkOnSpawn              = 5,
		ShouldBeVisibleInVicinity = 6,
		All                       = 7,
		MAX                       = 8
	};

	/**
	 * Enum ConZ.EItemDropPlaceholderDebugMode
	 */
	enum class EItemDropPlaceholderDebugMode : uint8_t
	{
		None  = 0,
		Basic = 1,
		Count = 2,
		MAX   = 3
	};

	/**
	 * Enum ConZ.EItemActionKeyInput
	 */
	enum class EItemActionKeyInput : uint8_t
	{
		ToggleLight                               = 0,
		IncrementScopeDisplayBrightnessMultiplier = 1,
		DecrementScopeDisplayBrightnessMultiplier = 2,
		ReloadWeapon                              = 3,
		CheckStatus                               = 4,
		CancelAllActions                          = 5,
		MAX                                       = 6
	};

	/**
	 * Enum ConZ.ERPCType
	 */
	enum class ERPCType : uint8_t
	{
		None         = 0,
		Client       = 1,
		Server       = 2,
		NetMulticast = 3,
		MAX          = 4
	};

	/**
	 * Enum ConZ.ETooltipPanelType
	 */
	enum class ETooltipPanelType : uint8_t
	{
		Overview   = 0,
		Additional = 1,
		MAX        = 2
	};

	/**
	 * Enum ConZ.ELockPickingDifficulty
	 */
	enum class ELockPickingDifficulty : uint8_t
	{
		Normal = 0,
		Medium = 1,
		Hard   = 2,
		MAX    = 3
	};

	/**
	 * Enum ConZ.EAccessLevel
	 */
	enum class EAccessLevel : uint8_t
	{
		Public  = 0,
		Private = 1,
		Rank1   = 2,
		Rank2   = 3,
		Rank3   = 4,
		Rank4   = 5,
		Num     = 6,
		MAX     = 7
	};

	/**
	 * Enum ConZ.EConZMenu
	 */
	enum class EConZMenu : uint8_t
	{
		None               = 0,
		Main               = 1,
		Pause              = 2,
		ServerBrowser      = 3,
		ClientSettings     = 4,
		CustomZoneSettings = 5,
		PlayerManagement   = 6,
		CharacterSelection = 7,
		CharacterCreation  = 8,
		Statistics         = 9,
		Count              = 10,
		MAX                = 11
	};

	/**
	 * Enum ConZ.EMSCServerEnrollReason
	 */
	enum class EMSCServerEnrollReason : uint8_t
	{
		Unspecified           = 0,
		Startup               = 1,
		ServerSettingsChanged = 2,
		MasterServerRequested = 3,
		MAX                   = 4
	};

	/**
	 * Enum ConZ.EMSPPlaystyle
	 */
	enum class EMSPPlaystyle : uint8_t
	{
		PVE   = 0,
		PVP   = 1,
		PVPVE = 2,
		First = 3,
		Last  = 4,
		MAX   = 5
	};

	/**
	 * Enum ConZ.EMedicationRepeatedAbuseReaction
	 */
	enum class EMedicationRepeatedAbuseReaction : uint8_t
	{
		None     = 0,
		Vomiting = 1,
		Diarrhea = 2,
		MAX      = 3
	};

	/**
	 * Enum ConZ.EMedicationType
	 */
	enum class EMedicationType : uint8_t
	{
		Painkillers    = 0,
		Sedatives      = 1,
		Antibiotics    = 2,
		Antiparasitics = 3,
		Stimulants     = 4,
		MAX            = 5
	};

	/**
	 * Enum ConZ.EMedicationUsage
	 */
	enum class EMedicationUsage : uint8_t
	{
		Pills      = 0,
		Injections = 1,
		Infusions  = 2,
		MAX        = 3
	};

	/**
	 * Enum ConZ.EMeleeActionType
	 */
	enum class EMeleeActionType : uint8_t
	{
		None                   = 0,
		Attack                 = 1,
		PrepareForBlockOrDodge = 2,
		Block                  = 3,
		Dodge                  = 4,
		MAX                    = 5
	};

	/**
	 * Enum ConZ.EMeleeState
	 */
	enum class EMeleeState : uint8_t
	{
		Idle                    = 0,
		Attacking               = 1,
		PreparedForBlockOrDodge = 2,
		Block                   = 3,
		Dodge                   = 4,
		HitReact                = 5,
		MAX                     = 6
	};

	/**
	 * Enum ConZ.EAttackCollisionType
	 */
	enum class EAttackCollisionType : uint8_t
	{
		None            = 0,
		WeaponLeftHand  = 1,
		WeaponRightHand = 2,
		Head            = 3,
		LeftHand        = 4,
		RightHand       = 5,
		LeftLeg         = 6,
		RightLeg        = 7,
		MAX             = 8
	};

	/**
	 * Enum ConZ.EHumanBodyPanelSegmentGenderGroup
	 */
	enum class EHumanBodyPanelSegmentGenderGroup : uint8_t
	{
		Male   = 0,
		Female = 1,
		Both   = 2,
		Count  = 3,
		MAX    = 4
	};

	/**
	 * Enum ConZ.EMinigameState
	 */
	enum class EMinigameState : uint8_t
	{
		None             = 0,
		Intro            = 1,
		WaitingForPlayer = 2,
		Game             = 3,
		Outro            = 4,
		MAX              = 5
	};

	/**
	 * Enum ConZ.EEndMinigameReason
	 */
	enum class EEndMinigameReason : uint8_t
	{
		Success = 0,
		Fail    = 1,
		Cancel  = 2,
		MAX     = 3
	};

	/**
	 * Enum ConZ.EObjectiveAnimationState
	 */
	enum class EObjectiveAnimationState : uint8_t
	{
		None     = 0,
		Start    = 1,
		Complete = 2,
		MAX      = 3
	};

	/**
	 * Enum ConZ.EMissionManagerState
	 */
	enum class EMissionManagerState : uint8_t
	{
		None             = 0,
		MainStorySuccess = 1,
		SideStorySuccess = 2,
		TutorialSuccess  = 3,
		MainStoryFailed  = 4,
		SideStoryFailed  = 5,
		TutorialFailed   = 6,
		MAX              = 7
	};

	/**
	 * Enum ConZ.EDialogType
	 */
	enum class EDialogType : uint8_t
	{
		Subtitle = 0,
		Action   = 1,
		Wait     = 2,
		MAX      = 3
	};

	/**
	 * Enum ConZ.EDialogEvent
	 */
	enum class EDialogEvent : uint8_t
	{
		Intro                     = 0,
		OpenInteface              = 1,
		OpenCraftingInterface     = 2,
		ChooseKnife               = 3,
		OpenCraftingInterface_Bag = 4,
		MAX                       = 5
	};

	/**
	 * Enum ConZ.EFaction
	 */
	enum class EFaction : uint8_t
	{
		None  = 0,
		Rebel = 1,
		TEC   = 2,
		MAX   = 3
	};

	/**
	 * Enum ConZ.EObjectiveState
	 */
	enum class EObjectiveState : uint8_t
	{
		None        = 0,
		Initialized = 1,
		Started     = 2,
		Completed   = 3,
		Failed      = 4,
		Belated     = 5,
		MAX         = 6
	};

	/**
	 * Enum ConZ.EMissionType
	 */
	enum class EMissionType : uint8_t
	{
		None      = 0,
		MainStory = 1,
		SideStory = 2,
		Tutorial  = 3,
		MAX       = 4
	};

	/**
	 * Enum ConZ.EMissionState
	 */
	enum class EMissionState : uint8_t
	{
		Available   = 0,
		Unavailable = 1,
		Started     = 2,
		Completed   = 3,
		Failed      = 4,
		Belated     = 5,
		MAX         = 6
	};

	/**
	 * Enum ConZ.EMovableCollisionFieldMovementCurveType
	 */
	enum class EMovableCollisionFieldMovementCurveType : uint8_t
	{
		Linear      = 0,
		SquareRoot  = 1,
		Exponential = 2,
		MAX         = 3
	};

	/**
	 * Enum ConZ.EMovableCollisionFieldMoveType
	 */
	enum class EMovableCollisionFieldMoveType : uint8_t
	{
		TowardsStart = 0,
		TowardsEnd   = 1,
		None         = 2,
		Count        = 3,
		MAX          = 4
	};

	/**
	 * Enum ConZ.RestState
	 */
	enum class ERestState : uint8_t
	{
		RestState_AT_REST       = 0,
		RestState_MOVING        = 1,
		RestState_RestState_MAX = 2
	};

	/**
	 * Enum ConZ.SyncMode
	 */
	enum class ESyncMode : uint8_t
	{
		SyncMode_XYZ          = 0,
		SyncMode_XY           = 1,
		SyncMode_XZ           = 2,
		SyncMode_YZ           = 3,
		SyncMode_X            = 4,
		SyncMode_Y            = 5,
		SyncMode_Z            = 6,
		SyncMode_NONE         = 7,
		SyncMode_SyncMode_MAX = 8
	};

	/**
	 * Enum ConZ.ENotificationTarget
	 */
	enum class ENotificationTarget : uint8_t
	{
		Everybody    = 0,
		SingleClient = 1,
		MAX          = 2
	};

	/**
	 * Enum ConZ.ENutrient
	 */
	enum class ENutrient : uint8_t
	{
		Protein      = 0,
		SaturatedFat = 1,
		OtherFats    = 2,
		Fiber        = 3,
		Sugars       = 4,
		OtherCarbs   = 5,
		Alcohol      = 6,
		Water        = 7,
		VitaminA     = 8,
		VitaminB1    = 9,
		VitaminB2    = 10,
		VitaminB3    = 11,
		VitaminB4    = 12,
		VitaminB5    = 13,
		VitaminB6    = 14,
		VitaminB9    = 15,
		VitaminB12   = 16,
		VitaminC     = 17,
		VitaminD     = 18,
		VitaminE     = 19,
		VitaminK     = 20,
		Calcium      = 21,
		Magnesium    = 22,
		Potassium    = 23,
		Copper       = 24,
		Selenium     = 25,
		Iron         = 26,
		Phosphorus   = 27,
		Zinc         = 28,
		Manganese    = 29,
		Sodium       = 30,
		Other        = 31,
		Count        = 32,
		MAX          = 33
	};

	/**
	 * Enum ConZ.EPickupItemOperation
	 */
	enum class EPickupItemOperation : uint8_t
	{
		PickupOnly      = 0,
		PickupAndEat    = 1,
		PickupAndEatAll = 2,
		MAX             = 3
	};

	/**
	 * Enum ConZ.EPlaceableActorDebugMode
	 */
	enum class EPlaceableActorDebugMode : uint8_t
	{
		None          = 0,
		Basic         = 1,
		GroundedCheck = 2,
		Walls         = 3,
		Count         = 4,
		MAX           = 5
	};

	/**
	 * Enum ConZ.EStateFlags
	 */
	enum class EStateFlags : uint8_t
	{
		None     = 0,
		Flipped  = 1,
		Snapping = 2,
		MAX      = 3
	};

	/**
	 * Enum ConZ.EPlacementBaseBuildingState
	 */
	enum class EPlacementBaseBuildingState : uint8_t
	{
		Placing            = 0,
		PlacingSecondPoint = 1,
		Placed             = 2,
		MAX                = 3
	};

	/**
	 * Enum ConZ.EPlaceableStatusFlags
	 */
	enum class EPlaceableStatusFlags : uint8_t
	{
		None             = 0,
		PlacementAllowed = 1,
		PlacingOnWater   = 2,
		All              = 3,
		MAX              = 4
	};

	/**
	 * Enum ConZ.EPlacementTraceHitActor
	 */
	enum class EPlacementTraceHitActor : uint8_t
	{
		None          = 0,
		Item          = 1,
		BaseElement   = 2,
		VehicleCorpse = 3,
		All           = 4,
		MAX           = 5
	};

	/**
	 * Enum ConZ.EPlaceableIngredientType
	 */
	enum class EPlaceableIngredientType : uint8_t
	{
		Mandatory = 0,
		Tool      = 1,
		MAX       = 2
	};

	/**
	 * Enum ConZ.EPlacementAllowedStatus
	 */
	enum class EPlacementAllowedStatus : uint8_t
	{
		None                               = 0,
		Allowed                            = 1,
		NotAllowedGeneric                  = 2,
		NotAllowedPlacementLineTraceFailed = 3,
		NotAllowedNormalTestFailed         = 4,
		NotAllowedInteractionDistance      = 5,
		NotAllowedReachability             = 6,
		NotAllowedWater                    = 7,
		NotAllowedAngle                    = 8,
		NotAllowedMeshOverlap              = 9,
		NotAllowedTopOverlap               = 10,
		NotAllowedTopOverlapSimple         = 11,
		NotAllowedBottomOverlap            = 12,
		NotAllowedFullBoxOverlap           = 13,
		NotAllowedExtendedOverlap          = 14,
		NotAllowedFloating                 = 15,
		NotAllowedTeleportSpot             = 16,
		NotAllowedHitCharacter             = 17,
		NotAllowedHitItem                  = 18,
		NotAllowedHitVehicle               = 19,
		NotAllowedMapRegion                = 20,
		NotAllowedNotSnapping              = 21,
		NotAllowedCantPlaceAtLocation      = 22,
		NotAllowedLocationMask             = 23,
		NotAllowedLocationDupFlag          = 24,
		NotAllowedLocationEnemyFlag        = 25,
		NotAllowedLocationFoundation       = 26,
		NotAllowedLocationOtherElement     = 27,
		NotAllowedLocationNoBase           = 28,
		NotAllowedLocationNoFlag           = 29,
		NotAllowedLocationMaxInstances     = 30,
		NotAllowedEnemyFlag                = 31,
		NotAllowedBaseBuildingMask         = 32,
		NotAllowedInBuilding               = 33,
		NotAllowedActorTag                 = 34,
		NotAllowedVehicleCorpse            = 35,
		NotAllowedPointsTooClose           = 36,
		NotAllowedTwoPointsConstaints      = 37,
		NotAllowedHeightDifference         = 38,
		NotAllowedTopSweep                 = 39,
		NotAllowedMidSweep                 = 40,
		NotAllowedTilesNotGrounded         = 41,
		NotAllowedPlacedDistance           = 42,
		NotAllowedUnknown                  = 43,
		MAX                                = 44
	};

	/**
	 * Enum ConZ.EPlacementAlgorithm
	 */
	enum class EPlacementAlgorithm : uint8_t
	{
		Classic = 0,
		New     = 1,
		MAX     = 2
	};

	/**
	 * Enum ConZ.EPlacementBaseState
	 */
	enum class EPlacementBaseState : uint8_t
	{
		None             = 0,
		Placing          = 1,
		Placed           = 2,
		HeightAdjustment = 3,
		MAX              = 4
	};

	/**
	 * Enum ConZ.EPlantGrowthStage
	 */
	enum class EPlantGrowthStage : uint8_t
	{
		None       = 0,
		Seeding    = 1,
		Vegetating = 2,
		Flowering  = 3,
		Ripening   = 4,
		Dead       = 5,
		MAX        = 6
	};

	/**
	 * Enum ConZ.EPlayableInstrumentView
	 */
	enum class EPlayableInstrumentView : uint8_t
	{
		FirstPerson = 0,
		ThirdPerson = 1,
		MAX         = 2
	};

	/**
	 * Enum ConZ.EPlayableInstrumentChord
	 */
	enum class EPlayableInstrumentChord : uint8_t
	{
		Count = 0,
		MAX   = 1
	};

	/**
	 * Enum ConZ.EDroneVisibility
	 */
	enum class EDroneVisibility : uint8_t
	{
		Visible   = 0,
		Invisible = 1,
		Hidden    = 2,
		MAX       = 3
	};

	/**
	 * Enum ConZ.EInstrumentEventType
	 */
	enum class EInstrumentEventType : uint8_t
	{
		PlayTone = 0,
		StopTone = 1,
		MAX      = 2
	};

	/**
	 * Enum ConZ.EStanceChangeFlag
	 */
	enum class EStanceChangeFlag : uint8_t
	{
		Exact = 0,
		Min   = 1,
		Max   = 2
	};

	/**
	 * Enum ConZ.ESwapItemsType
	 */
	enum class ESwapItemsType : uint8_t
	{
		None                 = 0,
		NotWeaponToNotWeapon = 1,
		WeaponToWeapon       = 2,
		NotWeaponToWeapon    = 3,
		WeaponToNotWeapon    = 4,
		WeaponToThrowingItem = 5,
		ThrowingItemToWeapon = 6,
		MAX                  = 7
	};

	/**
	 * Enum ConZ.EPrisonerAnimationCurve
	 */
	enum class EPrisonerAnimationCurve : uint8_t
	{
		LegsPose                     = 0,
		CanStartGoToLoop             = 1,
		CanStartGoToStopLU           = 2,
		CanStartGoToStopRU           = 3,
		DistanceToPivot              = 4,
		DistanceToApex               = 5,
		CanLandGoToLoop              = 6,
		CanFireWeapon                = 7,
		LeftHandIK                   = 8,
		MoveInputScale               = 9,
		MoveInputModifierScale       = 10,
		MoveInputModifierCourseAngle = 11,
		IgnoreMoveInput              = 12,
		IgnoreTurnInput              = 13,
		IsStanceTransitionActive     = 14,
		MeshOffsetWhenInWater        = 15,
		ViewRoll                     = 16,
		ViewPitch                    = 17,
		ViewYaw                      = 18,
		IgnoreAimOffset              = 19,
		IgnoreFistCorrections        = 20,
		IgnoreRotation               = 21,
		IgnoreFPBoneRotation         = 22,
		Vehicle2WPickupRotation      = 23,
		Vehicle2WPickupTranslation   = 24,
		Vehicle2WPedalRotation       = 25,
		Count                        = 26,
		MAX                          = 27
	};

	/**
	 * Enum ConZ.EPrisonerAnimationMountType
	 */
	enum class EPrisonerAnimationMountType : uint8_t
	{
		None        = 0,
		Car         = 1,
		Sledge      = 2,
		WheelBarrow = 3,
		Boat        = 4,
		Vehicle2W   = 5,
		Airplane    = 6,
		Count       = 7,
		MAX         = 8
	};

	/**
	 * Enum ConZ.EPrisonerAnimationState
	 */
	enum class EPrisonerAnimationState : uint8_t
	{
		Unknown               = 0,
		Entry                 = 1,
		StandIdle             = 2,
		StandIdleToCrouchIdle = 3,
		StandIdleToProneIdle  = 4,
		StandWalkStart        = 5,
		StandWalkLoop         = 6,
		StandWalkStop         = 7,
		StandJogStart         = 8,
		StandJogLoop          = 9,
		StandJogStop          = 10,
		StandRunStart         = 11,
		StandRunLoop          = 12,
		StandRunStop          = 13,
		CrouchIdle            = 14,
		CrouchIdleToStandIdle = 15,
		CrouchIdleToProneIdle = 16,
		CrouchWalkStart       = 17,
		CrouchWalkLoop        = 18,
		CrouchWalkStop        = 19,
		ProneIdle             = 20,
		ProneIdleToStandIdle  = 21,
		ProneIdleToCrouchIdle = 22,
		ProneWalkLoop         = 23,
		Count                 = 24,
		MAX                   = 25
	};

	/**
	 * Enum ConZ.EPrisonerBodyConditionState
	 */
	enum class EPrisonerBodyConditionState : uint8_t
	{
		Incubating  = 0,
		Untreated   = 1,
		Stabilizing = 2,
		Recovering  = 3,
		Count       = 4,
		MAX         = 5
	};

	/**
	 * Enum ConZ.EPrisonerBodyHeatGroup
	 */
	enum class EPrisonerBodyHeatGroup : uint8_t
	{
		Head  = 0,
		Torso = 1,
		Hands = 2,
		Legs  = 3,
		Feet  = 4,
		Count = 5,
		MAX   = 6
	};

	/**
	 * Enum ConZ.EPrisonerBodyConditionTissueGroup
	 */
	enum class EPrisonerBodyConditionTissueGroup : uint8_t
	{
		Unspecified = 0,
		Muscle      = 1,
		Bone        = 2,
		Organ       = 3,
		Count       = 4,
		MAX         = 5
	};

	/**
	 * Enum ConZ.EPrisonerBodyOrganGroup
	 */
	enum class EPrisonerBodyOrganGroup : uint8_t
	{
		Unspecified       = 0,
		SpinalCord        = 1,
		Lungs             = 2,
		RespiratorySystem = 3,
		CirculatorySystem = 4,
		Colon             = 5,
		Intestine         = 6,
		Bladder           = 7,
		Liver             = 8,
		Kidneys           = 9,
		AdrenalGlands     = 10,
		Gallbladder       = 11,
		Pancreas          = 12,
		Stomach           = 13,
		Heart             = 14,
		Spleen            = 15,
		Brain             = 16,
		Reproductive      = 17,
		Count             = 18,
		MAX               = 19
	};

	/**
	 * Enum ConZ.EPrisonerBodyMuscleGroup
	 */
	enum class EPrisonerBodyMuscleGroup : uint8_t
	{
		Unspecified   = 0,
		Head          = 1,
		Neck          = 2,
		Trapezius     = 3,
		Chest         = 4,
		UpperAbdomen  = 5,
		LowerAbdomen  = 6,
		LeftEar       = 7,
		RightEar      = 8,
		LeftThigh     = 9,
		RightThigh    = 10,
		LeftLeg       = 11,
		RightLeg      = 12,
		LeftFoot      = 13,
		RightFoot     = 14,
		LeftShoulder  = 15,
		RightShoulder = 16,
		LeftArm       = 17,
		RightArm      = 18,
		LeftForearm   = 19,
		RightForearm  = 20,
		LeftHand      = 21,
		RightHand     = 22,
		LeftKneecap   = 23,
		RightKneecap  = 24,
		Count         = 25,
		MAX           = 26
	};

	/**
	 * Enum ConZ.EPrisonerBodyBoneGroup
	 */
	enum class EPrisonerBodyBoneGroup : uint8_t
	{
		Unspecified   = 0,
		Ribcage       = 1,
		Spine         = 2,
		Skull         = 3,
		Pelvis        = 4,
		LeftThigh     = 5,
		RightThigh    = 6,
		LeftLeg       = 7,
		RightLeg      = 8,
		LeftFoot      = 9,
		RightFoot     = 10,
		LeftShoulder  = 11,
		RightShoulder = 12,
		LeftArm       = 13,
		RightArm      = 14,
		LeftForearm   = 15,
		RightForearm  = 16,
		LeftHand      = 17,
		RightHand     = 18,
		Count         = 19,
		MAX           = 20
	};

	/**
	 * Enum ConZ.EPrisonerBodyRegion
	 */
	enum class EPrisonerBodyRegion : uint8_t
	{
		Unspecified = 0,
		Head        = 1,
		Torso       = 2,
		LeftArm     = 3,
		RightArm    = 4,
		LeftLeg     = 5,
		RightLeg    = 6,
		Count       = 7,
		MAX         = 8
	};

	/**
	 * Enum ConZ.EPrisonerBodyState
	 */
	enum class EPrisonerBodyState : uint8_t
	{
		UnableToMove                    = 0,
		Unconscious                     = 1,
		Comatose                        = 2,
		Dead                            = 3,
		AbleToConsume                   = 4,
		Consuming                       = 5,
		AbleToVomit                     = 6,
		Vomiting                        = 7,
		AbleToUrinate                   = 8,
		Urinating                       = 9,
		AbleToDefecate                  = 10,
		Defecating                      = 11,
		ShallDefecateDiarrhea           = 12,
		CannotBeRevivedWithPhoenixTears = 13,
		Count                           = 14,
		MAX                             = 15
	};

	/**
	 * Enum ConZ.EBuryState
	 */
	enum class EBuryState : uint8_t
	{
		None       = 0,
		Bury       = 1,
		ResumeBury = 2,
		Rest       = 3,
		Finish     = 4,
		MAX        = 5
	};

	/**
	 * Enum ConZ.EPrisonerFacialExpression
	 */
	enum class EPrisonerFacialExpression : uint8_t
	{
		None         = 0,
		Angry1       = 1,
		Angry2       = 2,
		Hit          = 3,
		Punching     = 4,
		Fear1        = 5,
		Fear2        = 6,
		Fear3        = 7,
		WhatTheHell1 = 8,
		WhatTheHell2 = 9,
		Whistling1   = 10,
		Whistling2   = 11,
		Ouch1        = 12,
		Ouch2        = 13,
		Count        = 14,
		MAX          = 15
	};

	/**
	 * Enum ConZ.EPrisonerFirstPersonSubview
	 */
	enum class EPrisonerFirstPersonSubview : uint8_t
	{
		Standing                                = 0,
		Crouching                               = 1,
		Prone                                   = 2,
		StandingMelee                           = 3,
		StandingAiming                          = 4,
		CrouchingAiming                         = 5,
		ProneAiming                             = 6,
		StandingAimingDownTheSights             = 7,
		CrouchingAimingDownTheSights            = 8,
		ProneAimingDownTheSights                = 9,
		ClimbingWindow                          = 10,
		Mounted                                 = 11,
		Lying                                   = 12,
		MountedDefaultStanceAiming              = 13,
		MountedLeaningStanceAiming              = 14,
		MountedDefaultStanceAimingDownTheSights = 15,
		MountedLeaningStanceAimingDownTheSights = 16,
		Count                                   = 17,
		MAX                                     = 18
	};

	/**
	 * Enum ConZ.EPrisonerVicinityItemSets
	 */
	enum class EPrisonerVicinityItemSets : uint8_t
	{
		None       = 0,
		Items      = 1,
		Containers = 2,
		All        = 3,
		MAX        = 4
	};

	/**
	 * Enum ConZ.EPrisonerInventoryItemSets
	 */
	enum class EPrisonerInventoryItemSets : uint8_t
	{
		None            = 0,
		EquippedClothes = 1,
		ContainedItems  = 2,
		All             = 3,
		MAX             = 4
	};

	/**
	 * Enum ConZ.EPrisonerItemEquipType
	 */
	enum class EPrisonerItemEquipType : uint8_t
	{
		Inventory = 0,
		Hands     = 1,
		Holsters  = 2,
		MAX       = 3
	};

	/**
	 * Enum ConZ.EPrisonerDivingState
	 */
	enum class EPrisonerDivingState : uint8_t
	{
		None        = 0,
		WantsToDive = 1,
		Diving      = 2,
		MAX         = 3
	};

	/**
	 * Enum ConZ.EPrisonerMovementMode
	 */
	enum class EPrisonerMovementMode : uint8_t
	{
		None                          = 0,
		Climbing_Anchoring            = 1,
		Climbing_PlayingMontage       = 2,
		ClimbingLadder                = 3,
		ClimbingWindow_Anchoring      = 4,
		ClimbingWindow_PlayingMontage = 5,
		Anchoring                     = 6,
		RootMotionOnly                = 7,
		MAX                           = 8
	};

	/**
	 * Enum ConZ.EPrisonerPhotoModePoseGroup
	 */
	enum class EPrisonerPhotoModePoseGroup : uint8_t
	{
		Unarmed = 0,
		Rifle   = 1,
		Handgun = 2,
		Melee   = 3,
		MAX     = 4
	};

	/**
	 * Enum ConZ.EPrisonWalletChoiceType
	 */
	enum class EPrisonWalletChoiceType : uint8_t
	{
		JustFirst  = 0,
		PickRandom = 1,
		AllOfThem  = 2,
		MAX        = 3
	};

	/**
	 * Enum ConZ.EPrisonerRestingMode
	 */
	enum class EPrisonerRestingMode : uint8_t
	{
		None    = 0,
		Sitting = 1,
		Lying   = 2,
		Count   = 3,
		MAX     = 4
	};

	/**
	 * Enum ConZ.EThrowingType
	 */
	enum class EThrowingType : uint8_t
	{
		None      = 0,
		Near      = 1,
		Far       = 2,
		Aim       = 3,
		Throwback = 4,
		MAX       = 5
	};

	/**
	 * Enum ConZ.EEquipmentMeshComponent
	 */
	enum class EEquipmentMeshComponent : uint8_t
	{
		None                           = 0,
		HeadMeshComponent              = 1,
		UpperHeadMeshComponent         = 2,
		UpperHeadSkeletalMeshComponent = 3,
		EarsMeshComponent              = 4,
		EyewearMeshComponent           = 5,
		LowerHeadMeshComponent         = 6,
		UpperMouthMeshComponent        = 7,
		LowerMouthMeshComponent        = 8,
		LeyeMeshComponent              = 9,
		ReyeMeshComponent              = 10,
		HairMeshComponent              = 11,
		FacialHairMeshComponent        = 12,
		ChipMeshComponent              = 13,
		TorsoMeshComponent             = 14,
		BodyArmorMeshComponent         = 15,
		NeckMeshComponent              = 16,
		ArmsMeshComponent              = 17,
		HandsMeshComponent             = 18,
		WaistMeshComponent             = 19,
		LegsMeshComponent              = 20,
		FeetMeshComponent              = 21,
		BackpackMeshComponent          = 22,
		PenisMeshComponent             = 23,
		Count                          = 24,
		MAX                            = 25
	};

	/**
	 * Enum ConZ.EPrisonerVisibilityFlag
	 */
	enum class EPrisonerVisibilityFlag : uint8_t
	{
		None      = 0,
		Default   = 1,
		View      = 2,
		Awareness = 3,
		All       = 4,
		MAX       = 5
	};

	/**
	 * Enum ConZ.EPrisonerAimOffsetType
	 */
	enum class EPrisonerAimOffsetType : uint8_t
	{
		Standing             = 0,
		Crouching            = 1,
		Prone                = 2,
		ProneMoving          = 3,
		FirstPersonView      = 4,
		FirstPersonViewProne = 5,
		AimingDownTheSights  = 6,
		Count                = 7,
		MAX                  = 8
	};

	/**
	 * Enum ConZ.EPrisonerMontageBlendType
	 */
	enum class EPrisonerMontageBlendType : uint8_t
	{
		All       = 0,
		LeftHand  = 1,
		RightHand = 2,
		MAX       = 3
	};

	/**
	 * Enum ConZ.EPrisonerPostTeleportBehavior
	 */
	enum class EPrisonerPostTeleportBehavior : uint8_t
	{
		None             = 0,
		ReviveIfDead     = 1,
		GameEventLoadout = 2,
		MAX              = 3
	};

	/**
	 * Enum ConZ.EPrisonerHolsterSide
	 */
	enum class EPrisonerHolsterSide : uint8_t
	{
		None          = 0,
		LeftShoulder  = 1,
		RightShoulder = 2,
		MAX           = 3
	};

	/**
	 * Enum ConZ.EWeaponAnimationPose
	 */
	enum class EWeaponAnimationPose : uint8_t
	{
		None                              = 0,
		Relaxed                           = 1,
		AimingHip                         = 2,
		AimingDownTheSights               = 3,
		AimingDownTheSightsStill          = 4,
		AimingDownTheSightsWalking        = 5,
		AimingDownTheSightsLimpingWalking = 6,
		Count                             = 7,
		MAX                               = 8
	};

	/**
	 * Enum ConZ.EPrisonerFallingPose
	 */
	enum class EPrisonerFallingPose : uint8_t
	{
		None            = 0,
		JumpNormal      = 1,
		JumpDive        = 2,
		FallShort       = 3,
		FallLong        = 4,
		SkydiveSlow     = 5,
		SkydiveFast     = 6,
		DiveHeadFirst   = 7,
		DiveFeetFirst   = 8,
		Parachute       = 9,
		HandsBound      = 10,
		RagdollRecovery = 11,
		JumpSuper       = 12,
		Count           = 13,
		MAX             = 14
	};

	/**
	 * Enum ConZ.EPrisonerReplicatedComponent
	 */
	enum class EPrisonerReplicatedComponent : uint8_t
	{
		SkillComponent          = 0,
		InventoryComponent      = 1,
		HitReactComponent       = 2,
		InteractionComponent    = 3,
		BodySimulationComponent = 4,
		Count                   = 5,
		MAX                     = 6
	};

	/**
	 * Enum ConZ.EPrisonerThirdPersonSubview
	 */
	enum class EPrisonerThirdPersonSubview : uint8_t
	{
		Standing        = 0,
		Crouching       = 1,
		Prone           = 2,
		StandingMelee   = 3,
		StandingAiming  = 4,
		CrouchingAiming = 5,
		ProneAiming     = 6,
		Ragdoll         = 7,
		Grappled        = 8,
		NarrowLadder    = 9,
		Swimming        = 10,
		Diving          = 11,
		ClimbingWindow  = 12,
		Defecating      = 13,
		Throwing        = 14,
		Falling         = 15,
		Count           = 16,
		MAX             = 17
	};

	/**
	 * Enum ConZ.EPlayerSideView
	 */
	enum class EPlayerSideView : uint8_t
	{
		Left  = 0,
		Right = 1,
		Count = 2,
		MAX   = 3
	};

	/**
	 * Enum ConZ.EThrowingState
	 */
	enum class EThrowingState : uint8_t
	{
		None         = 0,
		Cancelled    = 1,
		Aiming       = 2,
		ThrowFromAim = 3,
		Throwing     = 4,
		Lobbing      = 5,
		Throwback    = 6,
		Finish       = 7,
		MAX          = 8
	};

	/**
	 * Enum ConZ.EPrisonerUITooltipSectionName
	 */
	enum class EPrisonerUITooltipSectionName : uint8_t
	{
		None       = 0,
		Affects    = 1,
		AffectedBy = 2,
		CausedBy   = 3,
		Symptoms   = 4,
		Count      = 5,
		MAX        = 6
	};

	/**
	 * Enum ConZ.EPrisonerUIAttribute
	 */
	enum class EPrisonerUIAttribute : uint8_t
	{
		CA_Strength                = 0,
		CA_Constitution            = 1,
		CA_Dexterity               = 2,
		CA_Intelligence            = 3,
		BI_Age                     = 4,
		BI_Lifetime                = 5,
		BI_Weight                  = 6,
		BI_Health                  = 7,
		BI_Teeth                   = 8,
		BI_BloodType               = 9,
		BI_BloodVolume             = 10,
		BI_Temperature             = 11,
		PD_Stamina                 = 12,
		PD_StaminaChangeRate       = 13,
		PD_Unused1                 = 14,
		PD_Unused2                 = 15,
		PD_ActionDifficulty        = 16,
		PD_WeightLoad              = 17,
		PD_WalkSpeed               = 18,
		PD_JogSpeed                = 19,
		PD_RunSpeed                = 20,
		PD_CaloriesOverloadPenalty = 21,
		PD_WaterOverloadPenalty    = 22,
		PI_HealingSpeed            = 23,
		PI_BloodRecoveryRate       = 24,
		PI_ImmuneSystem            = 25,
		PI_PerformanceScore        = 26,
		PI_StealthFactor           = 27,
		PI_MeleeDamage             = 28,
		NAS_Protein                = 29,
		NAS_Carbs                  = 30,
		NAS_Fat                    = 31,
		NAS_Minerals               = 32,
		NAS_Vitamins               = 33,
		NAS_Water                  = 34,
		NAS_Alcohol                = 35,
		BMD_Bones                  = 36,
		BMD_Blood                  = 37,
		BMD_Intestines             = 38,
		BMD_Skin                   = 39,
		BMD_Organs                 = 40,
		BMD_Fat                    = 41,
		BMD_Muscle                 = 42,
		BS_Unconsciousness         = 43,
		BS_Coma                    = 44,
		BS_Death                   = 45,
		NU_Calories                = 46,
		NU_Water                   = 47,
		MR_Protein                 = 48,
		MR_Carbs                   = 49,
		MR_Fat                     = 50,
		MR_Fiber                   = 51,
		MR_Sugar                   = 52,
		MR_SaturatedFat            = 53,
		MR_Alcohol                 = 54,
		BR_Muscle                  = 55,
		BR_Fat                     = 56,
		VI_VitaminA                = 57,
		VI_VitaminB1               = 58,
		VI_VitaminB2               = 59,
		VI_VitaminB3               = 60,
		VI_VitaminB4               = 61,
		VI_VitaminB5               = 62,
		VI_VitaminB6               = 63,
		VI_VitaminB9               = 64,
		VI_VitaminB12              = 65,
		VI_VitaminC                = 66,
		VI_VitaminD                = 67,
		VI_VitaminE                = 68,
		VI_VitaminK                = 69,
		MI_MineralCa               = 70,
		MI_MineralFe               = 71,
		MI_MineralMg               = 72,
		MI_MineralP                = 73,
		MI_MineralK                = 74,
		MI_MineralZn               = 75,
		MI_MineralCu               = 76,
		MI_MineralMn               = 77,
		MI_MineralSe               = 78,
		MI_MineralNa               = 79,
		DI_Stomach                 = 80,
		DI_Intestine               = 81,
		DI_Colon                   = 82,
		DI_Bladder                 = 83,
		Count                      = 84,
		MAX                        = 85
	};

	/**
	 * Enum ConZ.EPenetrationType
	 */
	enum class EPenetrationType : uint8_t
	{
		None  = 0,
		Entry = 1,
		Exit  = 2,
		Both  = 3,
		MAX   = 4
	};

	/**
	 * Enum ConZ.EWindSpeedCategory
	 */
	enum class EWindSpeedCategory : uint8_t
	{
		Zero   = 0,
		Low    = 1,
		Medium = 2,
		High   = 3,
		MAX    = 4
	};

	/**
	 * Enum ConZ.EBallisticDragModel
	 */
	enum class EBallisticDragModel : uint8_t
	{
		G1  = 0,
		G2  = 1,
		G5  = 2,
		G6  = 3,
		G7  = 4,
		G8  = 5,
		MAX = 6
	};

	/**
	 * Enum ConZ.EQuiverActiveMesh
	 */
	enum class EQuiverActiveMesh : uint8_t
	{
		Static              = 0,
		Skeletal            = 1,
		SkeletalAlternative = 2,
		MAX                 = 3
	};

	/**
	 * Enum ConZ.ERepairType
	 */
	enum class ERepairType : uint8_t
	{
		None         = 0,
		RepairHealth = 1,
		MAX          = 2
	};

	/**
	 * Enum ConZ.EEngineeringEventType
	 */
	enum class EEngineeringEventType : uint8_t
	{
		Build         = 0,
		Repair        = 1,
		FillContainer = 2,
		FillVehicle   = 3,
		DrainVehicle  = 4,
		FillItem      = 5,
		MAX           = 6
	};

	/**
	 * Enum ConZ.ERotationDirection
	 */
	enum class ERotationDirection : uint8_t
	{
		Clockwise        = 0,
		CounterClockwise = 1,
		MAX              = 2
	};

	/**
	 * Enum ConZ.EScopingView
	 */
	enum class EScopingView : uint8_t
	{
		FirstPerson = 0,
		ThirdPerson = 1,
		MAX         = 2
	};

	/**
	 * Enum ConZ.EScopingStance
	 */
	enum class EScopingStance : uint8_t
	{
		Standing  = 0,
		Crouching = 1,
		Prone     = 2,
		MAX       = 3
	};

	/**
	 * Enum ConZ.EBackgroundInteractionPlayType
	 */
	enum class EBackgroundInteractionPlayType : uint8_t
	{
		OneShot = 0,
		Begin   = 1,
		Tick    = 2,
		End     = 3,
		MAX     = 4
	};

	/**
	 * Enum ConZ.EBackgroundInteractionType
	 */
	enum class EBackgroundInteractionType : uint8_t
	{
		None                 = 0,
		Random               = 1,
		Greeting             = 2,
		TradeBegin           = 3,
		BuyTab               = 4,
		SellTab              = 5,
		TradeEnd             = 6,
		Parting              = 7,
		Angry                = 8,
		AngerRecovery        = 9,
		GreetingSpecialOffer = 10,
		Num                  = 11,
		MAX                  = 12
	};

	/**
	 * Enum ConZ.ESentryAttackMode
	 */
	enum class ESentryAttackMode : uint8_t
	{
		None        = 0,
		Melee       = 1,
		MediumRange = 2,
		LongRange   = 3,
		MAX         = 4
	};

	/**
	 * Enum ConZ.ESentryStance
	 */
	enum class ESentryStance : uint8_t
	{
		None    = 0,
		Relaxed = 1,
		Alerted = 2,
		Combat  = 3,
		Offline = 4,
		MAX     = 5
	};

	/**
	 * Enum ConZ.ESentryMovementPace2
	 */
	enum class ESentryMovementPace2 : uint8_t
	{
		Walking = 0,
		Running = 1,
		Count   = 2,
		MAX     = 3
	};

	/**
	 * Enum ConZ.ESentryState2
	 */
	enum class ESentryState2 : uint8_t
	{
		None                         = 0,
		Initial                      = 1,
		Patrolling_Walking           = 2,
		Patrolling_CheckSurroundings = 3,
		InvestigatingLocation        = 4,
		InvestigatingBuilding        = 5,
		GuardLocation                = 6,
		EnemySpotted                 = 7,
		Alerted                      = 8,
		ObserveEnemyMovement         = 9,
		Combat                       = 10,
		Combat_LostSight             = 11,
		DestroyingVehicle            = 12,
		Count                        = 13,
		MAX                          = 14
	};

	/**
	 * Enum ConZ.ESentryThirdPersonSubview
	 */
	enum class ESentryThirdPersonSubview : uint8_t
	{
		Standing       = 0,
		StandingAiming = 1,
		Count          = 2,
		MAX            = 3
	};

	/**
	 * Enum ConZ.ESortType
	 */
	enum class ESortType : uint8_t
	{
		None     = 0,
		Host     = 1,
		Password = 2,
		Mode     = 3,
		Version  = 4,
		Time     = 5,
		Friends  = 6,
		Players  = 7,
		Ping     = 8,
		MAX      = 9
	};

	/**
	 * Enum ConZ.EServerBrowserTab
	 */
	enum class EServerBrowserTab : uint8_t
	{
		Internet   = 0,
		Favorites  = 1,
		LastPlayed = 2,
		MAX        = 3
	};

	/**
	 * Enum ConZ.EServerSettingsCategory
	 */
	enum class EServerSettingsCategory : uint8_t
	{
		None  = 0,
		Count = 1,
		MAX   = 2
	};

	/**
	 * Enum ConZ.ESharkState
	 */
	enum class ESharkState : uint8_t
	{
		None                    = 0,
		Wandering               = 1,
		Pursuing                = 2,
		Circling                = 3,
		Aggressive              = 4,
		GrabAttack              = 5,
		Fleeing                 = 6,
		PreparingForDestruction = 7,
		MAX                     = 8
	};

	/**
	 * Enum ConZ.ESimpleAnimalMode
	 */
	enum class ESimpleAnimalMode : uint8_t
	{
		Wander = 0,
		Flee   = 1,
		MAX    = 2
	};

	/**
	 * Enum ConZ.ESkillReplicationID
	 */
	enum class ESkillReplicationID : uint8_t
	{
		None                = 0,
		EnduranceSkill      = 1,
		ResistanceSkill     = 2,
		RunningSkill        = 3,
		SwimmingSkill       = 4,
		MedicalSkill        = 5,
		AwarenessSkill      = 6,
		StealthSkill        = 7,
		AnimalHandlingSkill = 8,
		CookingSkill        = 9,
		SurvivalSkill       = 10,
		BioChemSkill        = 11,
		BoxingSkill         = 12,
		MeleeWeaponsSkill   = 13,
		RiflesSkill         = 14,
		HandgunSkill        = 15,
		SnipingSkill        = 16,
		CamouflageSkill     = 17,
		TacticsSkill        = 18,
		ThrowingSkill       = 19,
		ArcherySkill        = 20,
		ThieverySkill       = 21,
		DrivingSkill        = 22,
		MotorcycleSkill     = 23,
		EngineeringSkill    = 24,
		DemolitionSkill     = 25,
		AviationSkill       = 26,
		MAX                 = 27
	};

	/**
	 * Enum ConZ.EStartLocationTypeFlags
	 */
	enum class EStartLocationTypeFlags : uint8_t
	{
		None             = 0,
		Player           = 1,
		PlayerTournament = 2,
		CargoDrop        = 3,
		MAX              = 4
	};

	/**
	 * Enum ConZ.ESurvivalStatsSubcategory
	 */
	enum class ESurvivalStatsSubcategory : uint8_t
	{
		General    = 0,
		Food       = 1,
		Hunting    = 2,
		Fishing    = 3,
		Travel     = 4,
		Metabolism = 5,
		Crafting   = 6,
		Combat     = 7,
		Events     = 8,
		MAX        = 9
	};

	/**
	 * Enum ConZ.ESurvivalStatsCategory
	 */
	enum class ESurvivalStatsCategory : uint8_t
	{
		Survival = 0,
		Weapons  = 1,
		Combat   = 2,
		MAX      = 3
	};

	/**
	 * Enum ConZ.EConZUnit
	 */
	enum class EConZUnit : uint8_t
	{
		None        = 0,
		Second      = 1,
		Minute      = 2,
		Hour        = 3,
		Day         = 4,
		Year        = 5,
		Gram        = 6,
		Milligram   = 7,
		Microgram   = 8,
		Kilogram    = 9,
		Liter       = 10,
		Milliliter  = 11,
		Calorie     = 12,
		Kilocalorie = 13,
		Meter       = 14,
		Centimeter  = 15,
		Kilometer   = 16,
		Percentage  = 17,
		Health      = 18,
		Stamina     = 19,
		Celsius     = 20,
		MAX         = 21
	};

	/**
	 * Enum ConZ.EItemThrowingBehavior
	 */
	enum class EItemThrowingBehavior : uint8_t
	{
		None     = 0,
		Default  = 1,
		Piercing = 2,
		Fragile  = 3,
		Sticky   = 4,
		MAX      = 5
	};

	/**
	 * Enum ConZ.EBleedingSeverity
	 */
	enum class EBleedingSeverity : uint8_t
	{
		NoBleeding = 0,
		VeryLight  = 1,
		Light      = 2,
		Moderate   = 3,
		Heavy      = 4,
		Severe     = 5,
		MAX        = 6
	};

	/**
	 * Enum ConZ.ETradeableSellFlags
	 */
	enum class ETradeableSellFlags : uint8_t
	{
		None              = 0,
		IgnoreLackOfFunds = 1,
		MAX               = 2
	};

	/**
	 * Enum ConZ.ETradeErrorMessage
	 */
	enum class ETradeErrorMessage : uint8_t
	{
		None                              = 0,
		TradeAttemptedOnClient            = 1,
		TraderOrTradeableInvalid          = 2,
		NotEnoughFunds                    = 3,
		TradeableOutOfStock               = 4,
		TraderInvalidCategory             = 5,
		TradeableCannotBePurchased        = 6,
		TradeableInvalidPrice             = 7,
		NoValidTradeCandidates            = 8,
		TradingOnCooldown                 = 9,
		WorldSpawnLocationBlocked         = 10,
		PlayerBasedPriceMultiplierChanged = 11,
		Unknown                           = 12,
		MAX                               = 13
	};

	/**
	 * Enum ConZ.ETradeOutpostProsperityLevel
	 */
	enum class ETradeOutpostProsperityLevel : uint8_t
	{
		None       = 0,
		VeryPoor   = 1,
		Poor       = 2,
		Prosperous = 3,
		Wealthy    = 4,
		Rich       = 5,
		Count      = 6,
		MAX        = 7
	};

	/**
	 * Enum ConZ.ETradeableSpawnType
	 */
	enum class ETradeableSpawnType : uint8_t
	{
		None       = 0,
		DepotSpawn = 1,
		WorldSpawn = 2,
		MAX        = 3
	};

	/**
	 * Enum ConZ.ETraderType
	 */
	enum class ETraderType : uint8_t
	{
		None             = 0,
		Armorer          = 1,
		GeneralGoods     = 2,
		Mechanic         = 3,
		Doctor           = 4,
		Harbourmaster    = 5,
		Bartender        = 6,
		TradesEverything = 7,
		Count            = 8,
		MAX              = 9
	};

	/**
	 * Enum ConZ.ETradeCategory
	 */
	enum class ETradeCategory : uint8_t
	{
		None                    = 0,
		Armour                  = 1,
		Helmets                 = 2,
		Jackets                 = 3,
		Pants                   = 4,
		Headwear                = 5,
		Tops                    = 6,
		Underwear               = 7,
		Neckwaist               = 8,
		Hands                   = 9,
		Face                    = 10,
		Feet                    = 11,
		Backpacks               = 12,
		RangedWeapon            = 13,
		RangedWeaponAccessories = 14,
		Ammo                    = 15,
		MeleeWeapon             = 16,
		Explosives              = 17,
		Crafting                = 18,
		Fishing                 = 19,
		Alcohol                 = 20,
		Food                    = 21,
		Drink                   = 22,
		FirstAid                = 23,
		Vehicles                = 24,
		Misc                    = 25,
		WaterVehicles           = 26,
		Count                   = 27,
		MAX                     = 28
	};

	/**
	 * Enum ConZ.ETrapType
	 */
	enum class ETrapType : uint8_t
	{
		Default       = 0,
		SuicideZombie = 1,
		MAX           = 2
	};

	/**
	 * Enum ConZ.ETrapTriggerType
	 */
	enum class ETrapTriggerType : uint8_t
	{
		None            = 0,
		MotionTrigger   = 1,
		LaserTrigger    = 2,
		TripwireTrigger = 3,
		TimedTrigger    = 4,
		MAX             = 5
	};

	/**
	 * Enum ConZ.EWidgetType
	 */
	enum class EWidgetType : uint8_t
	{
		InteractionWidgetClass             = 0,
		InteractionGroupWidgetClass        = 1,
		InteractionContainerWidgetClass    = 2,
		ItemWidgetClass                    = 3,
		InventoryWidgetClass               = 4,
		InventorySlotWidgetClass           = 5,
		WarningWidgetClass                 = 6,
		HudWidgetClass                     = 7,
		LoadingWidgetClass                 = 8,
		LoadingIconWidgetClass             = 9,
		SpawnScreenWidgetClass             = 10,
		WaypointScreenWidgetClass          = 11,
		HoverPanelWidgetClass              = 12,
		ActionProgressWidgetClass          = 13,
		ItemSelectionWidgetClass           = 14,
		ExamineWidgetClass                 = 15,
		HandsInventoryWidgetClass          = 16,
		GenericItemInventoryWidgetClass    = 17,
		InventoryContainersWidgetClass     = 18,
		CombinedInventoryWidgetClass       = 19,
		TeamInvitationWidgetClass          = 20,
		CraftingInfoWidgetClass            = 21,
		CraftingComponentWidgetClass       = 22,
		CraftingRecipeWidgetClass          = 23,
		EmptySlotWidgetClass               = 24,
		TeamInfoWidgetClass                = 25,
		TeammateNameWidgetClass            = 26,
		PreviousNextSwitchWidgetClass      = 27,
		VicinityItemContainerWidgetClass   = 28,
		QuickAccessItemWidget              = 29,
		GameEventPanelWidgetClass          = 30,
		GameEventCardWidgetClass           = 31,
		GameEventScoreboardWidgetClass     = 32,
		GameEventMiniScoreboardWidgetClass = 33,
		TournamentScoreboardWidgetClass    = 34,
		CircularMenuWidgetClass            = 35,
		CircularMenuSegmentWidgetClass     = 36,
		LockpickingWidgetClass             = 37,
		DoorUpgradeWidgetClass             = 38,
		UpgradeWidgetClass                 = 39,
		ObjectivesWidget                   = 40,
		MissionPrompt                      = 41,
		MissionResult                      = 42,
		MissionItem                        = 43,
		ObjectiveItem                      = 44,
		MissionReward                      = 45,
		InventoryContainerWidget2Test      = 46,
		InventoryItemWidget2Test           = 47,
		ItemInventoryWidget2               = 48,
		ItemInventoryWidget2Holsters       = 49,
		InventoryPanelSideLayerWidget      = 50,
		ItemWidget2                        = 51,
		ItemWidget2VicinityContainer       = 52,
		ItemTooltipWidget                  = 53,
		TooltipPanelFoodOverview           = 54,
		TooltipPanelFoodNutritionsSingle   = 55,
		TooltipPanelFoodNutritionsFull     = 56,
		TooltipPanelFoodGraphs             = 57,
		TooltipPanelWeaponAbsolute         = 58,
		TooltipPanelWeaponRelative         = 59,
		StatisticsListRow                  = 60,
		RewardItemWidget                   = 61,
		ThrowingQuickAccessMenu            = 62,
		ItemSplitWidgetClass               = 63,
		MAX                                = 64
	};

	/**
	 * Enum ConZ.EUnarmedCombatInput
	 */
	enum class EUnarmedCombatInput : uint8_t
	{
		WalkForward    = 0,
		WalkBackward   = 1,
		WalkRight      = 2,
		WalkLeft       = 3,
		Punch          = 4,
		Kick           = 5,
		BlockPressed   = 6,
		BlockReleased  = 7,
		PreviousTarget = 8,
		NextTarget     = 9,
		ReleaseCursor  = 10,
		MAX            = 11
	};

	/**
	 * Enum ConZ.EUserProfileType
	 */
	enum class EUserProfileType : uint8_t
	{
		Singleplayer         = 0,
		MultiplayerAuthority = 1,
		MultiplayerCache     = 2,
		MAX                  = 3
	};

	/**
	 * Enum ConZ.EChangeSource
	 */
	enum class EChangeSource : uint8_t
	{
		Unknown = 0,
		Code    = 1,
		Player  = 2,
		MAX     = 3
	};

	/**
	 * Enum ConZ.EVehicle2WType
	 */
	enum class EVehicle2WType : uint8_t
	{
		Motorcycle = 0,
		Bicycle    = 1,
		MAX        = 2
	};

	/**
	 * Enum ConZ.EAerodynamicSurfaceType
	 */
	enum class EAerodynamicSurfaceType : uint8_t
	{
		None          = 0,
		LeftAilerons  = 1,
		RightAilerons = 2,
		Elevators     = 3,
		Flaps         = 4,
		Rudder        = 5,
		MAX           = 6
	};

	/**
	 * Enum ConZ.EUnmountReason
	 */
	enum class EUnmountReason : uint8_t
	{
		None    = 0,
		Regular = 1,
		EndPlay = 2,
		MAX     = 3
	};

	/**
	 * Enum ConZ.EVehicleEngineState
	 */
	enum class EVehicleEngineState : uint8_t
	{
		Unavailable                 = 0,
		TurnedOff                   = 1,
		StartingViaIgnition         = 2,
		StartingViaMotion           = 3,
		ReadyDelay                  = 4,
		Ready                       = 5,
		FailedToStartDelay          = 6,
		FailedToStart               = 7,
		FailedToStartNoFuelDelay    = 8,
		FailedToStartNoFuel         = 9,
		FailedToStartNoBatteryDelay = 10,
		FailedToStartNoBattery      = 11,
		StalledDelay                = 12,
		Stalled                     = 13,
		Broken                      = 14,
		MAX                         = 15
	};

	/**
	 * Enum ConZ.EVehicleSeatType
	 */
	enum class EVehicleSeatType : uint8_t
	{
		Driver    = 0,
		Passenger = 1,
		MAX       = 2
	};

	/**
	 * Enum ConZ.EWaypointTraverseType
	 */
	enum class EWaypointTraverseType : uint8_t
	{
		Clockwise        = 0,
		CounterClockwise = 1,
		Random           = 2,
		MAX              = 3
	};

	/**
	 * Enum ConZ.EAnimalWaypointType
	 */
	enum class EAnimalWaypointType : uint8_t
	{
		PassThrough = 0,
		Wait        = 1,
		Rest        = 2,
		Eat         = 3,
		All         = 4,
		MAX         = 5
	};

	/**
	 * Enum ConZ.EWeaponAnimationCurve
	 */
	enum class EWeaponAnimationCurve : uint8_t
	{
		DrawAmount     = 0,
		StrengthAmount = 1,
		HideBone       = 2,
		Count          = 3,
		MAX            = 4
	};

	/**
	 * Enum ConZ.EMagazineAmmoCountType
	 */
	enum class EMagazineAmmoCountType : uint8_t
	{
		Countable = 0,
		Even      = 1,
		Odd       = 2,
		MAX       = 3
	};

	/**
	 * Enum ConZ.EBowAimingTestType
	 */
	enum class EBowAimingTestType : uint8_t
	{
		DotOnly    = 0,
		ViewOnly   = 1,
		DotAndView = 2,
		MAX        = 3
	};

	/**
	 * Enum ConZ.EBowDrawPercentage
	 */
	enum class EBowDrawPercentage : uint8_t
	{
		Draw50percent  = 0,
		Draw75percent  = 1,
		Draw100percent = 2,
		Count          = 3,
		MAX            = 4
	};

	/**
	 * Enum ConZ.EWeaponBowState
	 */
	enum class EWeaponBowState : uint8_t
	{
		None               = 0,
		InsertArrow        = 1,
		RemoveArrow        = 2,
		Draw               = 3,
		CancelFiring       = 4,
		FireDummy          = 5,
		Fire               = 6,
		FireAndInsertArrow = 7,
		Active             = 8,
		MAX                = 9
	};

	/**
	 * Enum ConZ.EWeaponCrossbowDrawCategory
	 */
	enum class EWeaponCrossbowDrawCategory : uint8_t
	{
		UnableToDraw = 0,
		Slow         = 1,
		Normal       = 2,
		Count        = 3,
		MAX          = 4
	};

	/**
	 * Enum ConZ.EWeaponDownTheSightsMode
	 */
	enum class EWeaponDownTheSightsMode : uint8_t
	{
		IronSights = 0,
		Scope      = 1,
		MAX        = 2
	};

	/**
	 * Enum ConZ.EWeaponEjectFromChamberType
	 */
	enum class EWeaponEjectFromChamberType : uint8_t
	{
		Casing    = 0,
		LiveRound = 1,
		MAX       = 2
	};

	/**
	 * Enum ConZ.EReloadWeaponSequence
	 */
	enum class EReloadWeaponSequence : uint8_t
	{
		None                           = 0,
		InsertMagazine                 = 1,
		RemoveMagazineInstertMagazine  = 2,
		InstertCartridge               = 3,
		RemoveMagazineInstertCartridge = 4,
		MAX                            = 5
	};

	/**
	 * Enum ConZ.EWeaponCombatModeType
	 */
	enum class EWeaponCombatModeType : uint8_t
	{
		Relaxed = 0,
		Aiming  = 1,
		Count   = 2,
		MAX     = 3
	};

	/**
	 * Enum ConZ.EWeaponAttachmentActionType
	 */
	enum class EWeaponAttachmentActionType : uint8_t
	{
		Add    = 0,
		Remove = 1,
		Swap   = 2,
		Count  = 3,
		MAX    = 4
	};

	/**
	 * Enum ConZ.EWeatherControllerDebugOverrideType
	 */
	enum class EWeatherControllerDebugOverrideType : uint8_t
	{
		WindAzimuth           = 0,
		WindIntensity         = 1,
		WindAzimuthForWaves   = 2,
		WindIntensityForWaves = 3,
		Count                 = 4,
		MAX                   = 5
	};

	/**
	 * Enum ConZ.ECraftingMarkerMode
	 */
	enum class ECraftingMarkerMode : uint8_t
	{
		Marker   = 0,
		FullInfo = 1,
		MAX      = 2
	};

	/**
	 * Enum ConZ.EZombieRagdollAutoRecoveryType
	 */
	enum class EZombieRagdollAutoRecoveryType : uint8_t
	{
		None                    = 0,
		WhenAtRest              = 1,
		AfterTimeSpan           = 2,
		WhenAtRestAfterTimeSpan = 3,
		MAX                     = 4
	};

	/**
	 * Enum ConZ.EZombieTurnMontage
	 */
	enum class EZombieTurnMontage : uint8_t
	{
		RelaxedIdle              = 0,
		AlertedIdle              = 1,
		CombatIdle               = 2,
		RelaxedIdleToAlertedIdle = 3,
		Count                    = 4,
		MAX                      = 5
	};

	/**
	 * Enum ConZ.EZombieStance
	 */
	enum class EZombieStance : uint8_t
	{
		Relaxed = 0,
		Lying   = 1,
		Alerted = 2,
		Combat  = 3,
		MAX     = 4
	};

	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * ScriptStruct ConZ.AdminCommandArgumentDescription
	 * Size -> 0x0020
	 */
	struct FAdminCommandArgumentDescription
	{
	public:
		class FString                                              Description;                                             // 0x0000(0x0010) Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       ShowCompletionValuesInHelpText;                          // 0x0010(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_HDD1[0x7];                                   // 0x0011(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UClass*                                              Completion;                                              // 0x0018(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.AerodynamicSurfaceControlData
	 * Size -> 0x0018
	 */
	struct FAerodynamicSurfaceControlData
	{
	public:
		TArray<unsigned char>                                      Indices;                                                 // 0x0000(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
		float                                                      MaxHealth;                                               // 0x0010(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_2N3J[0x4];                                   // 0x0014(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ConZ.WeaponMountData
	 * Size -> 0x0018
	 */
	struct FWeaponMountData
	{
	public:
		class FName                                                SocketName;                                              // 0x0000(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UPhysicalMaterial*                                   PhysicalMaterial;                                        // 0x0008(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TWeakObjectPtr<class AWeapon>                              Weapon;                                                  // 0x0010(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.RepairableParams
	 * Size -> 0x0038
	 */
	struct FRepairableParams
	{
	public:
		struct FGameplayTagContainer                               RepairableTypes;                                         // 0x0000(0x0020) Edit, NativeAccessSpecifierPublic
		float                                                      HealthRepairedPerUse;                                    // 0x0020(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ExperienceAwardedPerHealthRepaired;                      // 0x0024(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MinRepairDuration;                                       // 0x0028(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MaxRepairDuration;                                       // 0x002C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       ShouldRepairZeroHealth;                                  // 0x0030(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ESkillLevel                                                MinSkillLevelRequired;                                   // 0x0031(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_IJ8D[0x6];                                   // 0x0032(0x0006) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ConZ.VehicleDamagedEffectsParameters
	 * Size -> 0x0060
	 */
	struct FVehicleDamagedEffectsParameters
	{
	public:
		struct FFloatRange                                         HealthRatioRange;                                        // 0x0000(0x0010) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FTransform                                          Transform;                                               // 0x0010(0x0030) Edit, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		class UParticleSystem*                                     ParticleSystem;                                          // 0x0040(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UAkAudioEvent*                                       StartAudioEvent;                                         // 0x0048(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UAkAudioEvent*                                       StopAudioEvent;                                          // 0x0050(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      DeactivationDelay;                                       // 0x0058(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_YX8B[0x4];                                   // 0x005C(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ConZ.VehicleImpactEffects
	 * Size -> 0x0038
	 */
	struct FVehicleImpactEffects
	{
	public:
		float                                                      HitImpulseThreshold;                                     // 0x0000(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_9CZA[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UParticleSystem*                                     ParticleSystem;                                          // 0x0008(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector                                             ParticlesScale;                                          // 0x0010(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_KWKB[0x4];                                   // 0x001C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UAkAudioEvent*                                       AudioEvent;                                              // 0x0020(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UClass*                                              CameraShake;                                             // 0x0028(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      CameraShakeScale;                                        // 0x0030(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_RJNF[0x4];                                   // 0x0034(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ConZ.VehicleSpawnParameters
	 * Size -> 0x0038
	 */
	struct FVehicleSpawnParameters
	{
	public:
		struct FGameplayTag                                        SpawnGroup;                                              // 0x0000(0x0008) Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector                                             MinSpawnLocationOffset;                                  // 0x0008(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector                                             MaxSpawnLocationOffset;                                  // 0x0014(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector                                             AdminSpawnLocationOffset;                                // 0x0020(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      HealthAmountOverride;                                    // 0x002C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      FuelAmountOverride;                                      // 0x0030(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      BatteryAmountOverride;                                   // 0x0034(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.VehicleEngineStallingParameters
	 * Size -> 0x0058
	 */
	struct FVehicleEngineStallingParameters
	{
	public:
		float                                                      MinDuration;                                             // 0x0000(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MaxDuration;                                             // 0x0004(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      StopEngineChance;                                        // 0x0008(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       ShouldStallingStopOnThrottleOrBreakRelease;              // 0x000C(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       ShouldEngineStopOnThrottleOrBreakRelease;                // 0x000D(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_8H0D[0x2];                                   // 0x000E(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UCurveFloat*                                         ThrottleCurve;                                           // 0x0010(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ThrottleCurveFrequencyMultiplier;                        // 0x0018(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_TO7L[0x4];                                   // 0x001C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UCurveFloat*                                         BrakeCurve;                                              // 0x0020(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      BrakeCurveFrequencyMultiplier;                           // 0x0028(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ForceMagnitudeScale;                                     // 0x002C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UCurveFloat*                                         ForceMagnitudeScaleCurve;                                // 0x0030(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ForceMagnitudeScaleCurveFrequencyMultiplier;             // 0x0038(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ForceDirectionRandomizationAngle;                        // 0x003C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UAkAudioEvent*                                       AudioEvent;                                              // 0x0040(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<float>                                              AudioEventTriggerTimeRatios;                             // 0x0048(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.VehicleTireEffectProperties
	 * Size -> 0x0014
	 */
	struct FVehicleTireEffectProperties
	{
	public:
		struct FVector                                             TireLocalOffset;                                         // 0x0000(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_OEX2[0x8];                                   // 0x000C(0x0008) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ConZ.VehicleExhaustParticles
	 * Size -> 0x0018
	 */
	struct FVehicleExhaustParticles
	{
	public:
		class FName                                                AttachSocketName;                                        // 0x0000(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UParticleSystem*                                     ParticleSystem;                                          // 0x0008(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_S1GL[0x8];                                   // 0x0010(0x0008) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ConZ.VehicleExhaustEffects
	 * Size -> 0x0048
	 */
	struct FVehicleExhaustEffects
	{
	public:
		TArray<struct FVehicleExhaustParticles>                    Particles;                                               // 0x0000(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
		float                                                      ThrottleImpulseMinValue;                                 // 0x0010(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ThrottleImpulseMaxValue;                                 // 0x0014(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ThrottleImpulseSpeedTermMaxValue;                        // 0x0018(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ThrottleImpulseAttackDuration;                           // 0x001C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ThrottleImpulseSustainDuration;                          // 0x0020(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ThrottleImpulseReleaseDuration;                          // 0x0024(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ParticlesDestructionDelay;                               // 0x0028(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_49AO[0x1C];                                  // 0x002C(0x001C) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ConZ.VehicleMaterialParameterDescription
	 * Size -> 0x0010
	 */
	struct FVehicleMaterialParameterDescription
	{
	public:
		class FName                                                ParameterName;                                           // 0x0000(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MinValue;                                                // 0x0008(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MaxValue;                                                // 0x000C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.MountSlotEntryPoint
	 * Size -> 0x00A0
	 */
	struct FMountSlotEntryPoint
	{
	public:
		struct FVector                                             Location;                                                // 0x0000(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_6QLH[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FTransform                                          EntryTransform;                                          // 0x0010(0x0030) Edit, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		float                                                      TransformSnapRadius;                                     // 0x0040(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    DoorIndex;                                               // 0x0044(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UAnimMontage*                                        VehicleOpenDoorMontage;                                  // 0x0048(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UAnimMontage*                                        VehicleCloseDoorMontage;                                 // 0x0050(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UAnimMontage*                                        VehicleMountSlotMontage;                                 // 0x0058(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UAnimMontage*                                        VehicleUnmountSlotMontage;                               // 0x0060(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UAnimMontage*                                        PrisonerOpenDoorMontage;                                 // 0x0068(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UAnimMontage*                                        PrisonerCloseDoorMontage;                                // 0x0070(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UAnimMontage*                                        PrisonerMountSlotMontage;                                // 0x0078(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UAnimMontage*                                        PrisonerUnmountSlotMontage;                              // 0x0080(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UAnimMontage*                                        PrisonerPickUpVehicle2WMontage;                          // 0x0088(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UAnimMontage*                                        PrisonerAirplaneJumpExitMontage;                         // 0x0090(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                PickUpSocketName;                                        // 0x0098(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.ReachableMountSlot
	 * Size -> 0x0018
	 */
	struct FReachableMountSlot
	{
	public:
		int32_t                                                    SlotIndex;                                               // 0x0000(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_R2N6[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UAnimMontage*                                        TransitionMontage;                                       // 0x0008(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      TransitionTimeWithoutMontage;                            // 0x0010(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_BWN4[0x4];                                   // 0x0014(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ConZ.ItemLocation
	 * Size -> 0x000F
	 */
	struct FItemLocation
	{
	public:
		bool                                                       Coastal;                                                 // 0x0000(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       Continantal;                                             // 0x0001(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       Mountain;                                                // 0x0002(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       Urban;                                                   // 0x0003(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       Rural;                                                   // 0x0004(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       Industrial;                                              // 0x0005(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       Police;                                                  // 0x0006(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       MilitaryBasic;                                           // 0x0007(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       MilitaryMedium;                                          // 0x0008(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       MilitaryAdvanced;                                        // 0x0009(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       MilitaryWW2;                                             // 0x000A(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       Sport;                                                   // 0x000B(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       Market;                                                  // 0x000C(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       GasStation;                                              // 0x000D(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       Airfield;                                                // 0x000E(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.ItemMotionNoise
	 * Size -> 0x0008
	 */
	struct FItemMotionNoise
	{
	public:
		class UAkAudioEvent*                                       AudioEvent;                                              // 0x0000(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.CraftingPart
	 * Size -> 0x0020
	 */
	struct FCraftingPart
	{
	public:
		class UClass*                                              ItemClass;                                               // 0x0000(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_7AO1[0x18];                                  // 0x0008(0x0018) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ConZ.AttachmentSocketDataItem
	 * Size -> 0x0018
	 */
	struct FAttachmentSocketDataItem
	{
	public:
		class FName                                                BoneName;                                                // 0x0000(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UClass*                                              MountType;                                               // 0x0008(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class AActor*                                              MountedItem;                                             // 0x0010(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.AttachmentSocket
	 * Size -> 0x0010
	 */
	struct FAttachmentSocket
	{
	public:
		TArray<struct FAttachmentSocketDataItem>                   Items;                                                   // 0x0000(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.AttachmentSocketOffset
	 * Size -> 0x0020
	 */
	struct FAttachmentSocketOffset
	{
	public:
		class FName                                                BoneName;                                                // 0x0000(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector                                             Location;                                                // 0x0008(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FRotator                                            Rotation;                                                // 0x0014(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.ItemStackData
	 * Size -> 0x0010
	 */
	struct FItemStackData
	{
	public:
		TArray<class UItemStateBase*>                              Stacks;                                                  // 0x0000(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.DbIntegerId
	 * Size -> 0x0008
	 */
	struct FDbIntegerId
	{
	public:
		int64_t                                                    Value;                                                   // 0x0000(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.VisibilityReplication
	 * Size -> 0x0008
	 */
	struct FVisibilityReplication
	{
	public:
		bool                                                       Value;                                                   // 0x0000(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_AYLI[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    RepHelper;                                               // 0x0004(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.InventoryStackData
	 * Size -> 0x0080
	 */
	struct FInventoryStackData
	{
	public:
		class UClass*                                              _stackClass;                                             // 0x0000(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		float                                                      _approximateCount;                                       // 0x0008(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		float                                                      _approximateMaxCount;                                    // 0x000C(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		float                                                      _weight;                                                 // 0x0010(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_LJXR[0x4];                                   // 0x0014(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<unsigned char>                                      _data;                                                   // 0x0018(0x0010) ZeroConstructor, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_KQ3T[0x58];                                  // 0x0028(0x0058) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ConZ.HitEffects
	 * Size -> 0x0038
	 */
	struct FHitEffects
	{
	public:
		float                                                      SpeedThreshold;                                          // 0x0000(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_E2S9[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UParticleSystem*                                     ParticleSystem;                                          // 0x0008(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector                                             ParticlesScale;                                          // 0x0010(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_YE03[0x4];                                   // 0x001C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UAkAudioEvent*                                       AudioEvent;                                              // 0x0020(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UClass*                                              CameraShake;                                             // 0x0028(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      CameraShakeScale;                                        // 0x0030(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_9DNO[0x4];                                   // 0x0034(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ConZ.AnimalSpawnInfo
	 * Size -> 0x0008
	 */
	struct FAnimalSpawnInfo
	{
	public:
		int32_t                                                    MaxSpawnInstances;                                       // 0x0000(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      SpawnProbability;                                        // 0x0004(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.AnimalManagementData
	 * Size -> 0x0030
	 */
	struct FAnimalManagementData
	{
	public:
		class UClass*                                              AnimalClass;                                             // 0x0000(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<class AAnimal2*>                                    AliveAnimals;                                            // 0x0008(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic
		TArray<class ACorpse*>                                     DeadAnimals;                                             // 0x0018(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic
		int32_t                                                    VirtualAnimalAmount;                                     // 0x0028(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_BHRB[0x4];                                   // 0x002C(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ConZ.CarcassManagementData
	 * Size -> 0x0018
	 */
	struct FCarcassManagementData
	{
	public:
		class UClass*                                              CarcassClass;                                            // 0x0000(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<class AStaticMeshActor*>                            SpawnedCarcasses;                                        // 0x0008(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.MeleeHitDetectionMarker
	 * Size -> 0x0080
	 */
	struct FMeleeHitDetectionMarker
	{
	public:
		float                                                      Time;                                                    // 0x0000(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_9242[0xC];                                   // 0x0004(0x000C) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FTransform                                          Transform;                                               // 0x0010(0x0030) Edit, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		struct FTransform                                          RootMotion;                                              // 0x0040(0x0030) Edit, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		float                                                      damageMultiplier;                                        // 0x0070(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      SelectionWeight;                                         // 0x0074(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_FX8O[0x8];                                   // 0x0078(0x0008) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ConZ.RangedWeaponSkillParametersPerSkillLevel
	 * Size -> 0x0004
	 */
	struct FRangedWeaponSkillParametersPerSkillLevel
	{
	public:
		float                                                      CrosshairHidingDuration;                                 // 0x0000(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.DrivingSkillExperienceAwards
	 * Size -> 0x0008
	 */
	struct FDrivingSkillExperienceAwards
	{
	public:
		float                                                      StartEngine;                                             // 0x0000(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      PointsPerDrivenDistanceInKm;                             // 0x0004(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.DrivingSkillEngineStallingParameters
	 * Size -> 0x0040
	 */
	struct FDrivingSkillEngineStallingParameters
	{
	public:
		float                                                      Chance;                                                  // 0x0000(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MinDuration;                                             // 0x0004(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MaxDuration;                                             // 0x0008(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      StopEngineChance;                                        // 0x000C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UCurveFloat*                                         ThrottleCurve;                                           // 0x0010(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ThrottleCurveFrequencyMultiplier;                        // 0x0018(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_8UC4[0x4];                                   // 0x001C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UCurveFloat*                                         BrakeCurve;                                              // 0x0020(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      BrakeCurveFrequencyMultiplier;                           // 0x0028(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ForceMagnitudeScale;                                     // 0x002C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UCurveFloat*                                         ForceMagnitudeScaleCurve;                                // 0x0030(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ForceMagnitudeScaleCurveFrequencyMultiplier;             // 0x0038(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ForceDirectionRandomizationAngle;                        // 0x003C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.AviationSkillParametersPerSkillLevel
	 * Size -> 0x0100
	 */
	struct FAviationSkillParametersPerSkillLevel
	{
	public:
		bool                                                       ShouldHaveMouseInput;                                    // 0x0000(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_MDTN[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      EngineStartDuration;                                     // 0x0004(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      EngineStartFailureChance;                                // 0x0008(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      EngineReadyDelay;                                        // 0x000C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      EngineFailedToStartDelay;                                // 0x0010(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      EngineFailedToStartNoFuelDelay;                          // 0x0014(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      EngineFailedToStartNoBatteryDelay;                       // 0x0018(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      EngineStalledDelay;                                      // 0x001C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ThrottleLerpMultiplier;                                  // 0x0020(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      BrakeLerpMultiplier;                                     // 0x0024(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      RollLerpMultiplier;                                      // 0x0028(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      YawLerpMultiplier;                                       // 0x002C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      PitchLerpMultiplier;                                     // 0x0030(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ControlResetLerpMultiplier;                              // 0x0034(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      WindInfluenceMultiplier;                                 // 0x0038(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_AD3W[0x4];                                   // 0x003C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FDrivingSkillEngineStallingParameters               EngineStallingByAccelerationParameters;                  // 0x0040(0x0040) Edit, NoDestructor, NativeAccessSpecifierPublic
		struct FDrivingSkillEngineStallingParameters               EngineStallingByUpShiftParameters;                       // 0x0080(0x0040) Edit, NoDestructor, NativeAccessSpecifierPublic
		struct FDrivingSkillEngineStallingParameters               EngineStallingWhenStartingViaMotion;                     // 0x00C0(0x0040) Edit, NoDestructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.ElementSnapMarker
	 * Size -> 0x0060
	 */
	struct FElementSnapMarker
	{
	public:
		struct FTransform                                          Transform;                                               // 0x0000(0x0030) Edit, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		struct FVector                                             Slack;                                                   // 0x0030(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       ElementTypesMustMatch;                                   // 0x003C(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       IncreaseLevelOnSnap;                                     // 0x003D(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              MaxLevelToSnap;                                          // 0x003E(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_WPWW[0x1];                                   // 0x003F(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FVector                                             RequiredElementSize;                                     // 0x0040(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector                                             RequiredElementSizeTolerance;                            // 0x004C(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       DestroySnappedElementWhenDestroyed;                      // 0x0058(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_UURN[0x1];                                   // 0x0059(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		uint16_t                                                   OutSocketTypes;                                          // 0x005A(0x0002) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		uint16_t                                                   InSocketTypes;                                           // 0x005C(0x0002) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_N9P6[0x2];                                   // 0x005E(0x0002) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ConZ.BaseBuildingSizeVariation
	 * Size -> 0x0018
	 */
	struct FBaseBuildingSizeVariation
	{
	public:
		class UClass*                                              Component;                                               // 0x0000(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_Q3TJ[0x10];                                  // 0x0008(0x0010) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ConZ.LadderMarker
	 * Size -> 0x00A0
	 */
	struct FLadderMarker
	{
	public:
		struct FTransform                                          FirstStep;                                               // 0x0000(0x0030) Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		struct FVector                                             LastStep;                                                // 0x0030(0x000C) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_WOXP[0x4];                                   // 0x003C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FTransform                                          Edge;                                                    // 0x0040(0x0030) Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		struct FVector                                             CapsuleBias;                                             // 0x0070(0x000C) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      StepHeight;                                              // 0x007C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      StepWidth;                                               // 0x0080(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      HitDetectionExtraAboveLastStep;                          // 0x0084(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      HitDetectionExtraBelowFirstStep;                         // 0x0088(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      HitDetectionExtraOnTheSides;                             // 0x008C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       HasEdge;                                                 // 0x0090(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       IsNarrow;                                                // 0x0091(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EPhysicalSurface                                           PhysicalSurfaceForSounds;                                // 0x0092(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_5KEC[0xD];                                   // 0x0093(0x000D) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ConZ.BaseElementDamageZone
	 * Size -> 0x0028
	 */
	struct FBaseElementDamageZone
	{
	public:
		struct FVector                                             BoundsMin;                                               // 0x0000(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector                                             BoundsMax;                                               // 0x000C(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MinDamagePerSecond;                                      // 0x0018(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MaxDamagePerSecond;                                      // 0x001C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MinSpeedForDamage;                                       // 0x0020(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MaxSpeedForDamage;                                       // 0x0024(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.BaseElementDestructionZone
	 * Size -> 0x002C
	 */
	struct FBaseElementDestructionZone
	{
	public:
		struct FBox                                                Bounds;                                                  // 0x0000(0x001C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		float                                                      DamageToItems;                                           // 0x001C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      FallDamagePerMeter;                                      // 0x0020(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MaxFallDamage;                                           // 0x0024(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       MustElementBeAboveZone;                                  // 0x0028(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       IgnoreElementsThatCantBePlacedOnOtherElements;           // 0x0029(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_JBP6[0x2];                                   // 0x002A(0x0002) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ConZ.PeriodicallyReplenishedResourceDescription
	 * Size -> 0x0010
	 */
	struct FPeriodicallyReplenishedResourceDescription
	{
	public:
		float                                                      InitialAmount;                                           // 0x0000(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MaxAmount;                                               // 0x0004(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ReplenishInterval;                                       // 0x0008(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ReplenishAmount;                                         // 0x000C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.ProximityReplenishedResourceDescription
	 * Size -> 0x0010
	 */
	struct FProximityReplenishedResourceDescription
	{
	public:
		float                                                      ReplenishChance;                                         // 0x0000(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FFloatInterval                                      ReplenishAmount;                                         // 0x0004(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ReplenishTimeout;                                        // 0x000C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.ReplenishableResourceDescription
	 * Size -> 0x0098
	 */
	struct FReplenishableResourceDescription
	{
	public:
		unsigned char                                              UnknownData_4SFW[0x8];                                   // 0x0000(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UClass*                                              Type;                                                    // 0x0008(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FGameplayTagContainer                               InSocketTypes;                                           // 0x0010(0x0020) Edit, NativeAccessSpecifierPublic
		struct FGameplayTagContainer                               OutSocketTypes;                                          // 0x0030(0x0020) Edit, NativeAccessSpecifierPublic
		bool                                                       IsReplenishedPeriodically;                               // 0x0050(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_ADJI[0x3];                                   // 0x0051(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FPeriodicallyReplenishedResourceDescription         PeriodicReplenishment;                                   // 0x0054(0x0010) Edit, NoDestructor, NativeAccessSpecifierPublic
		struct FProximityReplenishedResourceDescription            ProximityReplenishment;                                  // 0x0064(0x0010) Edit, NoDestructor, NativeAccessSpecifierPublic
		float                                                      InitialAmount;                                           // 0x0074(0x0004) Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MaxAmount;                                               // 0x0078(0x0004) Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ReplenishInterval;                                       // 0x007C(0x0004) Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ReplenishAmount;                                         // 0x0080(0x0004) Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_4JBJ[0x14];                                  // 0x0084(0x0014) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ConZ.CraftingSlot
	 * Size -> 0x0018
	 */
	struct FCraftingSlot
	{
	public:
		class FString                                              SlotName;                                                // 0x0000(0x0010) Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UClass*                                              SlotType;                                                // 0x0010(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.CraftingSlotAmountNeededPerSkillLevel
	 * Size -> 0x0020
	 */
	struct FCraftingSlotAmountNeededPerSkillLevel
	{
	public:
		class UClass*                                              Skill;                                                   // 0x0000(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    NoSkillAmount;                                           // 0x0008(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    BasicAmount;                                             // 0x000C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    MediumAmount;                                            // 0x0010(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    AdvancedAmount;                                          // 0x0014(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    AboveAdvancedAmount;                                     // 0x0018(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_KRVV[0x4];                                   // 0x001C(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ConZ.CraftingIngredientTypeModifier
	 * Size -> 0x0010
	 */
	struct FCraftingIngredientTypeModifier
	{
	public:
		class UClass*                                              IngredientType;                                          // 0x0000(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      AmountMultiplier;                                        // 0x0008(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_YECM[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ConZ.CraftingSlotRequirement
	 * Size -> 0x0068
	 */
	struct FCraftingSlotRequirement
	{
	public:
		class FString                                              SlotName;                                                // 0x0000(0x0010) Edit, ZeroConstructor, DisableEditOnInstance, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       LimitIngredientTypes;                                    // 0x0010(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_CE6C[0x7];                                   // 0x0011(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class UClass*>                                      IngredientTypes;                                         // 0x0018(0x0010) Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic
		ECraftingIngredientConsumptionHint                         ConsumptionHint;                                         // 0x0028(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_TQOZ[0x3];                                   // 0x0029(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    AmountNeeded;                                            // 0x002C(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       OverrideAmountNeededSkill;                               // 0x0030(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_QGL0[0x7];                                   // 0x0031(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FCraftingSlotAmountNeededPerSkillLevel              AmountNeededSkillLevelOverride;                          // 0x0038(0x0020) Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		TArray<struct FCraftingIngredientTypeModifier>             IngredientTypeModifiers;                                 // 0x0058(0x0010) Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.CraftingRecipeSkillReward
	 * Size -> 0x0040
	 */
	struct FCraftingRecipeSkillReward
	{
	public:
		unsigned char                                              Skill[0x28];                                             // 0x0000(0x0028) UNKNOWN PROPERTY: SoftClassProperty
		int32_t                                                    NoSkillReward;                                           // 0x0028(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    BasicReward;                                             // 0x002C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    MediumReward;                                            // 0x0030(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    AdvancedReward;                                          // 0x0034(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    AboveAdvancedReward;                                     // 0x0038(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_513N[0x4];                                   // 0x003C(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ConZ.CraftingProductDescription
	 * Size -> 0x00C8
	 */
	struct FCraftingProductDescription
	{
	public:
		unsigned char                                              ProductClass[0x28];                                      // 0x0000(0x0028) UNKNOWN PROPERTY: SoftClassProperty
		class FString                                              ProductClassName;                                        // 0x0028(0x0010) Edit, ZeroConstructor, DisableEditOnInstance, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FText                                                ProductCaption;                                          // 0x0038(0x0018) Edit, DisableEditOnInstance, EditConst, NativeAccessSpecifierPublic
		class UTexture2D*                                          ProductIcon;                                             // 0x0050(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<struct FCraftingSlotRequirement>                    SlotRequirements;                                        // 0x0058(0x0010) Edit, EditFixedSize, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic
		TArray<class UCraftingCondition*>                          Conditions;                                              // 0x0068(0x0010) Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic
		TArray<class UCraftingAction*>                             Actions;                                                 // 0x0078(0x0010) Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic
		struct FCraftingRecipeSkillReward                          SkillReward;                                             // 0x0088(0x0040) Edit, DisableEditOnInstance, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.DialogueInfo
	 * Size -> 0x0028
	 */
	struct FDialogueInfo
	{
	public:
		class UAkAudioEvent*                                       VoiceOver;                                               // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FText                                                Text;                                                    // 0x0008(0x0018) Edit, NativeAccessSpecifierPublic
		float                                                      Duration;                                                // 0x0020(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EDialogType                                                DialogType;                                              // 0x0024(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_25L5[0x3];                                   // 0x0025(0x0003) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ConZ.WireDescription
	 * Size -> 0x0050
	 */
	struct FWireDescription
	{
	public:
		unsigned char                                              UnknownData_4R4M[0x50];                                  // 0x0000(0x0050) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ConZ.SplineDescription
	 * Size -> 0x0030
	 */
	struct FSplineDescription
	{
	public:
		class USplineComponent*                                    SplineComponent;                                         // 0x0000(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<class USplineMeshComponent*>                        SplineMeshComponents;                                    // 0x0008(0x0010) ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic
		class UStaticMeshComponent*                                SplineStartConnector;                                    // 0x0018(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UStaticMeshComponent*                                SplineEndConnector;                                      // 0x0020(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_30XE[0x8];                                   // 0x0028(0x0008) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ConZ.MeleeSkillExperienceAwards
	 * Size -> 0x0010
	 */
	struct FMeleeSkillExperienceAwards
	{
	public:
		float                                                      Hit;                                                     // 0x0000(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Kill;                                                    // 0x0004(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ComboHitMultiplier;                                      // 0x0008(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      SkillLevelBonus;                                         // 0x000C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.ObjectConditionContainer
	 * Size -> 0x0010
	 */
	struct FObjectConditionContainer
	{
	public:
		TArray<class UClass*>                                      _objectConditions;                                       // 0x0000(0x0010) Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate
	};

	/**
	 * ScriptStruct ConZ.BruisePatch
	 * Size -> 0x0038
	 */
	struct FBruisePatch
	{
	public:
		EBruiseLayer                                               Layer;                                                   // 0x0000(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_7V0U[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<EBruiseZone>                                        AllowedZones;                                            // 0x0008(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
		int32_t                                                    Order;                                                   // 0x0018(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_ASV5[0x4];                                   // 0x001C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UTexture2D*                                          Texture;                                                 // 0x0020(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector2D                                           Offset;                                                  // 0x0028(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       Mute;                                                    // 0x0030(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_67H4[0x7];                                   // 0x0031(0x0007) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ConZ.WindowMarker
	 * Size -> 0x0050
	 */
	struct FWindowMarker
	{
	public:
		bool                                                       IsVaultable;                                             // 0x0000(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       IsFortifiable;                                           // 0x0001(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_S3QQ[0x6];                                   // 0x0002(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UWindowFortificationsType*                           WindowFortificationsType;                                // 0x0008(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<int32_t>                                            AdditionalMarkerIndicesToModify;                         // 0x0010(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		bool                                                       DidIFailToCorrectlyPlaceWindowMarkers;                   // 0x0020(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_DWDT[0x3];                                   // 0x0021(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FVector                                             Vertex1;                                                 // 0x0024(0x000C) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector                                             Vertex2;                                                 // 0x0030(0x000C) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      FortificationOffset;                                     // 0x003C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      CollisionBoxVertBias;                                    // 0x0040(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      CollisionBoxHorzBias;                                    // 0x0044(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_BU08[0x8];                                   // 0x0048(0x0008) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ConZ.WindowMarkerModifier
	 * Size -> 0x0008
	 */
	struct FWindowMarkerModifier
	{
	public:
		int32_t                                                    Index;                                                   // 0x0000(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       IsVaultable;                                             // 0x0004(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       IsFortifiable;                                           // 0x0005(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_2JYE[0x2];                                   // 0x0006(0x0002) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ConZ.BuildingsArray
	 * Size -> 0x0010
	 */
	struct FBuildingsArray
	{
	public:
		TArray<class ABuilding*>                                   _buildings;                                              // 0x0000(0x0010) ZeroConstructor, NativeAccessSpecifierPrivate
	};

	/**
	 * ScriptStruct ConZ.FortificationData
	 * Size -> 0x0020
	 */
	struct FFortificationData
	{
	public:
		int32_t                                                    MarkerIndex;                                             // 0x0000(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_WNZO[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UClass*                                              FortificationClass;                                      // 0x0008(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FDbIntegerId                                        OwnerUserProfileId;                                      // 0x0010(0x0008) NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      health;                                                  // 0x0018(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_KQWD[0x4];                                   // 0x001C(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ConZ.BuildingData
	 * Size -> 0x0028
	 */
	struct FBuildingData
	{
	public:
		bool                                                       IsCleared;                                               // 0x0000(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_3KNR[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FWindowMarkerModifier>                       WindowMarkerModifiers;                                   // 0x0008(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		TArray<struct FFortificationData>                          Fortifications;                                          // 0x0018(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.BuildingsReplicationHelper
	 * Size -> 0x0070
	 */
	struct FBuildingsReplicationHelper
	{
	public:
		TMap<class FString, struct FBuildingData>                  BuildingsData;                                           // 0x0000(0x0050) NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_ST17[0x20];                                  // 0x0050(0x0020) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ConZ.BurialInformation
	 * Size -> 0x0018
	 */
	struct FBurialInformation
	{
	public:
		struct FDbIntegerId                                        BurierUserId;                                            // 0x0000(0x0008) NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       ShouldBury;                                              // 0x0008(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_LIOQ[0x3];                                   // 0x0009(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FVector                                             BurialLocation;                                          // 0x000C(0x000C) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.BuryMaterialData
	 * Size -> 0x0028
	 */
	struct FBuryMaterialData
	{
	public:
		class UMaterialInterface*                                  Material;                                                // 0x0000(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UParticleSystem*                                     BreachActionParticles;                                   // 0x0008(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UAkAudioEvent*                                       BreachActionSound;                                       // 0x0010(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UParticleSystem*                                     DumpActionParticles;                                     // 0x0018(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UAkAudioEvent*                                       DumpActionSound;                                         // 0x0020(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.CamouflageSkillExperienceAwards
	 * Size -> 0x0004
	 */
	struct FCamouflageSkillExperienceAwards
	{
	public:
		float                                                      BonusExperience;                                         // 0x0000(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.CamouflageSkillParametersPerSkillLevel
	 * Size -> 0x0010
	 */
	struct FCamouflageSkillParametersPerSkillLevel
	{
	public:
		float                                                      Modifier;                                                // 0x0000(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Bonus;                                                   // 0x0004(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      FoliageAIPerceptionOuterRadius;                          // 0x0008(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      FoliageAIPerceptionInnerRadius;                          // 0x000C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.CargoDropSpawnerPreset
	 * Size -> 0x0010
	 */
	struct FCargoDropSpawnerPreset
	{
	public:
		class UClass*                                              Preset;                                                  // 0x0000(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ChanceMultiplier;                                        // 0x0008(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_BU2M[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ConZ.SpawnCharacterAroundInfo
	 * Size -> 0x0050
	 */
	struct FSpawnCharacterAroundInfo
	{
	public:
		TArray<class UClass*>                                      AvailablePawns;                                          // 0x0000(0x0010) Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic
		struct FTransform                                          Transform;                                               // 0x0010(0x0030) Edit, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		float                                                      MinSpawnRadius;                                          // 0x0040(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MaxSpawnRadius;                                          // 0x0044(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    NumOfCharactersToSpawn;                                  // 0x0048(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       IgnoreLimit;                                             // 0x004C(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_P092[0x3];                                   // 0x004D(0x0003) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ConZ.CarouselTextStyle
	 * Size -> 0x0080
	 */
	struct FCarouselTextStyle
	{
	public:
		struct FMargin                                             Padding;                                                 // 0x0000(0x0010) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		EHorizontalAlignment                                       HorizontalAlignment;                                     // 0x0010(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EVerticalAlignment                                         VerticalAlignment;                                       // 0x0011(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_BCN7[0x6];                                   // 0x0012(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FSlateFontInfo                                      Font;                                                    // 0x0018(0x0058) Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FLinearColor                                        ColorAndOpacity;                                         // 0x0070(0x0010) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.CarouselStyle
	 * Size -> 0x0570
	 */
	struct FCarouselStyle
	{
	public:
		struct FButtonStyle                                        LeftArrowIcon;                                           // 0x0000(0x0278) Edit, NativeAccessSpecifierPublic
		struct FButtonStyle                                        RightArrowIcon;                                          // 0x0278(0x0278) Edit, NativeAccessSpecifierPublic
		struct FCarouselTextStyle                                  ValueText;                                               // 0x04F0(0x0080) Edit, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.CarouselWithLabelStyle
	 * Size -> 0x0108
	 */
	struct FCarouselWithLabelStyle
	{
	public:
		struct FSlateBrush                                         FocusBackgroundImage;                                    // 0x0000(0x0088) Edit, NativeAccessSpecifierPublic
		struct FCarouselTextStyle                                  LabelText;                                               // 0x0088(0x0080) Edit, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.CharacterAndItemAnimation
	 * Size -> 0x0010
	 */
	struct FCharacterAndItemAnimation
	{
	public:
		class UAnimMontage*                                        CharacterMontage;                                        // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UAnimMontage*                                        ItemMontage;                                             // 0x0008(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.BodyWeaponAnimation
	 * Size -> 0x0010
	 */
	struct FBodyWeaponAnimation
	{
	public:
		class UAnimMontage*                                        Body;                                                    // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UAnimMontage*                                        Weapon;                                                  // 0x0008(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.WeaponAttachmentAnimations
	 * Size -> 0x0020
	 */
	struct FWeaponAttachmentAnimations
	{
	public:
		struct FBodyWeaponAnimation                                Add;                                                     // 0x0000(0x0010) Edit, NoDestructor, NativeAccessSpecifierPublic
		struct FBodyWeaponAnimation                                Remove;                                                  // 0x0010(0x0010) Edit, NoDestructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.WeaponSpreadItem
	 * Size -> 0x000C
	 */
	struct FWeaponSpreadItem
	{
	public:
		float                                                      Idle;                                                    // 0x0000(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Moving;                                                  // 0x0004(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      SpeedTarget;                                             // 0x0008(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.WeaponSpreadData
	 * Size -> 0x0040
	 */
	struct FWeaponSpreadData
	{
	public:
		struct FWeaponSpreadItem                                   ByStance[0x4];                                           // 0x0000(0x0030) Edit, NoDestructor, NativeAccessSpecifierPublic
		float                                                      IncrementPerShot;                                        // 0x0030(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      IncrementFromShotsMax;                                   // 0x0034(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      IncrementSpeed;                                          // 0x0038(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      DecrementSpeed;                                          // 0x003C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.WeaponViewKickData
	 * Size -> 0x0018
	 */
	struct FWeaponViewKickData
	{
	public:
		float                                                      PitchMin;                                                // 0x0000(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      PitchMax;                                                // 0x0004(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      YawMin;                                                  // 0x0008(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      YawMax;                                                  // 0x000C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      PitchDecrementSpeed;                                     // 0x0010(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      YawDecrementSpeed;                                       // 0x0014(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.FireAnimationData
	 * Size -> 0x00C0
	 */
	struct FFireAnimationData
	{
	public:
		struct FBodyWeaponAnimation                                BodyWeaponAnimation;                                     // 0x0000(0x0010) Edit, NoDestructor, NativeAccessSpecifierPublic
		float                                                      TimeBetweenShots;                                        // 0x0010(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_RYM9[0x4];                                   // 0x0014(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FBodyWeaponAnimation                                BodyWeaponAnimationChamber;                              // 0x0018(0x0010) Edit, NoDestructor, NativeAccessSpecifierPublic
		float                                                      TimeForChamber;                                          // 0x0028(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_1CA5[0x4];                                   // 0x002C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UClass*                                              Conditions;                                              // 0x0030(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FRuntimeFloatCurve                                  ProbabilityWeightCurve;                                  // 0x0038(0x0088) Edit, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.WeaponMalfunctionChances
	 * Size -> 0x0038
	 */
	struct FWeaponMalfunctionChances
	{
	public:
		struct FFloatInterval                                      Value[0x7];                                              // 0x0000(0x0038) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.WeaponMalfunctionData
	 * Size -> 0x00A8
	 */
	struct FWeaponMalfunctionData
	{
	public:
		bool                                                       UseCustomProbabilityCurve;                               // 0x0000(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_3ATH[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FRuntimeFloatCurve                                  ProbabilityCurve;                                        // 0x0008(0x0088) Edit, NativeAccessSpecifierPublic
		class UClass*                                              ClearMalfunctionSequence;                                // 0x0090(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<class UClass*>                                      ClearMalfunctionSequences;                               // 0x0098(0x0010) Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.AmmunitionData
	 * Size -> 0x0018
	 */
	struct FAmmunitionData
	{
	public:
		class UClass*                                              AmmunitionItemClass;                                     // 0x0000(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      health;                                                  // 0x0008(0x0004) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MaxHealth;                                               // 0x000C(0x0004) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      DefaultMaxHealth;                                        // 0x0010(0x0004) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EAmmunitionCartridgeState                                  State;                                                   // 0x0014(0x0001) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_LGK5[0x3];                                   // 0x0015(0x0003) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ConZ.WeaponStateSyncData
	 * Size -> 0x0048
	 */
	struct FWeaponStateSyncData
	{
	public:
		int32_t                                                    ZeroRange;                                               // 0x0000(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_FDK0[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FAmmunitionData>                             LoadedAmmoData;                                          // 0x0008(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		TArray<struct FAmmunitionData>                             InternalMagazineAmmoData;                                // 0x0018(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		class UClass*                                              LoadedAmmunitionItemClass;                               // 0x0028(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UClass*                                              LoadedProjectileClass;                                   // 0x0030(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EWeaponFiringMode                                          FiringMode;                                              // 0x0038(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_H8LZ[0x3];                                   // 0x0039(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    malfunction;                                             // 0x003C(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       IsChamberOpened;                                         // 0x0040(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_WO1H[0x7];                                   // 0x0041(0x0007) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ConZ.SkillTemplate
	 * Size -> 0x0038
	 */
	struct FSkillTemplate
	{
	public:
		ESkillAttribute                                            Attribute;                                               // 0x0000(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_8CIZ[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FText                                                Name;                                                    // 0x0008(0x0018) Edit, BlueprintVisible, NativeAccessSpecifierPublic
		class FString                                              ClassName;                                               // 0x0020(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ESkillLevel                                                Level;                                                   // 0x0030(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_8D0U[0x3];                                   // 0x0031(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      Experience;                                              // 0x0034(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.CCNonImplementedSkill
	 * Size -> 0x0020
	 */
	struct FCCNonImplementedSkill
	{
	public:
		ESkillAttribute                                            Attribute;                                               // 0x0000(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_RB2Z[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FText                                                Caption;                                                 // 0x0008(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.NonImplementedSkill
	 * Size -> 0x0020
	 */
	struct FNonImplementedSkill
	{
	public:
		ESkillAttribute                                            Attribute;                                               // 0x0000(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_P0BC[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FText                                                Caption;                                                 // 0x0008(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.CharacterImpactSounds
	 * Size -> 0x0008
	 */
	struct FCharacterImpactSounds
	{
	public:
		class UAkAudioEvent*                                       AudioEvent;                                              // 0x0000(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.CharacterHeadImpactSoundData
	 * Size -> 0x0028
	 */
	struct FCharacterHeadImpactSoundData
	{
	public:
		TArray<ECharacterImpactSourceSoundCategory>                ImpactSourceCategories;                                  // 0x0000(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<ECharacterHeadImpactSoundCategory>                  ImpactTargetCategories;                                  // 0x0010(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
		struct FCharacterImpactSounds                              Sounds;                                                  // 0x0020(0x0008) Edit, NoDestructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.CharacterHeadImpactSoundsData
	 * Size -> 0x0018
	 */
	struct FCharacterHeadImpactSoundsData
	{
	public:
		TArray<struct FCharacterHeadImpactSoundData>               SoundsData;                                              // 0x0000(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
		struct FCharacterImpactSounds                              FallbackSounds;                                          // 0x0010(0x0008) Edit, NoDestructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.CharacterTorsoImpactSoundData
	 * Size -> 0x0028
	 */
	struct FCharacterTorsoImpactSoundData
	{
	public:
		TArray<ECharacterImpactSourceSoundCategory>                ImpactSourceCategories;                                  // 0x0000(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<ECharacterTorsoImpactSoundCategory>                 ImpactTargetCategories;                                  // 0x0010(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
		struct FCharacterImpactSounds                              Sounds;                                                  // 0x0020(0x0008) Edit, NoDestructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.CharacterTorsoImpactSoundsData
	 * Size -> 0x0018
	 */
	struct FCharacterTorsoImpactSoundsData
	{
	public:
		TArray<struct FCharacterTorsoImpactSoundData>              SoundsData;                                              // 0x0000(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
		struct FCharacterImpactSounds                              FallbackSounds;                                          // 0x0010(0x0008) Edit, NoDestructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.CharacterArmsImpactSoundData
	 * Size -> 0x0028
	 */
	struct FCharacterArmsImpactSoundData
	{
	public:
		TArray<ECharacterImpactSourceSoundCategory>                ImpactSourceCategories;                                  // 0x0000(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<ECharacterArmsImpactSoundCategory>                  ImpactTargetCategories;                                  // 0x0010(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
		struct FCharacterImpactSounds                              Sounds;                                                  // 0x0020(0x0008) Edit, NoDestructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.CharacterArmsImpactSoundsData
	 * Size -> 0x0018
	 */
	struct FCharacterArmsImpactSoundsData
	{
	public:
		TArray<struct FCharacterArmsImpactSoundData>               SoundsData;                                              // 0x0000(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
		struct FCharacterImpactSounds                              FallbackSounds;                                          // 0x0010(0x0008) Edit, NoDestructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.CharacterLegsImpactSoundData
	 * Size -> 0x0028
	 */
	struct FCharacterLegsImpactSoundData
	{
	public:
		TArray<ECharacterImpactSourceSoundCategory>                ImpactSourceCategories;                                  // 0x0000(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<ECharacterLegsImpactSoundCategory>                  ImpactTargetCategories;                                  // 0x0010(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
		struct FCharacterImpactSounds                              Sounds;                                                  // 0x0020(0x0008) Edit, NoDestructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.CharacterLegsImpactSoundsData
	 * Size -> 0x0018
	 */
	struct FCharacterLegsImpactSoundsData
	{
	public:
		TArray<struct FCharacterLegsImpactSoundData>               SoundsData;                                              // 0x0000(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
		struct FCharacterImpactSounds                              FallbackSounds;                                          // 0x0010(0x0008) Edit, NoDestructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.CharacterMeshMorphTarget
	 * Size -> 0x0050
	 */
	struct FCharacterMeshMorphTarget
	{
	public:
		struct FGameplayTagQuery                                   Condition;                                               // 0x0000(0x0048) Edit, NativeAccessSpecifierPublic
		float                                                      Value;                                                   // 0x0048(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_T6BS[0x4];                                   // 0x004C(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ConZ.CharacterMeshMorphTargetArray
	 * Size -> 0x0010
	 */
	struct FCharacterMeshMorphTargetArray
	{
	public:
		TArray<struct FCharacterMeshMorphTarget>                   MorphTargetArray;                                        // 0x0000(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.CharacterMeshMaterialOverride
	 * Size -> 0x0070
	 */
	struct FCharacterMeshMaterialOverride
	{
	public:
		struct FGameplayTagQuery                                   Condition;                                               // 0x0000(0x0048) Edit, NativeAccessSpecifierPublic
		unsigned char                                              OverrideMaterial[0x28];                                  // 0x0048(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	};

	/**
	 * ScriptStruct ConZ.CharacterMeshSlice
	 * Size -> 0x0180
	 */
	struct FCharacterMeshSlice
	{
	public:
		struct FGameplayTagQuery                                   Condition;                                               // 0x0000(0x0048) Edit, NativeAccessSpecifierPublic
		struct FGameplayTagContainer                               Slots;                                                   // 0x0048(0x0020) Edit, NativeAccessSpecifierPublic
		unsigned char                                              SkeletalMesh[0x28];                                      // 0x0068(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
		struct FGameplayTag                                        SkeletalMeshSocket;                                      // 0x0090(0x0008) Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TMap<class FName, struct FCharacterMeshMorphTargetArray>   SkeletalMeshMorphTargets;                                // 0x0098(0x0050) Edit, NativeAccessSpecifierPublic
		unsigned char                                              StaticMesh[0x28];                                        // 0x00E8(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
		struct FGameplayTag                                        StaticMeshSocket;                                        // 0x0110(0x0008) Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<struct FCharacterMeshMaterialOverride>              OverrideMaterials;                                       // 0x0118(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
		unsigned char                                              SpecificAnimationBlueprintClass[0x28];                   // 0x0128(0x0028) UNKNOWN PROPERTY: SoftClassProperty
		struct FTransform                                          SpecificTransform;                                       // 0x0150(0x0030) Edit, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.CharacterMeshClassSet
	 * Size -> 0x0050
	 */
	struct FCharacterMeshClassSet
	{
	public:
		unsigned char                                              Classes[0x50];                                           // 0x0000(0x0050) UNKNOWN PROPERTY: SetProperty
	};

	/**
	 * ScriptStruct ConZ.CharacterMeshClassArray
	 * Size -> 0x0010
	 */
	struct FCharacterMeshClassArray
	{
	public:
		TArray<class UClass*>                                      Classes;                                                 // 0x0000(0x0010) Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.CharacterSpawnerDataBasedOnPreset
	 * Size -> 0x0020
	 */
	struct FCharacterSpawnerDataBasedOnPreset
	{
	public:
		class UClass*                                              Preset;                                                  // 0x0000(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       OverrideCharacterClasses;                                // 0x0008(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_M1NL[0x7];                                   // 0x0009(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class UClass*>                                      CharacterClasses;                                        // 0x0010(0x0010) Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.CharacterSpawnerMarker
	 * Size -> 0x0050
	 */
	struct FCharacterSpawnerMarker
	{
	public:
		struct FTransform                                          Transform;                                               // 0x0000(0x0030) Edit, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		struct FCharacterSpawnerDataBasedOnPreset                  Spawner;                                                 // 0x0030(0x0020) Edit, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.SpawnedPawnInfo
	 * Size -> 0x0014
	 */
	struct FSpawnedPawnInfo
	{
	public:
		unsigned char                                              UnknownData_PK7Q[0x14];                                  // 0x0000(0x0014) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ConZ.PawnCharacterInfo
	 * Size -> 0x00B8
	 */
	struct FPawnCharacterInfo
	{
	public:
		class UClass*                                              SpawnablePawn;                                           // 0x0000(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<class UClass*>                                      CharacterPreset;                                         // 0x0008(0x0010) Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic
		float                                                      PoiCharacterIdleThresholdTimeMP;                         // 0x0018(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ExteriorCharacterIdleThresholdTimeMP;                    // 0x001C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      InteriorCharacterIdleThresholdTimeMP;                    // 0x0020(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      PoiCharacterIdleThresholdTimeSP;                         // 0x0024(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ExteriorCharacterIdleThresholdTimeSP;                    // 0x0028(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      InteriorCharacterIdleThresholdTimeSP;                    // 0x002C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MinShortRangeSpawnDistance;                              // 0x0030(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MaxShortRangeSpawnDistance;                              // 0x0034(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MinLongRangeSpawnDistance;                               // 0x0038(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MaxLongRangeSpawnDistance;                               // 0x003C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      PawnCullDuration;                                        // 0x0040(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    MinWildCharactersPerPawnGroup;                           // 0x0044(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    MaxWildCharactersPerPawnGroup;                           // 0x0048(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    MaxExteriorCharactersPerPawnGroup;                       // 0x004C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    MaxInteriorCharactersPerPawnGroup;                       // 0x0050(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      PawnFieldOfView;                                         // 0x0054(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      SpawningFieldOfView;                                     // 0x0058(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    MaxAllowedPawns;                                         // 0x005C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    MaxAllowedWildPawns;                                     // 0x0060(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_QUM0[0x8];                                   // 0x0064(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    MaxAllowedExteriorPawns;                                 // 0x006C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_TB1E[0x8];                                   // 0x0070(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    MaxAllowedInteriorPawns;                                 // 0x0078(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_3950[0x8];                                   // 0x007C(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      ExteriorPawnAmountModifier;                              // 0x0084(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_7ZJ4[0x8];                                   // 0x0088(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      InteriorPawnAmountModifier;                              // 0x0090(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_YO6U[0x8];                                   // 0x0094(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      WildPawnAmountModifier;                                  // 0x009C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_5HVV[0x8];                                   // 0x00A0(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FSpawnedPawnInfo>                            SpawnedPawns;                                            // 0x00A8(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.CharacterSpawnerData
	 * Size -> 0x0010
	 */
	struct FCharacterSpawnerData
	{
	public:
		TArray<class UClass*>                                      CharacterClasses;                                        // 0x0000(0x0010) Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.LockData
	 * Size -> 0x0088
	 */
	struct FLockData
	{
	public:
		class UClass*                                              LockMinigameClass;                                       // 0x0000(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UClass*                                              FailurePenaltyClass;                                     // 0x0008(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       AreFamePointsRequired;                                   // 0x0010(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ELockDifficulty                                            LockDifficulty;                                          // 0x0011(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_04WZ[0x2];                                   // 0x0012(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      ExperienceOnSuccess;                                     // 0x0014(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ExperienceOnFailure;                                     // 0x0018(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_ULH3[0x4];                                   // 0x001C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FText                                                LockedMessage;                                           // 0x0020(0x0018) Edit, NativeAccessSpecifierPublic
		class FText                                                LockpickMessage;                                         // 0x0038(0x0018) Edit, NativeAccessSpecifierPublic
		class UStaticMesh*                                         LockMeshOuter;                                           // 0x0050(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UStaticMesh*                                         LockMeshInner;                                           // 0x0058(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      RotatingTresholdAngle;                                   // 0x0060(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Duration;                                                // 0x0064(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      AngleTolerance;                                          // 0x0068(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      PickBreakingMultiplier;                                  // 0x006C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    PickBreakingAtNumberOfFailedPushAttempts;                // 0x0070(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    NumberOfNeutralizationAttempts;                          // 0x0074(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    NumRemainingNeutralizationAttempts;                      // 0x0078(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      LockHP;                                                  // 0x007C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      GlovePickBreakingModifier;                               // 0x0080(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_0KUI[0x4];                                   // 0x0084(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ConZ.ChoppingIngredient
	 * Size -> 0x0050
	 */
	struct FChoppingIngredient
	{
	public:
		unsigned char                                              Item[0x28];                                              // 0x0000(0x0028) UNKNOWN PROPERTY: SoftClassProperty
		int32_t                                                    MinQuantity;                                             // 0x0028(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    MaxQuantity;                                             // 0x002C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       IsQuantityAffectedByTool;                                // 0x0030(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_9ZBC[0x3];                                   // 0x0031(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      InitialDamage;                                           // 0x0034(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      RandomizeDamage;                                         // 0x0038(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       OverrideAutoDestructTime;                                // 0x003C(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_SXYM[0x3];                                   // 0x003D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      AutoDestructTime;                                        // 0x0040(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       IsHealthAffectedByChoppedItem;                           // 0x0044(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_8QZX[0xB];                                   // 0x0045(0x000B) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ConZ.ChoppingTool2
	 * Size -> 0x0050
	 */
	struct FChoppingTool2
	{
	public:
		TArray<class UBaseItemTag*>                                ItemTags;                                                // 0x0000(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
		class UClass*                                              ItemTagClass;                                            // 0x0010(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              ItemClass[0x28];                                         // 0x0018(0x0028) UNKNOWN PROPERTY: SoftClassProperty
		bool                                                       OverrideChoppingTime;                                    // 0x0040(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_9TQ1[0x3];                                   // 0x0041(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      ChoppingTimeMultiplier;                                  // 0x0044(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       OverrideIngredientsQuantity;                             // 0x0048(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_74IR[0x3];                                   // 0x0049(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    IngredientsQuantityBonus;                                // 0x004C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.PossibleChoppingTools
	 * Size -> 0x0010
	 */
	struct FPossibleChoppingTools
	{
	public:
		TArray<struct FChoppingTool2>                              PossibleTools;                                           // 0x0000(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.ExperienceDependentFloat
	 * Size -> 0x0008
	 */
	struct FExperienceDependentFloat
	{
	public:
		float                                                      ValueWhenExperienceIsMinimal;                            // 0x0000(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ValueWhenExperienceIsMaximal;                            // 0x0004(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.ChoppingParametersPerSkillLevel
	 * Size -> 0x000C
	 */
	struct FChoppingParametersPerSkillLevel
	{
	public:
		struct FExperienceDependentFloat                           ChoppingTime;                                            // 0x0000(0x0008) Edit, NoDestructor, NativeAccessSpecifierPublic
		int32_t                                                    IngredientsQuantityBonus;                                // 0x0008(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.ChoppingRecipe
	 * Size -> 0x0098
	 */
	struct FChoppingRecipe
	{
	public:
		class FText                                                InteractionCaption;                                      // 0x0000(0x0018) Edit, NativeAccessSpecifierPublic
		class UAkAudioEvent*                                       ChopAudioEvent;                                          // 0x0018(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ENoiseLevel                                                noiseLevel;                                              // 0x0020(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EPrisonerMontage                                           ChoppingMontage;                                         // 0x0021(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EPrisonerMontage                                           ChoppingMontageEnd;                                      // 0x0022(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       EnforceDroppingItemOnGround;                             // 0x0023(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       ShouldResultUsesDependOnSourceHP;                        // 0x0024(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_65IJ[0x3];                                   // 0x0025(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FChoppingIngredient>                         Ingredients;                                             // 0x0028(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
		struct FPossibleChoppingTools                              ToolRequiredToBeInRightHand;                             // 0x0038(0x0010) Edit, NativeAccessSpecifierPublic
		TArray<struct FPossibleChoppingTools>                      AdditionalToolsRequired;                                 // 0x0048(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
		class UClass*                                              Skill;                                                   // 0x0058(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ExperiencePointsAwarded;                                 // 0x0060(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FChoppingParametersPerSkillLevel                    NoSkillLevelData;                                        // 0x0064(0x000C) Edit, NoDestructor, NativeAccessSpecifierPublic
		struct FChoppingParametersPerSkillLevel                    BasicLevelData;                                          // 0x0070(0x000C) Edit, NoDestructor, NativeAccessSpecifierPublic
		struct FChoppingParametersPerSkillLevel                    MediumLevelData;                                         // 0x007C(0x000C) Edit, NoDestructor, NativeAccessSpecifierPublic
		struct FChoppingParametersPerSkillLevel                    AdvancedLevelData;                                       // 0x0088(0x000C) Edit, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_HIJD[0x4];                                   // 0x0094(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ConZ.InteractionStruct
	 * Size -> 0x0078
	 */
	struct FInteractionStruct
	{
	public:
		EInteractionType                                           interactionType;                                         // 0x0000(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_VOCU[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              InteractionCaption;                                      // 0x0008(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_NM7R[0x60];                                  // 0x0018(0x0060) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ConZ.CircularLayerData
	 * Size -> 0x0008
	 */
	struct FCircularLayerData
	{
	public:
		float                                                      CenterCutoffPercentage;                                  // 0x0000(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Size;                                                    // 0x0004(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.CircularSegmentContainer
	 * Size -> 0x0018
	 */
	struct FCircularSegmentContainer
	{
	public:
		TArray<class UCircularMenuSegmentWidget*>                  SegmentWidgets;                                          // 0x0000(0x0010) ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic
		int32_t                                                    SegmentCountOverride;                                    // 0x0010(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Offset;                                                  // 0x0014(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.ClearMalfunctionData
	 * Size -> 0x0018
	 */
	struct FClearMalfunctionData
	{
	public:
		bool                                                       ShouldClearMalfunction;                                  // 0x0000(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_S0E0[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FBodyWeaponAnimation                                Animations;                                              // 0x0008(0x0010) Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.ClothesMeshPair
	 * Size -> 0x0040
	 */
	struct FClothesMeshPair
	{
	public:
		class UStaticMesh*                                         MaleStaticMesh;                                          // 0x0000(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class USkeletalMesh*                                       MaleSkeletalMesh;                                        // 0x0008(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<class UMaterialInstance*>                           MaleMaterials;                                           // 0x0010(0x0010) Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic
		class UStaticMesh*                                         FemaleStaticMesh;                                        // 0x0020(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class USkeletalMesh*                                       FemaleSkeletalMesh;                                      // 0x0028(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<class UMaterialInstance*>                           FemaleMaterials;                                         // 0x0030(0x0010) Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.AnimalPaceSettings
	 * Size -> 0x0010
	 */
	struct FAnimalPaceSettings
	{
	public:
		float                                                      RunSpeed;                                                // 0x0000(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      TrotSpeed;                                               // 0x0004(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      WalkSpeed;                                               // 0x0008(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      SneakSpeed;                                              // 0x000C(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.AnimalStationaryRotationRateSettings
	 * Size -> 0x003C
	 */
	struct FAnimalStationaryRotationRateSettings
	{
	public:
		struct FRotator                                            RunRotationRate;                                         // 0x0000(0x000C) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		struct FRotator                                            TrotRotationRate;                                        // 0x000C(0x000C) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		struct FRotator                                            WalkRotationRate;                                        // 0x0018(0x000C) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		struct FRotator                                            SneakRotationRate;                                       // 0x0024(0x000C) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		struct FRotator                                            StandRotationRate;                                       // 0x0030(0x000C) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.ChargeAttackData
	 * Size -> 0x0020
	 */
	struct FChargeAttackData
	{
	public:
		class UAnimMontage*                                        Montage;                                                 // 0x0000(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      RegainControlDurationModifier;                           // 0x0008(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Range;                                                   // 0x000C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Speed;                                                   // 0x0010(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Height;                                                  // 0x0014(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      lengthOverride;                                          // 0x0018(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_0TUF[0x4];                                   // 0x001C(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ConZ.CloseRangeAttackData
	 * Size -> 0x0018
	 */
	struct FCloseRangeAttackData
	{
	public:
		class UAnimMontage*                                        Montage;                                                 // 0x0000(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      RegainControlDurationModifier;                           // 0x0008(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Range;                                                   // 0x000C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Angle;                                                   // 0x0010(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      HorizontalHalfAngleRange;                                // 0x0014(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.TurnMontages
	 * Size -> 0x0010
	 */
	struct FTurnMontages
	{
	public:
		class UAnimMontage*                                        TurnInPlaceLeft;                                         // 0x0000(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UAnimMontage*                                        TurnInPlaceRight;                                        // 0x0008(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.AnimalActionMontageData
	 * Size -> 0x0018
	 */
	struct FAnimalActionMontageData
	{
	public:
		class UAnimMontage*                                        SleepMontage;                                            // 0x0000(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UAnimMontage*                                        EatMontage;                                              // 0x0008(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UAnimMontage*                                        IntimidateMontage;                                       // 0x0010(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.ContainerItemDescriptorData
	 * Size -> 0x0050
	 */
	struct FContainerItemDescriptorData
	{
	public:
		unsigned char                                              UnknownData_8FN1[0x4];                                   // 0x0000(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      health;                                                  // 0x0004(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      DefaultMaxHealth;                                        // 0x0008(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Quantity;                                                // 0x000C(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Usage;                                                   // 0x0010(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      TotalWeight;                                             // 0x0014(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    DisplayAmountLeft;                                       // 0x0018(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    DisplayAmountRight;                                      // 0x001C(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       ShouldDisplayTextLeft;                                   // 0x0020(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       ShouldDisplayTextRight;                                  // 0x0021(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_6JLX[0x6];                                   // 0x0022(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UTexture2D*                                          Icon;                                                    // 0x0028(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FGuid                                               UniqueItemId;                                            // 0x0030(0x0010) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      DamageOverTime;                                          // 0x0040(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      TradePriceModifier;                                      // 0x0044(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    AmmoCount;                                               // 0x0048(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_HILK[0x4];                                   // 0x004C(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ConZ.ImageAssetToLoad
	 * Size -> 0x0018
	 */
	struct FImageAssetToLoad
	{
	public:
		struct FGameplayTag                                        Name;                                                    // 0x0000(0x0008) Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              FilePath;                                                // 0x0008(0x0010) Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.ConZBaseRepairAreaDuration
	 * Size -> 0x0008
	 */
	struct FConZBaseRepairAreaDuration
	{
	public:
		int32_t                                                    NumberOfBaseElementsTreshold;                            // 0x0000(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      RepairDuration;                                          // 0x0004(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.BuoyancyTestPoint
	 * Size -> 0x0014
	 */
	struct FBuoyancyTestPoint
	{
	public:
		struct FVector                                             Location;                                                // 0x0000(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Radius;                                                  // 0x000C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Density;                                                 // 0x0010(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.BoatParametersPerMovementPace
	 * Size -> 0x0018
	 */
	struct FBoatParametersPerMovementPace
	{
	public:
		bool                                                       IsValid;                                                 // 0x0000(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_RW6V[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      BaseMaxForwardSpeed;                                     // 0x0004(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       CanReverse;                                              // 0x0008(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_8QH6[0x3];                                   // 0x0009(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      BaseMaxReverseSpeed;                                     // 0x000C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MinPrisonerStrength;                                     // 0x0010(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ThrottleMultiplier;                                      // 0x0014(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.TradeOutpostProsperityLevelInfo
	 * Size -> 0x0018
	 */
	struct FTradeOutpostProsperityLevelInfo
	{
	public:
		class FString                                              ProsperityLevelName;                                     // 0x0000(0x0010) Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ProsperityLevelThreshold;                                // 0x0010(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      FundsChangeRatePerHour;                                  // 0x0014(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.PendingTraderPersonalityDataHelperStruct
	 * Size -> 0x0018
	 */
	struct FPendingTraderPersonalityDataHelperStruct
	{
	public:
		unsigned char                                              UnknownData_6SK3[0x10];                                  // 0x0000(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UTraderPersonalityDataAsset*                         Personality;                                             // 0x0010(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.CommonMapNames
	 * Size -> 0x0018
	 */
	struct FCommonMapNames
	{
	public:
		class FName                                                MainMenu;                                                // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                CharacterCreationMenu;                                   // 0x0008(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                Singleplayer;                                            // 0x0010(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.CharacterCreationMenuContext
	 * Size -> 0x0030
	 */
	struct FCharacterCreationMenuContext
	{
	public:
		bool                                                       IsPreferringMultiplayer;                                 // 0x0000(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_EMPU[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              ServerIp;                                                // 0x0008(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    ServerResponsePort;                                      // 0x0018(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    ServerGameplayPort;                                      // 0x001C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              ServerAuthToken;                                         // 0x0020(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.PrisonerConditionalSpawnEquipment
	 * Size -> 0x0078
	 */
	struct FPrisonerConditionalSpawnEquipment
	{
	public:
		struct FGameplayTagQuery                                   Condition;                                               // 0x0000(0x0048) Edit, NativeAccessSpecifierPublic
		unsigned char                                              ItemClass[0x28];                                         // 0x0048(0x0028) UNKNOWN PROPERTY: SoftClassProperty
		EPrisonerItemEquipType                                     EquipType;                                               // 0x0070(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_V9DT[0x7];                                   // 0x0071(0x0007) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ConZ.ConZSliderStyle
	 * Size -> 0x0228
	 */
	struct FConZSliderStyle
	{
	public:
		struct FProgressBarStyle                                   Slider;                                                  // 0x0000(0x01A0) Edit, DisableEditOnInstance, NativeAccessSpecifierPublic
		struct FSlateBrush                                         Thumb;                                                   // 0x01A0(0x0088) Edit, DisableEditOnInstance, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.ConZSquadEmblemElement
	 * Size -> 0x0004
	 */
	struct FConZSquadEmblemElement
	{
	public:
		unsigned char                                              ShapeIndex;                                              // 0x0000(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              PrimaryColorIndex;                                       // 0x0001(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              SecondaryColorIndex;                                     // 0x0002(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              TertiaryColorIndex;                                      // 0x0003(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.ConZSquadEmblem
	 * Size -> 0x0008
	 */
	struct FConZSquadEmblem
	{
	public:
		struct FConZSquadEmblemElement                             Background;                                              // 0x0000(0x0004) Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic
		struct FConZSquadEmblemElement                             Symbol;                                                  // 0x0004(0x0004) Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.ConZSquadPendingMember
	 * Size -> 0x0010
	 */
	struct FConZSquadPendingMember
	{
	public:
		struct FDbIntegerId                                        UserProfileId;                                           // 0x0000(0x0008) Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_PH53[0x8];                                   // 0x0008(0x0008) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ConZ.ConZSquadMember
	 * Size -> 0x0010
	 */
	struct FConZSquadMember
	{
	public:
		struct FDbIntegerId                                        UserProfileId;                                           // 0x0000(0x0008) Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EConZSquadMemberRank                                       Rank;                                                    // 0x0008(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       online;                                                  // 0x0009(0x0001) Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       InDanger;                                                // 0x000A(0x0001) Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       IsAlive;                                                 // 0x000B(0x0001) Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_A37O[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ConZ.ConZVehicleFlatTireWheelConfiguration
	 * Size -> 0x0050
	 */
	struct FConZVehicleFlatTireWheelConfiguration
	{
	public:
		struct FDcxVehicleWheelData                                FlatTireWheelData;                                       // 0x0000(0x0020) Edit, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_3OP9[0x20];                                  // 0x0020(0x0020) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UDcxVehicleTire*                                     FlatTire;                                                // 0x0040(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UDcxVehicleTire*                                     OriginalTire;                                            // 0x0048(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.ConZVehicleTireParticleData
	 * Size -> 0x0014
	 */
	struct FConZVehicleTireParticleData
	{
	public:
		float                                                      MinLateralSlip;                                          // 0x0000(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MaxLateralSlip;                                          // 0x0004(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MinLongitudinalSlip;                                     // 0x0008(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MaxLongitudinalSlip;                                     // 0x000C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ParticleScaleModifier;                                   // 0x0010(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.ConZWaterSplineControlPoint
	 * Size -> 0x0014 (FullSize[0x0058] - InheritedSize[0x0044])
	 */
	struct FConZWaterSplineControlPoint : public FSplinePoint
	{
	public:
		bool                                                       Selected;                                                // 0x0044(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_CAQC[0x3];                                   // 0x0045(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      Width;                                                   // 0x0048(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MaxDepth;                                                // 0x004C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Speed;                                                   // 0x0050(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Opacity;                                                 // 0x0054(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.ConZGerstnerWavesParameters
	 * Size -> 0x0010
	 */
	struct FConZGerstnerWavesParameters
	{
	public:
		float                                                      Angle;                                                   // 0x0000(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Height;                                                  // 0x0004(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Length;                                                  // 0x0008(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Steepness;                                               // 0x000C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.ItemSpawningSettings
	 * Size -> 0x0058
	 */
	struct FItemSpawningSettings
	{
	public:
		bool                                                       UseQuadTreeToDetermineRelevantSpawnerGroups;             // 0x0000(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_B405[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      RelevantSpawnerGroupsUpdateInterval;                     // 0x0004(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MinPlayerLocationDeltaToUpdateRelevantSpawnerGroups;     // 0x0008(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      SpawnerGroupsCullDistance;                               // 0x000C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      SpawnerGroupsExpirationTimeInMinutes;                    // 0x0010(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ExamineSpawnerExpirationTimeInMinutes;                   // 0x0014(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      SpawnerTasksProcessingInterval;                          // 0x0018(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      SpawnerTasksProcessingBudgetInMilliseconds;              // 0x001C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    MaxNumberOfSpawnerTasksPerUpdate;                        // 0x0020(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       ShouldDestroySpawnedItemsIfNoPlayersAround;              // 0x0024(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_253H[0x3];                                   // 0x0025(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      RarityRatio;                                             // 0x0028(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      SpawnerProbabilityMultiplier;                            // 0x002C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ExamineSpawnerProbabilityMultiplier;                     // 0x0030(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ItemHealthMultiplierWhenUnderwater;                      // 0x0034(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              SaveFileName;                                            // 0x0038(0x0010) Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       DisableSerialization;                                    // 0x0048(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       IgnoreSpawnerProbability;                                // 0x0049(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       IgnoreItemLimit;                                         // 0x004A(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       IgnoreItemZone;                                          // 0x004B(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       IgnoreItemRarity;                                        // 0x004C(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       DebugDrawItemSpawnTransforms;                            // 0x004D(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_0490[0x2];                                   // 0x004E(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      DebugDrawItemSpawnTransformsDuration;                    // 0x0050(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_09PW[0x4];                                   // 0x0054(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ConZ.ConZPrisonerSpawnEquipmentProperties
	 * Size -> 0x0018
	 */
	struct FConZPrisonerSpawnEquipmentProperties
	{
	public:
		float                                                      Elevation;                                               // 0x0000(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       ClearEquipment;                                          // 0x0004(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       OverrideDefaultOutfit;                                   // 0x0005(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_YOB4[0x2];                                   // 0x0006(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UPrisonerLoadout*                                    LoadoutFemale;                                           // 0x0008(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UPrisonerLoadout*                                    LoadoutMale;                                             // 0x0010(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.CorpseSkeletalMeshRepData
	 * Size -> 0x0070
	 */
	struct FCorpseSkeletalMeshRepData
	{
	public:
		class FName                                                DisplayName;                                             // 0x0000(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class USkeletalMesh*                                       Mesh;                                                    // 0x0008(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<class UMaterialInterface*>                          Materials;                                               // 0x0010(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic
		bool                                                       Visibility;                                              // 0x0020(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_GM0K[0xF];                                   // 0x0021(0x000F) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FTransform                                          Transform;                                               // 0x0030(0x0030) Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		class FName                                                AttachSocket;                                            // 0x0060(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_AVBU[0x8];                                   // 0x0068(0x0008) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ConZ.CorpseStaticMeshRepData
	 * Size -> 0x0070
	 */
	struct FCorpseStaticMeshRepData
	{
	public:
		class FName                                                DisplayName;                                             // 0x0000(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UStaticMesh*                                         Mesh;                                                    // 0x0008(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<class UMaterialInterface*>                          Materials;                                               // 0x0010(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic
		bool                                                       Visibility;                                              // 0x0020(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_96NU[0xF];                                   // 0x0021(0x000F) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FTransform                                          Transform;                                               // 0x0030(0x0030) Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		class FName                                                AttachSocket;                                            // 0x0060(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_3PMZ[0x8];                                   // 0x0068(0x0008) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ConZ.CorpsePoseData
	 * Size -> 0x0040
	 */
	struct FCorpsePoseData
	{
	public:
		struct FVector_NetQuantize                                 Location;                                                // 0x0000(0x000C) Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_GHWB[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FQuat                                               Rotation;                                                // 0x0010(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		struct FVector_NetQuantize                                 LinearVelocity;                                          // 0x0020(0x000C) Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector_NetQuantize                                 AngularVelocity;                                         // 0x002C(0x000C) Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_9X1F[0x8];                                   // 0x0038(0x0008) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ConZ.CraftingPair
	 * Size -> 0x0028
	 */
	struct FCraftingPair
	{
	public:
		class UClass*                                              CraftedItem;                                             // 0x0000(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UClass*                                              CraftingItem;                                            // 0x0008(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    CraftedItemCount;                                        // 0x0010(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_CWS4[0x4];                                   // 0x0014(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class UClass*>                                      BonusItems;                                              // 0x0018(0x0010) Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ConZ.PossibleItem
	 * Size -> 0x0030
	 */
	struct FPossibleItem
	{
	public:
		class UCraftingItemTag*                                    CraftingTag;                                             // 0x0000(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UClass*                                              Item;                                                    // 0x0008(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Quantity;                                                // 0x0010(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
