#pragma once

/**
 * Name: Sea_of_Thieves
 * Version: 9505844
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Enums
	// --------------------------------------------------
	/**
	 * Enum Athena.EHealthChangedReason
	 */
	enum class EHealthChangedReason : uint8_t
	{
		NoChange                     = 0,
		Test                         = 1,
		Reset                        = 2,
		CannonProjectile             = 3,
		CannonBallSplashDamage       = 4,
		FallDamage                   = 5,
		HealedFromFood               = 6,
		Drowning                     = 7,
		DamagedBySwimmingCreature    = 8,
		StruckByLightning            = 9,
		Blunderbuss_Default          = 10,
		Pistol_Default               = 11,
		EyeOfReach_Default           = 12,
		Cutlass                      = 13,
		GunpowderBarrelExplosion     = 14,
		IngestedByKrakenTentacle     = 15,
		PowerSlammedByKrakenTentacle = 16,
		StarvedToDeath               = 17,
		SkeletonFormsHeal            = 18,
		Venom                        = 19,
		Fire                         = 20,
		Emote                        = 21,
		TinySharkBite                = 22,
		SunkenCurseSelfHeal          = 23,
		SunkenCurseDamage            = 24,
		TinySharkRespawn             = 25,
		Lava                         = 26,
		Boiling                      = 27,
		StateTransfer                = 28,
		Fragile                      = 29,
		Rainfall                     = 30,
		Submerged                    = 31,
		LiquidProjectile             = 32,
		Dry                          = 33,
		StrainDamage                 = 34,
		VolcanoInstantKill           = 35,
		VolcanicRock                 = 36,
		DevilsShroud                 = 37,
		Regeneration                 = 38,
		HarpoonProjectile            = 39,
		Mechanism                    = 40,
		KnockbackAIAbility           = 41,
		SpikePit                     = 42,
		ChestOfRage                  = 43,
		Scalded                      = 44,
		Geyser                       = 45,
		Flamethrower                 = 46,
		AshenLordFireBreath          = 47,
		AshenWindsSkull              = 48,
		AshenWindsSkullCharge        = 49,
		Revive                       = 50,
		HealedByAbility              = 51,
		Shocked                      = 52,
		Siren                        = 53,
		KrakenBite                   = 54,
		Firework                     = 55,
		Sleeping                     = 56,
		DestroyAllShipAI             = 57,
		LighthouseBeam               = 58,
		MAX                          = 59,
		MAX01                        = 60
	};

	/**
	 * Enum Athena.EShipPartCustomizationErrorCode
	 */
	enum class EShipPartCustomizationErrorCode : uint8_t
	{
		AlreadyInProgress = 0,
		FailedToCustomize = 1,
		InvalidParameters = 2,
		MAX               = 3
	};

	/**
	 * Enum Athena.ERequestState
	 */
	enum class ERequestState : uint8_t
	{
		Invalid   = 0,
		Waiting   = 1,
		Complete  = 2,
		Timeout   = 3,
		Cancelled = 4,
		MAX       = 5
	};

	/**
	 * Enum Athena.EPointSelectionMethod
	 */
	enum class EPointSelectionMethod : uint8_t
	{
		GetRandom = 0,
		GetFirst  = 1,
		MAX       = 2
	};

	/**
	 * Enum Athena.ESpaceType
	 */
	enum class ESpaceType : uint8_t
	{
		WorldSpace = 0,
		LocalSpace = 1,
		MAX        = 2
	};

	/**
	 * Enum Athena.EWaterState
	 */
	enum class EWaterState : uint8_t
	{
		Empty         = 0,
		Transitioning = 1,
		Full          = 2,
		MAX           = 3
	};

	/**
	 * Enum Athena.EProjectileCollisionResponse
	 */
	enum class EProjectileCollisionResponse : uint8_t
	{
		Ignore = 0,
		Block  = 1,
		MAX    = 2
	};

	/**
	 * Enum Athena.ESprintLockReason
	 */
	enum class ESprintLockReason : uint8_t
	{
		WieldedItem       = 0,
		WieldedItemAction = 1,
		Environment       = 2,
		MAX               = 3
	};

	/**
	 * Enum Athena.ESwimAttackableType
	 */
	enum class ESwimAttackableType : uint8_t
	{
		TakesDamage = 0,
		SmallItem   = 1,
		LargeItem   = 2,
		MAX         = 3
	};

	/**
	 * Enum Athena.ECharacterGender
	 */
	enum class ECharacterGender : uint8_t
	{
		Unspecified = 0,
		Male        = 1,
		Female      = 2,
		MAX         = 3
	};

	/**
	 * Enum Athena.EAllianceStatus
	 */
	enum class EAllianceStatus : uint8_t
	{
		IsInAlliance    = 0,
		IsNotInAlliance = 1,
		MAX             = 2
	};

	/**
	 * Enum Athena.ENPCCustomAnimationState
	 */
	enum class ENPCCustomAnimationState : uint8_t
	{
		None              = 0,
		InOneShot         = 1,
		InContinuousIn    = 2,
		InContinuousLoopA = 3,
		InContinuousLoopB = 4,
		InContinuousOut   = 5,
		MAX               = 6
	};

	/**
	 * Enum Athena.EAthenaNPCObjectSlot
	 */
	enum class EAthenaNPCObjectSlot : uint8_t
	{
		Slot     = 0,
		Slot01   = 1,
		Slot02   = 2,
		Slot03   = 3,
		Slot04   = 4,
		Slot05   = 5,
		Slot06   = 6,
		Slot07   = 7,
		Slot08   = 8,
		Slot09   = 9,
		Slot_MAX = 10
	};

	/**
	 * Enum Athena.EAthenaNPCSpawnHand
	 */
	enum class EAthenaNPCSpawnHand : uint8_t
	{
		Left  = 0,
		Right = 1,
		MAX   = 2
	};

	/**
	 * Enum Athena.EAnimNotifyUnderwaterMode
	 */
	enum class EAnimNotifyUnderwaterMode : uint8_t
	{
		AutoDetect  = 0,
		AlwaysUnder = 1,
		AlwaysAbove = 2,
		MAX         = 3
	};

	/**
	 * Enum Athena.EMeleeSpecialState
	 */
	enum class EMeleeSpecialState : uint8_t
	{
		None      = 0,
		Lunge     = 1,
		Knockback = 2,
		Stunned   = 3,
		Dodge     = 4,
		MAX       = 5,
		MAX01     = 6
	};

	/**
	 * Enum Athena.ESkeletonShipCaptainDockedAnimationState
	 */
	enum class ESkeletonShipCaptainDockedAnimationState : uint8_t
	{
		None      = 0,
		Taunt     = 1,
		Ram       = 2,
		RamImpact = 3,
		MAX       = 4
	};

	/**
	 * Enum Athena.ESkeletonActiveAnimSystem
	 */
	enum class ESkeletonActiveAnimSystem : uint8_t
	{
		Sensing     = 0,
		EmoteAction = 1,
		MAX         = 2
	};

	/**
	 * Enum Athena.ESkeletonEmoteActionState
	 */
	enum class ESkeletonEmoteActionState : uint8_t
	{
		None  = 0,
		Taunt = 1,
		Cheer = 2,
		MAX   = 3
	};

	/**
	 * Enum Athena.ESkeletonSensingState
	 */
	enum class ESkeletonSensingState : uint8_t
	{
		None            = 0,
		InitialReaction = 1,
		Searching       = 2,
		AlertingOthers  = 3,
		Pursuit         = 4,
		MAX             = 5
	};

	/**
	 * Enum Athena.EKnockbackAnimDirection
	 */
	enum class EKnockbackAnimDirection : uint8_t
	{
		Forwards  = 0,
		Backwards = 1,
		MAX       = 2
	};

	/**
	 * Enum Athena.EStunAnimationType
	 */
	enum class EStunAnimationType : uint8_t
	{
		None                        = 0,
		Normal                      = 1,
		ShadowSkeletonLightExposure = 2,
		SkeletonDrunk               = 3,
		SkeletonDance               = 4,
		SkeletonSleep               = 5,
		MAX                         = 6
	};

	/**
	 * Enum Athena.EArmOverlayState
	 */
	enum class EArmOverlayState : uint8_t
	{
		Idle                          = 0,
		Locomotion                    = 1,
		Swimming                      = 2,
		Turning                       = 3,
		JumpingStart                  = 4,
		JumpingCycle                  = 5,
		JumpingPreImpact              = 6,
		JumpingLandLight              = 7,
		Equipping                     = 8,
		UnEquipping                   = 9,
		OneShotAction                 = 10,
		ContinuousActionIn            = 11,
		ContinuousActionCycle         = 12,
		ContinuousActionOut           = 13,
		ContinuousActionLocomotion    = 14,
		ContinuousActionJumpStart     = 15,
		ContinuousActionJumpCycle     = 16,
		ContinuousActionJumpPreImpact = 17,
		ContinuousActionJumpLandLight = 18,
		ContinuousActionSwimming      = 19,
		ComplexOneShotWarmUp          = 20,
		ComplexOneShotAction          = 21,
		ComplexOneShotRecover         = 22,
		BlockingInto                  = 23,
		BlockingLocomotion            = 24,
		BlockingFeedbackA             = 25,
		BlockingFeedbackB             = 26,
		BlockingOutOf                 = 27,
		Force_FullBody                = 28,
		Force_UpperBody               = 29,
		Force_2H                      = 30,
		MAX                           = 31
	};

	/**
	 * Enum Athena.EOceanCrawlerAIType
	 */
	enum class EOceanCrawlerAIType : uint8_t
	{
		OceanCrawler = 0,
		Crab         = 1,
		Eel          = 2,
		Hermit       = 3,
		MAX          = 4
	};

	/**
	 * Enum Athena.ECharacterSwimmingMode
	 */
	enum class ECharacterSwimmingMode : uint8_t
	{
		Surface   = 0,
		Submerged = 1,
		Total     = 2,
		MAX       = 3
	};

	/**
	 * Enum Athena.EAICharacterMaxSpeedModificationReason
	 */
	enum class EAICharacterMaxSpeedModificationReason : uint8_t
	{
		SkeletonFormsConstant = 0,
		SkeletonFormsEffects  = 1,
		SkeletonLimpCurse     = 2,
		MAX                   = 3
	};

	/**
	 * Enum Athena.EVoyageLocationType
	 */
	enum class EVoyageLocationType : uint8_t
	{
		Fixed   = 0,
		Random  = 1,
		Closest = 2,
		MAX     = 3
	};

	/**
	 * Enum Athena.EVoyageDisplayState
	 */
	enum class EVoyageDisplayState : uint8_t
	{
		Default  = 0,
		Proposed = 1,
		MAX      = 2
	};

	/**
	 * Enum Athena.EOverlapType
	 */
	enum class EOverlapType : uint8_t
	{
		PhysX          = 0,
		SimpleOverlaps = 1,
		Ticking        = 2,
		MAX            = 3
	};

	/**
	 * Enum Athena.ECharacterFootImpactType
	 */
	enum class ECharacterFootImpactType : uint8_t
	{
		None = 0,
		Walk = 1,
		Jump = 2,
		Pace = 3,
		MAX  = 4
	};

	/**
	 * Enum Athena.EFlameColourType
	 */
	enum class EFlameColourType : uint8_t
	{
		Light = 0,
		FX    = 1,
		Glow  = 2,
		Flame = 3,
		MAX   = 4
	};

	/**
	 * Enum Athena.EQuestBookPageRenderingMode
	 */
	enum class EQuestBookPageRenderingMode : uint8_t
	{
		NoPagesRendered                             = 0,
		DrawLeftPageAsCurrentOnly                   = 1,
		DrawLeftPageAsPreviousAndRightPageAsCurrent = 2,
		DrawLeftPageAsCurrentAndRightPageAsNext     = 3,
		MAX                                         = 4
	};

	/**
	 * Enum Athena.EBT_ShipOwnership
	 */
	enum class EBT_ShipOwnership : uint8_t
	{
		Any      = 0,
		Crew     = 1,
		Alliance = 2,
		AI       = 3,
		EBT_MAX  = 4
	};

	/**
	 * Enum Athena.ECannonInteractionState
	 */
	enum class ECannonInteractionState : uint8_t
	{
		AllInteractions              = 0,
		AimingEnabledLoadingDisabled = 1,
		LoadingEnabledAimingDisabled = 2,
		NoInteractions               = 3,
		MAX                          = 4
	};

	/**
	 * Enum Athena.EShipCurseTag
	 */
	enum class EShipCurseTag : uint8_t
	{
		None    = 0,
		Ballast = 1,
		Barrel  = 2,
		Capstan = 3,
		Helm    = 4,
		Rigging = 5,
		Peace   = 6,
		MAX     = 7
	};

	/**
	 * Enum Athena.ECurseTag
	 */
	enum class ECurseTag : uint8_t
	{
		None                                       = 0,
		ToggleInteractionsForCapstan               = 1,
		ToggleInteractionsForShipStorageContainers = 2,
		ToggleInteractionsForRigging               = 3,
		ToggleInteractionsForShipCannons           = 4,
		ToggleLockOnWheel                          = 5,
		MAX                                        = 6
	};

	/**
	 * Enum Athena.EShipSurfacingState
	 */
	enum class EShipSurfacingState : uint8_t
	{
		Sailing   = 0,
		Surfacing = 1,
		Diving    = 2,
		MAX       = 3
	};

	/**
	 * Enum Athena.EContainerType
	 */
	enum class EContainerType : uint8_t
	{
		None    = 0,
		Bucket  = 1,
		Stomach = 2,
		Kraken  = 3,
		Total   = 4,
		MAX     = 5
	};

	/**
	 * Enum Athena.EThrowableLiquidType
	 */
	enum class EThrowableLiquidType : uint8_t
	{
		Empty        = 0,
		Water        = 1,
		Vomit        = 2,
		BoilingWater = 3,
		Total        = 4,
		MAX          = 5
	};

	/**
	 * Enum Athena.EBucketProjectileDestination
	 */
	enum class EBucketProjectileDestination : uint8_t
	{
		Ahead     = 0,
		AtWielder = 1,
		Max       = 2,
		MAX       = 3
	};

	/**
	 * Enum Athena.EBucketState
	 */
	enum class EBucketState : uint8_t
	{
		Idle             = 0,
		Scooping         = 1,
		Throwing         = 2,
		DrenchingWielder = 3,
		Max              = 4,
		Pad              = 5,
		MAX              = 6
	};

	/**
	 * Enum Athena.ELocationGeneratorSampleType
	 */
	enum class ELocationGeneratorSampleType : uint8_t
	{
		None                 = 0,
		Usable               = 1,
		Unusable_NoContact   = 2,
		Unusable_SurfaceType = 3,
		Unusable_Proximity   = 4,
		Unusable_Slope       = 5,
		Unusable_BelowWater  = 6,
		MAX                  = 7
	};

	/**
	 * Enum Athena.EBurrowEruptState
	 */
	enum class EBurrowEruptState : uint8_t
	{
		Dormant = 0,
		Erupt   = 1,
		MAX     = 2
	};

	/**
	 * Enum Athena.EHasBeenWieldedState
	 */
	enum class EHasBeenWieldedState : uint8_t
	{
		InitialState      = 0,
		HasNotBeenWielded = 1,
		HasBeenWielded    = 2,
		MAX               = 3
	};

	/**
	 * Enum Athena.ECarouselPirateBodyshapeDirection
	 */
	enum class ECarouselPirateBodyshapeDirection : uint8_t
	{
		None = 0,
		N    = 1,
		NW   = 2,
		W    = 3,
		SW   = 4,
		S    = 5,
		SE   = 6,
		E    = 7,
		NE   = 8,
		MAX  = 9
	};

	/**
	 * Enum Athena.EFogBankType
	 */
	enum class EFogBankType : uint8_t
	{
		Default = 0,
		Haunted = 1,
		MAX     = 2
	};

	/**
	 * Enum Athena.EPlayerMusicState
	 */
	enum class EPlayerMusicState : uint8_t
	{
		InCave                      = 0,
		InPuzzleVault               = 1,
		InsideShip                  = 2,
		Fishing                     = 3,
		KrakenEncounter             = 4,
		MusicZone_PriorityHigh      = 5,
		MusicZone_PriorityMed       = 6,
		MusicZone_PriorityLow       = 7,
		NoMusicState                = 8,
		OnBountyQuestPreAction      = 9,
		OnBountyQuestAction         = 10,
		OnBountyFortAnticipation    = 11,
		OnBountyFortPreAction       = 12,
		OnBountyFortAction          = 13,
		OnSeaFortAnticipation       = 14,
		OnSeaFortPreAction          = 15,
		OnSeaFortAction             = 16,
		OnIsland                    = 17,
		OnIslandNearCompany         = 18,
		OutAtSea                    = 19,
		ServerMigration             = 20,
		Shipwreck                   = 21,
		SkellyShipEncounter         = 22,
		SkellyShipEmergentEncounter = 23,
		TinySharkEncounter          = 24,
		TinySharkEncounterSpecial   = 25,
		UnderWater                  = 26,
		InDeepSeaRegion             = 27,
		MAX                         = 28
	};

	/**
	 * Enum Athena.ECharacterSocketCollisionResultType
	 */
	enum class ECharacterSocketCollisionResultType : uint8_t
	{
		CollisionsOnly             = 0,
		NonCollisionsOnly          = 1,
		CollisionsAndNonCollisions = 2,
		MAX                        = 3
	};

	/**
	 * Enum Athena.ECharacterSocketCollisionTraceType
	 */
	enum class ECharacterSocketCollisionTraceType : uint8_t
	{
		WorldUp         = 0,
		WorldDown       = 1,
		WorldLeft       = 2,
		WorldRight      = 3,
		TravelForwards  = 4,
		TravelBackwards = 5,
		MAX             = 6
	};

	/**
	 * Enum Athena.ERageState
	 */
	enum class ERageState : uint8_t
	{
		Disabled     = 0,
		Dormant      = 1,
		RageBuilding = 2,
		Steaming     = 3,
		OnFire       = 4,
		MAX          = 5
	};

	/**
	 * Enum Athena.EUIInputFocusType
	 */
	enum class EUIInputFocusType : uint8_t
	{
		None             = 0,
		MouseCaptureOnly = 1,
		FullCapture      = 2,
		MAX              = 3
	};

	/**
	 * Enum Athena.EVirtualKeyboardTextUsage
	 */
	enum class EVirtualKeyboardTextUsage : uint8_t
	{
		TextChat    = 0,
		PetName     = 1,
		GenericText = 2,
		MAX         = 3
	};

	/**
	 * Enum Athena.EScoreReason
	 */
	enum class EScoreReason : uint8_t
	{
		None            = 0,
		SoldChest       = 1,
		SoldStolenChest = 2,
		CrewShipSunk    = 3,
		DownedOpponent  = 4,
		KilledOpponent  = 5,
		ChestDugUp      = 6,
		MastHit         = 7,
		CapstanHit      = 8,
		WheelHit        = 9,
		HullHit         = 10,
		MAX             = 11
	};

	/**
	 * Enum Athena.ESpecialEvents
	 */
	enum class ESpecialEvents : uint8_t
	{
		None           = 0,
		StartBlinds    = 1,
		Leaderboard    = 2,
		TavernCeremony = 3,
		MAX            = 4
	};

	/**
	 * Enum Athena.EContestStagePivot
	 */
	enum class EContestStagePivot : uint8_t
	{
		Beginning   = 0,
		Quater      = 1,
		HalfTime    = 2,
		ThirdQuater = 3,
		End         = 4,
		MAX         = 5
	};

	/**
	 * Enum Athena.EContestEventStages
	 */
	enum class EContestEventStages : uint8_t
	{
		Staging     = 0,
		Contest     = 1,
		PostContest = 2,
		Reward      = 3,
		MAX         = 4
	};

	/**
	 * Enum Athena.EMuteState
	 */
	enum class EMuteState : uint8_t
	{
		NotMuted               = 0,
		VoiceMuted             = 1,
		ChatMuted              = 2,
		VoiceAndChatMuted      = 3,
		NonVerbalMuted         = 4,
		VoiceAndNonVerbalMuted = 5,
		ChatAndNonVerbalMuted  = 6,
		AllMuted               = 7,
		MAX                    = 8
	};

	/**
	 * Enum Athena.ECrewSpawnState
	 */
	enum class ECrewSpawnState : uint8_t
	{
		Invalid               = 0,
		Onboarding            = 1,
		AtDock                = 2,
		OnShip                = 3,
		AtSinkLocation        = 4,
		AtMermaid             = 5,
		InBrig                = 6,
		InHideout             = 7,
		InContestTavern       = 8,
		AtProgressionLocation = 9,
		MAX                   = 10
	};

	/**
	 * Enum Athena.ESirenTridentProjectileState
	 */
	enum class ESirenTridentProjectileState : uint8_t
	{
		None   = 0,
		Small  = 1,
		Medium = 2,
		Large  = 3,
		MAX    = 4,
		MAX01  = 5
	};

	/**
	 * Enum Athena.EProjectileLauncherMechanismTargetMode
	 */
	enum class EProjectileLauncherMechanismTargetMode : uint8_t
	{
		TargetLocations    = 0,
		ShipsAndWatercraft = 1,
		MAX                = 2
	};

	/**
	 * Enum Athena.EDamageTargetType
	 */
	enum class EDamageTargetType : uint8_t
	{
		Player = 0,
		Ship   = 1,
		MAX    = 2
	};

	/**
	 * Enum Athena.EDiggingState
	 */
	enum class EDiggingState : uint8_t
	{
		Initial          = 0,
		BeingDug         = 1,
		WaitingForPickup = 2,
		MAX              = 3
	};

	/**
	 * Enum Athena.EDrunkennessType
	 */
	enum class EDrunkennessType : uint8_t
	{
		FromDrinkingAlcohol = 0,
		FromDrunkenChest    = 1,
		NumTypes            = 2,
		MAX                 = 3
	};

	/**
	 * Enum Athena.EConeWeightingMethod
	 */
	enum class EConeWeightingMethod : uint8_t
	{
		Weighted = 0,
		Absolute = 1,
		MAX      = 2
	};

	/**
	 * Enum Athena.EShipHullDamageType
	 */
	enum class EShipHullDamageType : uint8_t
	{
		Landscape   = 0,
		RammingSpur = 1,
		MAX         = 2
	};

	/**
	 * Enum Athena.EFogState
	 */
	enum class EFogState : uint8_t
	{
		NotSetUpYet     = 0,
		SetUp           = 1,
		FadingIn        = 2,
		Active          = 3,
		FadingOut       = 4,
		SeekingNewValue = 5,
		MAX             = 6
	};

	/**
	 * Enum Athena.EGlintCondition
	 */
	enum class EGlintCondition : uint8_t
	{
		OnShip                       = 0,
		Floating                     = 1,
		SpawnedAsSunkenSalvage       = 2,
		SpawnedAsTallTaleQuestItem   = 3,
		SpawnedAsTreasureVaultReward = 4,
		MAX                          = 5
	};

	/**
	 * Enum Athena.EHarpoonLauncherReelingState
	 */
	enum class EHarpoonLauncherReelingState : uint8_t
	{
		NotReeling    = 0,
		ReelingIn     = 1,
		ReelingLocked = 2,
		MAX           = 3
	};

	/**
	 * Enum Athena.EHarpoonLauncherRetractReason
	 */
	enum class EHarpoonLauncherRetractReason : uint8_t
	{
		Default             = 0,
		PlayerInstigated    = 1,
		TetherLengthExeeded = 2,
		MAX                 = 3
	};

	/**
	 * Enum Athena.EHarpoonProjectileState
	 */
	enum class EHarpoonProjectileState : uint8_t
	{
		Docked   = 0,
		InFlight = 1,
		Attached = 2,
		MAX      = 3
	};

	/**
	 * Enum Athena.EHoleState
	 */
	enum class EHoleState : uint8_t
	{
		Alive = 0,
		Dead  = 1,
		MAX   = 2
	};

	/**
	 * Enum Athena.ELeakEffectState
	 */
	enum class ELeakEffectState : uint8_t
	{
		Off                   = 0,
		LeakingWater          = 1,
		LeakingWaterPlugged   = 2,
		LeakingBubbles        = 3,
		LeakingBubblesPlugged = 4,
		MAX                   = 5
	};

	/**
	 * Enum Athena.ELeakState
	 */
	enum class ELeakState : uint8_t
	{
		Open    = 0,
		Plugged = 1,
		MAX     = 2
	};

	/**
	 * Enum Athena.EShipLeakerUpdateType
	 */
	enum class EShipLeakerUpdateType : uint8_t
	{
		Iterative = 0,
		ForceAll  = 1,
		MAX       = 2
	};

	/**
	 * Enum Athena.EVaultAudioSettings
	 */
	enum class EVaultAudioSettings : uint8_t
	{
		Default       = 0,
		NoWater       = 1,
		NoMusic       = 2,
		TreasureVault = 3,
		MAX           = 4
	};

	/**
	 * Enum Athena.EInventoryManipulatorAutoEquipPolicy
	 */
	enum class EInventoryManipulatorAutoEquipPolicy : uint8_t
	{
		LastIn                     = 0,
		MatchingItemDescIfPossible = 1,
		RawMeatLast                = 2,
		MAX                        = 3
	};

	/**
	 * Enum Athena.EActionQueueEntryStatus
	 */
	enum class EActionQueueEntryStatus : uint8_t
	{
		Unset     = 0,
		Set       = 1,
		Playing   = 2,
		Completed = 3,
		MAX       = 4
	};

	/**
	 * Enum Athena.EProjectileSpawnedState
	 */
	enum class EProjectileSpawnedState : uint8_t
	{
		NotSpawned = 0,
		Spawned    = 1,
		MAX        = 2
	};

	/**
	 * Enum Athena.ELightningHitTarget
	 */
	enum class ELightningHitTarget : uint8_t
	{
		RandomLocation         = 0,
		Player                 = 1,
		NearPlayer             = 2,
		Ship                   = 3,
		ShipNearMiss           = 4,
		HighPriorityPlayer     = 5,
		EnemyGhostShip         = 6,
		EnemyGhostShipNearMiss = 7,
		Total                  = 8,
		MAX                    = 9
	};

	/**
	 * Enum Athena.ELoadoutPersistence
	 */
	enum class ELoadoutPersistence : uint8_t
	{
		Temporary  = 0,
		Persistent = 1,
		MAX        = 2
	};

	/**
	 * Enum Athena.ELPVAdaptationType
	 */
	enum class ELPVAdaptationType : uint8_t
	{
		Full           = 0,
		CutTranslation = 1,
		None           = 2,
		MAX            = 3
	};

	/**
	 * Enum Athena.EForceBillowingState
	 */
	enum class EForceBillowingState : uint8_t
	{
		NoOverride         = 0,
		ForceFullyBillowed = 1,
		ForceNoBillow      = 2,
		MAX                = 3
	};

	/**
	 * Enum Athena.EPlayerAbandonedReason
	 */
	enum class EPlayerAbandonedReason : uint8_t
	{
		None                    = 0,
		NoCrewShip              = 1,
		FarFromShipAndOnLand    = 2,
		FarFromShipInWater      = 3,
		OnShip                  = 4,
		CloseEnoughToCrewShip   = 5,
		OnWatercraft            = 6,
		CloseEnoughToWatercraft = 7,
		InTheDeepSea            = 8,
		MAX                     = 9
	};

	/**
	 * Enum Athena.EPlayerAbandoned
	 */
	enum class EPlayerAbandoned : uint8_t
	{
		Yes      = 0,
		No       = 1,
		DontKnow = 2,
		MAX      = 3
	};

	/**
	 * Enum Athena.EWalletBalanceStatus
	 */
	enum class EWalletBalanceStatus : uint8_t
	{
		Unknown = 0,
		Valid   = 1,
		MAX     = 2
	};

	/**
	 * Enum Athena.EOverlapShapeType
	 */
	enum class EOverlapShapeType : uint8_t
	{
		Mesh = 0,
		Box  = 1,
		MAX  = 2
	};

	/**
	 * Enum Athena.EMusicalTriggerState
	 */
	enum class EMusicalTriggerState : uint8_t
	{
		NotActive                    = 0,
		PreparingToActivateMechanism = 1,
		MechanismActivated           = 2,
		MAX                          = 3
	};

	/**
	 * Enum Athena.ENonVerbalRadialCategory
	 */
	enum class ENonVerbalRadialCategory : uint8_t
	{
		QuickAccess      = 0,
		Strategy         = 1,
		WieldedItem      = 2,
		ControlledObject = 3,
		Invalid          = 4,
		MAX              = 5
	};

	/**
	 * Enum Athena.ENPCIdleVariantType
	 */
	enum class ENPCIdleVariantType : uint8_t
	{
		Standard = 0,
		Inactive = 1,
		Interact = 2,
		MAX      = 3
	};

	/**
	 * Enum Athena.ETutorialDialogOption
	 */
	enum class ETutorialDialogOption : uint8_t
	{
		None                                      = 0,
		ReturnToStrangerCompanyVoyageDialogOption = 1,
		ReturnToStrangerTallTaleDialogOption      = 2,
		ReturnToStrangerGoItAloneDialogOption     = 3,
		MAX                                       = 4
	};

	/**
	 * Enum Athena.ETutorialDialogStep
	 */
	enum class ETutorialDialogStep : uint8_t
	{
		None                                = 0,
		StartedTalkedToMysteriousStranger   = 1,
		FinishedTalkingToMysteriousStranger = 2,
		MAX                                 = 3
	};

	/**
	 * Enum Athena.EPiratePreviewSkeletonCurseMode
	 */
	enum class EPiratePreviewSkeletonCurseMode : uint8_t
	{
		KeepPirateAsIs           = 0,
		ForceRemoveSkeletonCurse = 1,
		ForceApplySkeletonCurse  = 2,
		MAX                      = 3
	};

	/**
	 * Enum Athena.EStartGameNarrativeMediaSize
	 */
	enum class EStartGameNarrativeMediaSize : uint8_t
	{
		Undefined = 0,
		Default   = 1,
		LargeWide = 2,
		MAX       = 3
	};

	/**
	 * Enum Athena.EStartGameNarrativePositionY
	 */
	enum class EStartGameNarrativePositionY : uint8_t
	{
		Undefined = 0,
		Top       = 1,
		Middle    = 2,
		Bottom    = 3,
		MAX       = 4
	};

	/**
	 * Enum Athena.EStartGameNarrativePositionX
	 */
	enum class EStartGameNarrativePositionX : uint8_t
	{
		Undefined = 0,
		Left      = 1,
		Middle    = 2,
		Right     = 3,
		MAX       = 4
	};

	/**
	 * Enum Athena.EMockShipConnectionPartType
	 */
	enum class EMockShipConnectionPartType : uint8_t
	{
		HoistToMast = 0,
		AngleToMast = 1,
		Total       = 2,
		MAX         = 3
	};

	/**
	 * Enum Athena.EPLSectionType
	 */
	enum class EPLSectionType : uint8_t
	{
		Module = 0,
		Link   = 1,
		Count  = 2,
		MAX    = 3
	};

	/**
	 * Enum Athena.EPiratePreviewRTTState
	 */
	enum class EPiratePreviewRTTState : uint8_t
	{
		Uninitialized    = 0,
		Busy             = 1,
		ReadyToCapture   = 2,
		CompletedCapture = 3,
		MAX              = 4
	};

	/**
	 * Enum Athena.ECompanyStatus
	 */
	enum class ECompanyStatus : uint8_t
	{
		Invalid = 0,
		Pending = 1,
		Valid   = 2,
		MAX     = 3
	};

	/**
	 * Enum Athena.EPlayerCurseTag
	 */
	enum class EPlayerCurseTag : uint8_t
	{
		None     = 0,
		Limping  = 1,
		Poisoned = 2,
		Drunk    = 3,
		Silenced = 4,
		Dancing  = 5,
		Sleeping = 6,
		Vomit    = 7,
		MAX      = 8
	};

	/**
	 * Enum Athena.ERefreshEntitlementBehaviour
	 */
	enum class ERefreshEntitlementBehaviour : uint8_t
	{
		TryUsingCachedServicesEntitlements = 0,
		FullRefresh                        = 1,
		MAX                                = 2
	};

	/**
	 * Enum Athena.EPlayerHeroStatsSuccess
	 */
	enum class EPlayerHeroStatsSuccess : uint8_t
	{
		Success                     = 0,
		Success_Zero                = 1,
		NotAutonomousProxy          = 2,
		NoLocalUser                 = 3,
		PlayerIdInvalid             = 4,
		NoClientData                = 5,
		StartOfSessionValueNotSet   = 6,
		NoServerData                = 7,
		NoHeroStatData              = 8,
		OnlineStatsPtrNull          = 9,
		OnlineStats_UnknownError    = 10,
		OnlineStats_InvalidStatId   = 11,
		OnlineStats_InvalidArgument = 12,
		OnlineStats_InvalidUser     = 13,
		MAX                         = 14
	};

	/**
	 * Enum Athena.EPremiumCatalogOfferType
	 */
	enum class EPremiumCatalogOfferType : uint8_t
	{
		Undefined = 0,
		Tab       = 1,
		BundleSet = 2,
		ItemSet   = 3,
		Cards     = 4,
		Item      = 5,
		Offer     = 6,
		MAX       = 7
	};

	/**
	 * Enum Athena.ECatalogOfferAvailability
	 */
	enum class ECatalogOfferAvailability : uint8_t
	{
		Available    = 0,
		AlreadyOwned = 1,
		Locked       = 2,
		Info         = 3,
		Hide         = 4,
		Unaffordable = 5,
		MAX          = 6
	};

	/**
	 * Enum Athena.EPremiumStoreLandingPageItemType
	 */
	enum class EPremiumStoreLandingPageItemType : uint8_t
	{
		Bundle = 0,
		Set    = 1,
		Cards  = 2,
		Item   = 3,
		MAX    = 4
	};

	/**
	 * Enum Athena.EProjectileLauncherMechanismMode
	 */
	enum class EProjectileLauncherMechanismMode : uint8_t
	{
		OneShot    = 0,
		Continuous = 1,
		MAX        = 2
	};

	/**
	 * Enum Athena.EProjectileWeaponFireType
	 */
	enum class EProjectileWeaponFireType : uint8_t
	{
		Aiming  = 0,
		HipFire = 1,
		MAX     = 2,
		MAX01   = 3
	};

	/**
	 * Enum Athena.EProjectileWeaponType
	 */
	enum class EProjectileWeaponType : uint8_t
	{
		Pistol      = 0,
		Blunderbuss = 1,
		EyeOfReach  = 2,
		MAX         = 3,
		MAX01       = 4
	};

	/**
	 * Enum Athena.EProjectileWeaponState
	 */
	enum class EProjectileWeaponState : uint8_t
	{
		Equipping         = 0,
		Idle              = 1,
		Aiming            = 2,
		Recoil            = 3,
		Reloading         = 4,
		InterruptedReload = 5,
		MAX               = 6
	};

	/**
	 * Enum Athena.EPuzzleStatueActivatedMechanismType
	 */
	enum class EPuzzleStatueActivatedMechanismType : uint8_t
	{
		Generic        = 0,
		WaterLevelUp   = 1,
		WaterLevelDown = 2,
		MAX            = 3
	};

	/**
	 * Enum Athena.EReactionSequenceState
	 */
	enum class EReactionSequenceState : uint8_t
	{
		None                      = 0,
		BeginSuccessfulSequence   = 1,
		BeginUnsuccessfulSequence = 2,
		EndSuccessfulSequence     = 3,
		EndUnsuccessfulSequence   = 4,
		Reset                     = 5,
		Cancelled                 = 6,
		MAX                       = 7,
		MAX01                     = 8
	};

	/**
	 * Enum Athena.EAllocationStrategy
	 */
	enum class EAllocationStrategy : uint8_t
	{
		Normal       = 0,
		LowPriority  = 1,
		NonAllocated = 2,
		MAX          = 3
	};

	/**
	 * Enum Athena.EShadowAIFormState
	 */
	enum class EShadowAIFormState : uint8_t
	{
		Invalid = 0,
		Light   = 1,
		Dark    = 2,
		MAX     = 3
	};

	/**
	 * Enum Athena.EShipBuilderState
	 */
	enum class EShipBuilderState : uint8_t
	{
		Idle             = 0,
		LoadingTemplate  = 1,
		CustomizingParts = 2,
		MAX              = 3
	};

	/**
	 * Enum Athena.EShipBuilderErrorCode
	 */
	enum class EShipBuilderErrorCode : uint8_t
	{
		AlreadyInProgress       = 0,
		AssetLoadingFailure     = 1,
		FailedToSpawnActor      = 2,
		FailedToBuildParts      = 3,
		InvalidParameter        = 4,
		InvalidShipDesc         = 5,
		Cancelled               = 6,
		SpawnedActorWasNotAShip = 7,
		MAX                     = 8
	};

	/**
	 * Enum Athena.EShipParticleParam
	 */
	enum class EShipParticleParam : uint8_t
	{
		None       = 0,
		DeckWater  = 1,
		FloodLevel = 2,
		Total      = 3,
		MAX        = 4
	};

	/**
	 * Enum Athena.EPurchaseRequestFailureReason
	 */
	enum class EPurchaseRequestFailureReason : uint8_t
	{
		ServiceUnavailable     = 0,
		OfferUnavailable       = 1,
		InsufficientFunds      = 2,
		RequestTimeout         = 3,
		PurchaseAlreadyPending = 4,
		MAX                    = 5
	};

	/**
	 * Enum Athena.EShovelState
	 */
	enum class EShovelState : uint8_t
	{
		Idle     = 0,
		Exhuming = 1,
		Burying  = 2,
		MAX      = 3
	};

	/**
	 * Enum Athena.EAthenaSafeZoneEnum
	 */
	enum class EAthenaSafeZoneEnum : uint8_t
	{
		NONE                 = 0,
		MAINWORLD_SAFEZONE   = 1,
		TRIBUTEPEAK_SAFEZONE = 2,
		MAX                  = 3
	};

	/**
	 * Enum Athena.EShroudBreakerActivationStateEnum
	 */
	enum class EShroudBreakerActivationStateEnum : uint8_t
	{
		DEACTIVE = 0,
		STAGE    = 1,
		STAGE01  = 2,
		STAGE02  = 3,
		STAGE03  = 4,
		MAX      = 5
	};

	/**
	 * Enum Athena.EDoorState
	 */
	enum class EDoorState : uint8_t
	{
		Closed    = 0,
		Triggered = 1,
		Opening   = 2,
		Open      = 3,
		MAX       = 4
	};

	/**
	 * Enum Athena.ESkellyFortType
	 */
	enum class ESkellyFortType : uint8_t
	{
		Default = 0,
		Damned  = 1,
		Max     = 2,
		MAX     = 3
	};

	/**
	 * Enum Athena.EDamnedFortAudioState
	 */
	enum class EDamnedFortAudioState : uint8_t
	{
		Inactive               = 0,
		BattleMusic            = 1,
		BattleMusicWithCaptain = 2,
		Finished               = 3,
		MAX                    = 4,
		MAX01                  = 5
	};

	/**
	 * Enum Athena.EStaggerReason
	 */
	enum class EStaggerReason : uint8_t
	{
		Drunk      = 0,
		Earthquake = 1,
		NumReasons = 2,
		MAX        = 3
	};

	/**
	 * Enum Athena.EStunnedActionStateItemWielding
	 */
	enum class EStunnedActionStateItemWielding : uint8_t
	{
		Allowed    = 0,
		Disallowed = 1,
		MAX        = 2
	};

	/**
	 * Enum Athena.EStunnedActionStateDurationType
	 */
	enum class EStunnedActionStateDurationType : uint8_t
	{
		Definite   = 0,
		Indefinite = 1,
		MAX        = 2
	};

	/**
	 * Enum Athena.ERitualState
	 */
	enum class ERitualState : uint8_t
	{
		Disabled  = 0,
		PrePrimed = 1,
		Primed    = 2,
		Stopped   = 3,
		Started   = 4,
		Complete  = 5,
		MAX       = 6
	};

	/**
	 * Enum Athena.ESwimmingCreatureType
	 */
	enum class ESwimmingCreatureType : uint8_t
	{
		SwimmingCreature = 0,
		Shark            = 1,
		TinyShark        = 2,
		Siren            = 3,
		MAX              = 4
	};

	/**
	 * Enum Athena.ESelectionPolicy
	 */
	enum class ESelectionPolicy : uint8_t
	{
		Random  = 0,
		Closest = 1,
		MAX     = 2
	};

	/**
	 * Enum Athena.EAISpawnerShutdownPolicy
	 */
	enum class EAISpawnerShutdownPolicy : uint8_t
	{
		SpawnerShutsDownWhenPlayersNoLongerTracked = 0,
		SpawnerShutsDownWhenStepEnd                = 1,
		MAX                                        = 2
	};

	/**
	 * Enum Athena.EAILifeTimePolicy
	 */
	enum class EAILifeTimePolicy : uint8_t
	{
		SpawnWhenVoyageParticipantsEnterDespawnWhenAllLeave                   = 0,
		SpawnWhenVoyageParticipantsEnterDespawnWhenAllVoyageParticipantsLeave = 1,
		SpawnWhenAnyEnterDespawnWhenAllLeave                                  = 2,
		MAX                                                                   = 3
	};

	/**
	 * Enum Athena.EStepsTriggerState
	 */
	enum class EStepsTriggerState : uint8_t
	{
		Closed  = 0,
		Opening = 1,
		Open    = 2,
		MAX     = 3
	};

	/**
	 * Enum Athena.ETinVoyageDifficulty
	 */
	enum class ETinVoyageDifficulty : uint8_t
	{
		Easy   = 0,
		Medium = 1,
		Hard   = 2,
		MAX    = 3
	};

	/**
	 * Enum Athena.ETreasureRoomState
	 */
	enum class ETreasureRoomState : uint8_t
	{
		Inactive   = 0,
		Waiting    = 1,
		Combat     = 2,
		CombatOver = 3,
		Aftermath  = 4,
		MAX        = 5
	};

	/**
	 * Enum Athena.EItemSpawnType
	 */
	enum class EItemSpawnType : uint8_t
	{
		None          = 0,
		Scaffolding   = 1,
		Reward        = 2,
		PressurePlate = 3,
		MAX           = 4
	};

	/**
	 * Enum Athena.EContestType
	 */
	enum class EContestType : uint8_t
	{
		Race  = 0,
		PVP   = 1,
		PVQ   = 2,
		MAX   = 3,
		MAX01 = 4
	};

	/**
	 * Enum Athena.EMatchmakingServerType
	 */
	enum class EMatchmakingServerType : uint8_t
	{
		Adventure = 0,
		Contest   = 1,
		MAX       = 2
	};

	/**
	 * Enum Athena.EMurkWaterModifierZoneState
	 */
	enum class EMurkWaterModifierZoneState : uint8_t
	{
		Active       = 0,
		Inactive     = 1,
		Activating   = 2,
		Deactivating = 3,
		MAX          = 4
	};

	/**
	 * Enum Athena.EWeepingState
	 */
	enum class EWeepingState : uint8_t
	{
		Weeping = 0,
		Calm    = 1,
		MAX     = 2
	};

	/**
	 * Enum Athena.EWheelFractureLabel
	 */
	enum class EWheelFractureLabel : uint8_t
	{
		West  = 0,
		East  = 1,
		South = 2,
		MAX   = 3
	};

	/**
	 * Enum Athena.EAudioGameState
	 */
	enum class EAudioGameState : uint8_t
	{
		None                      = 0,
		InGame                    = 1,
		InFrontendWrapper         = 2,
		InFrontendMatineeSequence = 3,
		MAX                       = 4
	};

	/**
	 * Enum Athena.ELocalGameChatStatus
	 */
	enum class ELocalGameChatStatus : uint8_t
	{
		Undefined       = 0,
		NoMicrophone    = 1,
		MicrophoneMuted = 2,
		InPartyChat     = 3,
		Ready           = 4,
		MAX             = 5
	};

	/**
	 * Enum Athena.EVoiceChatAudioDevice
	 */
	enum class EVoiceChatAudioDevice : uint8_t
	{
		None    = 0,
		Headset = 1,
		Kinect  = 2,
		MAX     = 3
	};

	/**
	 * Enum Athena.EBootflowError
	 */
	enum class EBootflowError : uint8_t
	{
		None                                                     = 0,
		Unknown                                                  = 1,
		AthenaGameInstanceFailedToConnectToServer                = 2,
		AthenaGameInstanceActiveConnectionToServerLost           = 3,
		AthenaGameInstanceActiveConnectionToServerTimedOut       = 4,
		AthenaGameInstanceInitialConnectionToServerTimedOut      = 5,
		AthenaGameInstancePendingConnectionToServerTimedOut      = 6,
		AthenaGameInstancePendingConnectionToServerLost          = 7,
		AthenaGameInstanceGameVersionMismatch                    = 8,
		AthenaGameInstanceGenericDisconnectMessage               = 9,
		AthenaGameInstanceNetDriverFailure                       = 10,
		AthenaGameInstanceInvalidFeatureConfig                   = 11,
		AthenaGameInstanceRPCSpamDetected                        = 12,
		AthenaGameInstancePlayerDeemedInactive                   = 13,
		AthenaGameInstanceInvalidServerURL                       = 14,
		AthenaGameInstanceGameAssetMismatch                      = 15,
		AthenaGameInstanceGenericTravelError                     = 16,
		AthenaGameInstanceCrewMigrationRequested                 = 17,
		AthenaGameInstanceCrewSessionLost                        = 18,
		AthenaGameInstanceServerShuttingDown                     = 19,
		ClientBootflowPrimaryPlayerSignedOut                     = 20,
		ClientBootflowPlayerSuspendedGame                        = 21,
		ClientBootflowLostConnectionToXboxLive                   = 22,
		ClientBootflowEthernetConnectionUnplugged                = 23,
		ClientEvicted                                            = 24,
		ClientInGameStateWasIdleForTooLong                       = 25,
		ClientInGameStateUnableToFindLocalUserId                 = 26,
		ClientInGameStateUnableToObtainLocalPlayerInterface      = 27,
		ClientInGameStateStopMatchmakingFailed                   = 28,
		ClientJoinServerStateFailed                              = 29,
		CrewMatchmakingStateLocalUserHasInvalidId                = 30,
		CrewMatchmakingStateUnableToObtainLocalUserId            = 31,
		CrewMatchmakingStateUnableToObtainLocalPlayerInterface   = 32,
		CrewMatchmakingStateMatchmakingFailed                    = 33,
		CrewSessionStateUnableToObtainLocalUserId                = 34,
		CrewSessionStateUnableToObtainLocalPlayerInterface       = 35,
		CrewSessionStateFailedToCreateCrewSession                = 36,
		CrewSessionOnSessionLost                                 = 37,
		DiscoveryServiceStateRequestFailedNotAuthorized          = 38,
		DiscoveryServiceStateRequestFailed                       = 39,
		EmblemDefinitionRetrievalFailed                          = 40,
		EngageStateInviteHadInvalidControllerId                  = 41,
		EngageStateNoLocalPlayerFound                            = 42,
		EntryLevelStateFailedToLoadDefaultMap                    = 43,
		EntryLevelStateFailed                                    = 44,
		LoadLevelStateTimeout                                    = 45,
		LoadLevelStateFailed                                     = 46,
		LoadUserSettingsStateFailed                              = 47,
		LoginTokenExchangePlayerFailedFlightingCheck             = 48,
		LoginTokenExchangePlayerFailedOtherTitleCheck            = 49,
		LoginTokenExchangeFailed                                 = 50,
		LoginTokenExchangeFailedPlayerBannedPerm                 = 51,
		LoginTokenExchangeFailedPlayerBannedTemp                 = 52,
		LoginTokenExchangeFailedSteamError                       = 53,
		LoginTokenExchangeFailedSteamIncorrectAppToken           = 54,
		LoginTokenExchangeFailedSteamTokenInvalid                = 55,
		LoginTokenExchangeFailedSteamUnlicensed                  = 56,
		LoginTokenExchangeFailedSteamMissingXuid                 = 57,
		LoginTokenExchangeFailedSteamBadApiResponse              = 58,
		LoginTokenExchangeFailedSteamUnreachableEndpoint         = 59,
		LoginTokenExchangeFailedTitleVersionInvalid              = 60,
		SelectUserStateFailedToShowSignInUI                      = 61,
		SelectUserStateFailedToObtainValidControllerId           = 62,
		SelectUserStateFailedToObtainValidLocalPlayer            = 63,
		SelectUserStateNotConnectedToLive                        = 64,
		SelectUserStateNotSignedInWhileUnattended                = 65,
		SelectUserStateUserDoesNotHaveUniqueNetId                = 66,
		SelectUserStateUserDidNotSignIn                          = 67,
		SelectUserStateUserIsGuest                               = 68,
		SelectUserStateInsufficientPrivilegesToPlay              = 69,
		SelectUserStateInvalidIdentityInterface                  = 70,
		ServerMatchmakingStateSandboxDisabled                    = 71,
		ServerMatchmakingStateUnableToObtainCrewId               = 72,
		ServerMatchmakingStateUnableToObtainLocalPlayerInterface = 73,
		ServerMatchmakingStateInvalidPirateIdentity              = 74,
		ServerMatchmakingStateNoServersAvailable                 = 75,
		ServerMatchmakingStateInvalidMatchmakingResponse         = 76,
		ServerMatchmakingStateInvalidResponse                    = 77,
		ServerMatchmakingStateMatchmakingTimedOut                = 78,
		ServerMatchmakingStateUnexpectedResult                   = 79,
		ServerMatchmakingStateJoinRefused                        = 80,
		ServerMatchmakingStateUnsupportedVersion                 = 81,
		ServerAtMatchmakingCapacity                              = 82,
		ServerShuttingDownWhilstMigrationIsOngoing               = 83,
		SetupConfigurationServiceStateConfigServiceRequestFailed = 84,
		SetupCrewSessionStateFailedToJoinCrewSession             = 85,
		SetupCrewSessionStateFailedToCreateCrewSession           = 86,
		SetupServiceBridgeStateFailed                            = 87,
		SetupTelemetryDispatcherStateFailed                      = 88,
		CrewSessionHandlerJoinFailedAsCrewIsFull                 = 89,
		CrewSessionHandlerJoinFailedAsCrewDoesntExist            = 90,
		CrewSessionHandlerJoinFailedAsCouldNotRetrieveAddress    = 91,
		CrewSessionHandlerJoinFailedAsUnknownErrorOccurred       = 92,
		PirateSelectionStateUnableToObtainLocalPlayerInterface   = 93,
		PirateSelectionStateUnableToRetrievePirates              = 94,
		PirateSelectionStateUnableToCreatePirate                 = 95,
		PirateSelectionStateUnableToReRollPirate                 = 96,
		SessionSelectInvalidSessionTypeSpecified                 = 97,
		InvitePrivilegesCheckFailed                              = 98,
		InviteUnableToRetrieveSession                            = 99,
		InviteSessionXboxPadOnly                                 = 100,
		InviteSessionNoBannedData                                = 101,
		InviteSessionFull                                        = 102,
		InviteSessionUnknownFailure                              = 103,
		InviteSessionNoTransferHandle                            = 104,
		InviteSessionUnableToFindTargetSession                   = 105,
		InviteSessionIsNotJoinable                               = 106,
		FailedToEnumerateEntitlements                            = 107,
		WhatsNewArticleRetrievalStateInvalidIdentityInterface    = 108,
		FailedToFetchExistingSessions                            = 109,
		FailedToDisconnectFromServiceBridge                      = 110,
		LobbySesssionHandlerFailedToCreateLobbySession           = 111,
		LobbySesssionHandlerFailedToJoinLobbySession             = 112,
		LobbySessionHandlerJoinFailedAsUnknownErrorOccurred      = 113,
		LobbySessionHandlerJoinFailedAsCouldNotRetrieveAddress   = 114,
		LobbySessionHandlerJoinFailedAsSessionIsFull             = 115,
		LobbySessionHandlerJoinFailedAsSessionDoesntExist        = 116,
		LobbySessionInviteIsNotJoinable                          = 117,
		CreatorModeSessionStateFailedToCreateLobbySession        = 118,
		CreatorModeSessionStateFailedToJoinLobbySession          = 119,
		CreatorModeSessionStateFailedToAdoptCrewSession          = 120,
		CreatorModeSessionStateFailedToLeaveLobbySession         = 121,
		CreatorModeSessionStateFailedToRegisterCrewsOnService    = 122,
		CreatorModeSessionStateFailedToReplicateCrewsFromService = 123,
		LobbySessionCrewlessPlayer                               = 124,
		StampSwapDiscoveryRequestFailed                          = 125,
		StampSwapDiscoveryRequestFailedNotAuthorized             = 126,
		StampSwapLoginTokenExchangeFailed                        = 127,
		StampSwapLoginTokenExchangeFailedPlayerBannedPerm        = 128,
		StampSwapLoginTokenExchangeFailedPlayerBannedTemp        = 129,
		StampSwapLoginTokenExchangeFailedSteamError              = 130,
		StampSwapLoginTokenExchangeFailedSteamIncorrectAppToken  = 131,
		StampSwapLoginTokenExchangeFailedSteamTokenInvalid       = 132,
		StampSwapLoginTokenExchangeFailedSteamUnlicensed         = 133,
		StampSwapLoginTokenExchangeFailedTitleVersionInvalid     = 134,
		StampSwapLoginTokenExchangePlayerFailedFlightingCheck    = 135,
		StampSwapLoginTokenExchangePlayerFailedOtherTitleCheck   = 136,
		StampSwapSetupServiceBridgeFailed                        = 137,
		StampSwapFailedToDisconnectFromServiceBridge             = 138,
		LoginTokenExchangeFailedUWPLicenseMissing                = 139,
		LoginTokenExchangeFailedUWPInvalidLicense                = 140,
		LoginTokenExchangeFailedUWPReplayLicense                 = 141,
		LoginTokenExchangeFailedUWPInvalidLicenseCertificate     = 142,
		LoginTokenExchangeFailedUWPNoSuitableProductLicense      = 143,
		LoginTokenExchangeFailedUWPMissingSandboxClaim           = 144,
		LoginTokenExchangeFailedClockSkew                        = 145,
		LoginTokenExchangeFailedInvalidDeviceType                = 146,
		TestFailed                                               = 147,
		TestNetworkError                                         = 148,
		Max                                                      = 149,
		MAX                                                      = 150
	};

	/**
	 * Enum Athena.EBootflowErrorPriority
	 */
	enum class EBootflowErrorPriority : uint8_t
	{
		High        = 0,
		AboveNormal = 1,
		Normal      = 2,
		BelowNormal = 3,
		Low         = 4,
		MAX         = 5
	};

	/**
	 * Enum Athena.ECreativeLobbyState
	 */
	enum class ECreativeLobbyState : uint8_t
	{
		Open           = 0,
		ReadyToSetSail = 1,
		Count          = 2,
		MAX            = 3
	};

	/**
	 * Enum Athena.ECreationMode
	 */
	enum class ECreationMode : uint8_t
	{
		Invalid = 0,
		Create  = 1,
		Join    = 2,
		MAX     = 3
	};

	/**
	 * Enum Athena.EStoreAsyncResult
	 */
	enum class EStoreAsyncResult : uint8_t
	{
		Unknown                                       = 0,
		GetAccessTokenInvalidHttpRequest              = 1,
		GetAccessTokenTimeout                         = 2,
		GetAccessTokenCancelled                       = 3,
		GetAccessTokenFailure                         = 4,
		GetPurchaseRedemptionTokenInterfaceInvalid    = 5,
		GetPurchaseRedemptionTokenOnlineStoreFailure  = 6,
		GetPurchaseRedemptionTokenFailure             = 7,
		PostPurchaseRedemptionTokenInvalidHttpRequest = 8,
		PostPurchaseRedemptionTokenCancelled          = 9,
		PostPurchaseRedemptionTokenTimeout            = 10,
		PostPurchaseRedemptionTokenFailure            = 11,
		Success                                       = 12,
		MAX                                           = 13
	};

	/**
	 * Enum Athena.EWaitForLoadingScreenSubState
	 */
	enum class EWaitForLoadingScreenSubState : uint8_t
	{
		Invalid                               = 0,
		CacheLoadingScreenDataAssetParams     = 1,
		CacheLoadingScreenLoadingScreenParams = 2,
		CacheLoadingScreenContent             = 3,
		Complete                              = 4,
		MAX                                   = 5
	};

	/**
	 * Enum Athena.EStreamingPlatform
	 */
	enum class EStreamingPlatform : uint8_t
	{
		Twitch  = 0,
		Mixer   = 1,
		YouTube = 2,
		MAX     = 3
	};

	/**
	 * Enum Athena.EWaterPuzzleAlterationEndingState
	 */
	enum class EWaterPuzzleAlterationEndingState : uint8_t
	{
		Invalid  = 0,
		Normal   = 1,
		MaxToMax = 2,
		MAX      = 3
	};

	/**
	 * Enum Athena.EMeleeAttackMoveCorrectionReason
	 */
	enum class EMeleeAttackMoveCorrectionReason : uint8_t
	{
		NotSpecified  = 0,
		SpedUpTooSoon = 1,
		MAX           = 2
	};

	/**
	 * Enum Athena.EInteractableOverlayActionType
	 */
	enum class EInteractableOverlayActionType : uint8_t
	{
		None     = 0,
		Activate = 1,
		MAX      = 2
	};

	/**
	 * Enum Athena.EServerTeleportAckReason
	 */
	enum class EServerTeleportAckReason : uint8_t
	{
		Invalid  = 0,
		Complete = 1,
		Timeout  = 2,
		MAX      = 3
	};

	/**
	 * Enum Athena.EVirtualKeyboardInputScope
	 */
	enum class EVirtualKeyboardInputScope : uint8_t
	{
		Alphanumeric    = 0,
		Default         = 1,
		Email           = 2,
		Number          = 3,
		Password        = 4,
		Search          = 5,
		TelephoneNumber = 6,
		Url             = 7,
		MAX             = 8
	};

	/**
	 * Enum Athena.EReputationNavigationAction
	 */
	enum class EReputationNavigationAction : uint8_t
	{
		Company       = 0,
		Commendations = 1,
		Ledger        = 2,
		MAX           = 3
	};

	/**
	 * Enum Athena.EServerCameraFadeAckReason
	 */
	enum class EServerCameraFadeAckReason : uint8_t
	{
		Invalid  = 0,
		Complete = 1,
		Timeout  = 2,
		MAX      = 3
	};

	/**
	 * Enum Athena.EConsumeEntitlementFailureReason
	 */
	enum class EConsumeEntitlementFailureReason : uint8_t
	{
		ServiceUnavailable = 0,
		ItemNotFound       = 1,
		RequestTimeout     = 2,
		PreconditionFailed = 3,
		Unknown            = 4,
		MAX                = 5
	};

	/**
	 * Enum Athena.EQuestGenAssetSuffix
	 */
	enum class EQuestGenAssetSuffix : uint8_t
	{
		Default     = 0,
		Underground = 1,
		AISpawn     = 2,
		MAX         = 3
	};

	/**
	 * Enum Athena.EPurchaseOfferFailureReason
	 */
	enum class EPurchaseOfferFailureReason : uint8_t
	{
		ServiceUnavailable = 0,
		OfferUnavailable   = 1,
		InsufficientFunds  = 2,
		MAX                = 3
	};

	/**
	 * Enum Athena.EHttpRequestTelemetryResult
	 */
	enum class EHttpRequestTelemetryResult : uint8_t
	{
		None      = 0,
		Completed = 1,
		Failed    = 2,
		Cancelled = 3,
		Aborted   = 4,
		MAX       = 5
	};

	/**
	 * Enum Athena.EServerMatchmakingFailureReason
	 */
	enum class EServerMatchmakingFailureReason : uint8_t
	{
		NoServersAvailable              = 0,
		CrewServerRequestBeingProcessed = 1,
		CrewBeingMigrated               = 2,
		SandboxDisabled                 = 3,
		MAX                             = 4
	};

	/**
	 * Enum Athena.EStoreRemoteServiceFutureStatus
	 */
	enum class EStoreRemoteServiceFutureStatus : uint8_t
	{
		Unknown    = 0,
		NotStarted = 1,
		Failed     = 2,
		Succeeded  = 3,
		Cancelled  = 4,
		TimedOut   = 5,
		MAX        = 6
	};

	/**
	 * Enum Athena.EServerEnvironmentShutdownStatus
	 */
	enum class EServerEnvironmentShutdownStatus : uint8_t
	{
		NotSet     = 0,
		Starting   = 1,
		StandingBy = 2,
		Active     = 3,
		MAX        = 4
	};

	/**
	 * Enum Athena.EPreLoginDeniedReason
	 */
	enum class EPreLoginDeniedReason : uint8_t
	{
		None                  = 0,
		PirateRetreival       = 1,
		EntitlementsRetrieval = 2,
		MPSDValidation        = 3,
		CrewNoLongerOnServer  = 4,
		CrewAssignmentFailed  = 5,
		AuthTokenValidation   = 6,
		UWPJoinAttemptRefusal = 7,
		MAX                   = 8
	};

	/**
	 * Enum Athena.EFriendStatus
	 */
	enum class EFriendStatus : uint8_t
	{
		None    = 0,
		Online  = 1,
		Offline = 2,
		Away    = 3,
		MAX     = 4
	};

	/**
	 * Enum Athena.ESlidingDoorDirection
	 */
	enum class ESlidingDoorDirection : uint8_t
	{
		Up      = 0,
		Down    = 1,
		Forward = 2,
		Back    = 3,
		MAX     = 4
	};

	/**
	 * Enum Athena.ESlidingDoorState
	 */
	enum class ESlidingDoorState : uint8_t
	{
		Closing = 0,
		Closed  = 1,
		Opening = 2,
		Open    = 3,
		MAX     = 4
	};

	/**
	 * Enum Athena.ESwingDoorState
	 */
	enum class ESwingDoorState : uint8_t
	{
		Closing = 0,
		Closed  = 1,
		Opening = 2,
		Open    = 3,
		MAX     = 4
	};

	/**
	 * Enum Athena.ENPCOnSurfaceDespawnReason
	 */
	enum class ENPCOnSurfaceDespawnReason : uint8_t
	{
		PlayersLeftShip           = 0,
		ShipSinking               = 1,
		ChangingLocation          = 2,
		CurrentLocationUnderWater = 3,
		ChangingState             = 4,
		Hiding                    = 5,
		ManningCannon             = 6,
		CurrentLocationOnFire     = 7,
		BeingPermanentlyDestroyed = 8,
		MAX                       = 9
	};

	/**
	 * Enum Athena.ENPCOnSurfaceFloodedLevel
	 */
	enum class ENPCOnSurfaceFloodedLevel : uint8_t
	{
		Empty            = 0,
		LowerDeckFlooded = 1,
		MidDeckFlooded   = 2,
		Sunk             = 3,
		MAX              = 4
	};

	/**
	 * Enum Athena.EOpenableItemState
	 */
	enum class EOpenableItemState : uint8_t
	{
		Open   = 0,
		Closed = 1,
		MAX    = 2
	};

	/**
	 * Enum Athena.ETradeRouteMapTextIdentifier
	 */
	enum class ETradeRouteMapTextIdentifier : uint8_t
	{
		Misc        = 0,
		Vessel      = 1,
		Origin      = 2,
		Destination = 3,
		MAX         = 4
	};

	/**
	 * Enum Athena.ELoadPersistance
	 */
	enum class ELoadPersistance : uint8_t
	{
		Permanent    = 0,
		FrontEndOnly = 1,
		CallbackOnly = 2,
		MAX          = 3
	};

	/**
	 * Enum Athena.EDelayLoadPhase
	 */
	enum class EDelayLoadPhase : uint8_t
	{
		Boot                   = 0,
		FeatureConfigAvailable = 1,
		FrontEnd               = 2,
		EngageState            = 3,
		PreloadGame            = 4,
		InGame                 = 5,
		Count                  = 6,
		MAX                    = 7
	};

	/**
	 * Enum Athena.ETelemetryPlatformId
	 */
	enum class ETelemetryPlatformId : uint8_t
	{
		Undefined = 0,
		Aoelus    = 1,
		Xbox      = 2,
		Windows   = 3,
		SteamDeck = 4,
		DevPC     = 5,
		MAX       = 6
	};

	/**
	 * Enum Athena.ERequestEntitlementBehaviour
	 */
	enum class ERequestEntitlementBehaviour : uint8_t
	{
		Default      = 0,
		ForceRefresh = 1,
		MAX          = 2
	};

	/**
	 * Enum Athena.EEntitlementConsumptionState
	 */
	enum class EEntitlementConsumptionState : uint8_t
	{
		Failed    = 0,
		Succeeded = 1,
		TimedOut  = 2,
		MAX       = 3
	};

	/**
	 * Enum Athena.EEntitlementStatus
	 */
	enum class EEntitlementStatus : uint8_t
	{
		Unknown             = 0,
		Invalid             = 1,
		UsableButUnverified = 2,
		UsableAndVerfied    = 3,
		MAX                 = 4
	};

	/**
	 * Enum Athena.EProgressStyle
	 */
	enum class EProgressStyle : uint8_t
	{
		Circle       = 0,
		Square       = 1,
		Hexagon      = 2,
		Diamond      = 3,
		SeaDogs      = 4,
		HuntersCall  = 5,
		ReapersBones = 6,
		FactionG     = 7,
		FactionB     = 8,
		MAX          = 9
	};

	/**
	 * Enum Athena.EWieldAnimationGraph
	 */
	enum class EWieldAnimationGraph : uint8_t
	{
		ThirdPerson = 0,
		FirstPerson = 1,
		MAX         = 2
	};

	/**
	 * Enum Athena.EWieldAnimationLocation
	 */
	enum class EWieldAnimationLocation : uint8_t
	{
		Left                        = 0,
		Right                       = 1,
		Floating                    = 2,
		LF_CAMERA_IK_HAND__Skeleton = 3,
		RT_CAMERA_IK_HAND__Skeleton = 4,
		LF_IK_HAND__Skeleton        = 5,
		RT_IK_HAND__Skeleton        = 6,
		Total                       = 7,
		MAX                         = 8
	};

	/**
	 * Enum Athena.ECharacterHitReactionAnimType
	 */
	enum class ECharacterHitReactionAnimType : uint8_t
	{
		Full     = 0,
		Flinch   = 1,
		None     = 2,
		Override = 3,
		MAX      = 4
	};

	/**
	 * Enum Athena.EFacialPriority
	 */
	enum class EFacialPriority : uint8_t
	{
		Low      = 0,
		Medium   = 1,
		High     = 2,
		MustPlay = 3,
		MAX      = 4
	};

	/**
	 * Enum Athena.ELocomotionType
	 */
	enum class ELocomotionType : uint8_t
	{
		Standard = 0,
		Limp     = 1,
		Drunk    = 2,
		PegLeg   = 3,
		Combat   = 4,
		HotCoals = 5,
		MAX      = 6,
		MAX01    = 7
	};

	/**
	 * Enum Athena.EStairAnimations
	 */
	enum class EStairAnimations : uint8_t
	{
		UpLeft    = 0,
		UpRight   = 1,
		DownLeft  = 2,
		DownRight = 3,
		MAX       = 4
	};

	/**
	 * Enum Athena.EArmOverlayFlags
	 */
	enum class EArmOverlayFlags : uint8_t
	{
		RightArmOnly   = 0,
		FullBody       = 1,
		UpperBody      = 2,
		UpperBodyLeft  = 3,
		UpperBodyRight = 4,
		TwoHanded      = 5,
		MAX            = 6
	};

	/**
	 * Enum Athena.EInputControllerTypeRemote
	 */
	enum class EInputControllerTypeRemote : uint8_t
	{
		GamePad  = 0,
		Keyboard = 1,
		MAX      = 2
	};

	/**
	 * Enum Athena.EInputControllerType
	 */
	enum class EInputControllerType : uint8_t
	{
		GamePad  = 0,
		Keyboard = 1,
		MAX      = 2
	};

	/**
	 * Enum Athena.EAimSensitivitySettingCategory
	 */
	enum class EAimSensitivitySettingCategory : uint8_t
	{
		Invalid            = 0,
		Blunderbuss        = 1,
		Flintlock          = 2,
		EyeOfReach         = 3,
		Spyglass           = 4,
		TridentOfDarkTides = 5,
		MAX                = 6
	};

	/**
	 * Enum Athena.FPerformanceCounterOptions
	 */
	enum class EFPerformanceCounterOptions : uint8_t
	{
		FPerformanceCounterOptions_None                           = 0,
		FPerformanceCounterOptions_FPS                            = 1,
		FPerformanceCounterOptions_Ping                           = 2,
		FPerformanceCounterOptions_FPSAndPing                     = 3,
		FPerformanceCounterOptions_FPerformanceCounterOptions_MAX = 4
	};

	/**
	 * Enum Athena.FVsyncOptions
	 */
	enum class EFVsyncOptions : uint8_t
	{
		FVsyncOptions_Off               = 0,
		FVsyncOptions_On                = 1,
		FVsyncOptions_COUNT             = 2,
		FVsyncOptions_FVsyncOptions_MAX = 3
	};

	/**
	 * Enum Athena.FPersistentUserGameSettingsDetail
	 */
	enum class EFPersistentUserGameSettingsDetail : uint8_t
	{
		FPersistentUserGameSettingsDetail_Min                                   = 0,
		FPersistentUserGameSettingsDetail_Low                                   = 1,
		FPersistentUserGameSettingsDetail_Medium                                = 2,
		FPersistentUserGameSettingsDetail_High                                  = 3,
		FPersistentUserGameSettingsDetail_Ultra                                 = 4,
		FPersistentUserGameSettingsDetail_Recommended                           = 5,
		FPersistentUserGameSettingsDetail_COUNT                                 = 6,
		FPersistentUserGameSettingsDetail_FPersistentUserGameSettingsDetail_MAX = 7
	};

	/**
	 * Enum Athena.ESettingsChangeInstigator
	 */
	enum class ESettingsChangeInstigator : uint8_t
	{
		Player       = 0,
		Programmatic = 1,
		MAX          = 2
	};

	/**
	 * Enum Athena.EBindingSet
	 */
	enum class EBindingSet : uint8_t
	{
		ActionBindings = 0,
		AxisBindings   = 1,
		MAX            = 2
	};

	/**
	 * Enum Athena.EGameSettingType
	 */
	enum class EGameSettingType : uint8_t
	{
		Bool    = 0,
		Float   = 1,
		Int     = 2,
		INVALID = 3,
		MAX     = 4
	};

	/**
	 * Enum Athena.EDitherFadeSetting
	 */
	enum class EDitherFadeSetting : uint8_t
	{
		FadeIn  = 0,
		FadeOut = 1,
		MAX     = 2
	};

	/**
	 * Enum Athena.EFadeInOnStart
	 */
	enum class EFadeInOnStart : uint8_t
	{
		FadeIn  = 0,
		FadeOut = 1,
		None    = 2,
		MAX     = 3
	};

	/**
	 * Enum Athena.ELightTemplateType
	 */
	enum class ELightTemplateType : uint8_t
	{
		PointLight = 0,
		SpotLight  = 1,
		MAX        = 2
	};

	/**
	 * Enum Athena.EServerAsyncLoadingAckReason
	 */
	enum class EServerAsyncLoadingAckReason : uint8_t
	{
		Invalid  = 0,
		Complete = 1,
		Timeout  = 2,
		MAX      = 3
	};

	/**
	 * Enum Athena.EConditionalStatType
	 */
	enum class EConditionalStatType : uint8_t
	{
		PlayerOnly                                    = 0,
		WholeCrew                                     = 1,
		WholeCrewButLegendsOnly                       = 2,
		CrewAndAlliance                               = 3,
		AllianceOnly                                  = 4,
		WholeCrewButOnlyThoseWearingTheSkeletonCurse  = 5,
		WholeCrewButOnlyThoseWearingTheGhostCurse     = 6,
		WholeCrewButOnlyThoseUnlockedTheSkeletonCurse = 7,
		WholeCrewButOnlyThoseUnlockedTheGhostCurse    = 8,
		AllPlayersWearingTheSkeletonCurseInRange      = 9,
		AllPlayersWearingTheGhostCurseInRange         = 10,
		MAX                                           = 11
	};

	/**
	 * Enum Athena.EStatConditionTarget
	 */
	enum class EStatConditionTarget : uint8_t
	{
		PlayerPawn        = 0,
		ObjectOfInterest  = 1,
		ObjectOfInterest2 = 2,
		MAX               = 3
	};

	/**
	 * Enum Athena.EAllPlayersStatShouldSendToOwner
	 */
	enum class EAllPlayersStatShouldSendToOwner : uint8_t
	{
		SendToOwner      = 0,
		DoNotSendToOwner = 1,
		MAX              = 2
	};

	/**
	 * Enum Athena.EAllPlayersStatEventTypes
	 */
	enum class EAllPlayersStatEventTypes : uint8_t
	{
		SendToAllPlayersWearingGhostCurseWithinRange    = 0,
		SendToAllPlayersWearingSkeletonCurseWithinRange = 1,
		MAX                                             = 2
	};

	/**
	 * Enum Athena.ECrewStatEventTypes
	 */
	enum class ECrewStatEventTypes : uint8_t
	{
		SendToWholeCrew                       = 0,
		OnlySendToPirateLegends               = 1,
		OnlySendToPlayersWearingGhostCurse    = 2,
		OnlySendToPlayersWearingSkeletonCurse = 3,
		MAX                                   = 4
	};

	/**
	 * Enum Athena.EStatEventsWasFiredFromConditionalStatsServiceState
	 */
	enum class EStatEventsWasFiredFromConditionalStatsServiceState : uint8_t
	{
		WasNotFired = 0,
		WasFired    = 1,
		MAX         = 2
	};

	/**
	 * Enum Athena.EPlayerStatsOperator
	 */
	enum class EPlayerStatsOperator : uint8_t
	{
		Sum     = 0,
		Replace = 1,
		Minimum = 2,
		Maximum = 3,
		MAX     = 4
	};

	/**
	 * Enum Athena.EPlayerStatsType
	 */
	enum class EPlayerStatsType : uint8_t
	{
		Int    = 0,
		Double = 1,
		MAX    = 2
	};

	/**
	 * Enum Athena.EShipLocation
	 */
	enum class EShipLocation : uint8_t
	{
		TOP_DECK                      = 0,
		MID_DECK                      = 1,
		BOTTOM_DECK                   = 2,
		HATCH_BACK_LEFT               = 3,
		HATCH_BACK_RIGHT              = 4,
		HATCH_FRONT_LEFT              = 5,
		HATCH_FRONT_RIGHT             = 6,
		CABIN_FRONT_DOOR              = 7,
		CABIN_SIDE_DOOR               = 8,
		TOP_DECK_BOW_PLANE            = 9,
		TOP_DECK_HATCH_PLANE          = 10,
		TOP_DECK_WHEEL_PLANE          = 11,
		MAP_DECK_FRONT_PLANE          = 12,
		MAP_DECK_TABLE_PLANE          = 13,
		MAP_DECK_REARSTAIRS_PLANE     = 14,
		BRIG_DECK_BRIG_PLANE          = 15,
		BRIG_DECK_STAIRS_PLANE        = 16,
		AITARGET_OFFSET_TO_EXTENTS    = 17,
		AITARGET_EXTENTS              = 18,
		AITARGET_ABOVE_DECK_OFFSET    = 19,
		AITARGET_ABOVE_DECK_EXTENTS   = 20,
		AITARGET_MID_DECK_OFFSET      = 21,
		AITARGET_MID_DECK_EXTENTS     = 22,
		AITARGET_LOWER_DECK_OFFSET    = 23,
		AITARGET_LOWER_DECK_EXTENTS   = 24,
		AI_KRAKEN_TENTACLE            = 25,
		CAPTAINS_TABLE_SPAWN_LOCATION = 26,
		MAX                           = 27
	};

	/**
	 * Enum Athena.EToggleOrHoldMode
	 */
	enum class EToggleOrHoldMode : uint8_t
	{
		Off    = 0,
		Hold   = 1,
		Toggle = 2,
		MAX    = 3
	};

	/**
	 * Enum Athena.EUseSingleStick
	 */
	enum class EUseSingleStick : uint8_t
	{
		Off        = 0,
		LeftStick  = 1,
		RightStick = 2,
		SwapSticks = 3,
		MAX        = 4
	};

	/**
	 * Enum Athena.ECameraLookatAnimationType
	 */
	enum class ECameraLookatAnimationType : uint8_t
	{
		Default  = 0,
		Wheel    = 1,
		Capstan  = 2,
		Sail     = 3,
		Tentacle = 4,
		Ladder   = 5,
		Sitting  = 6,
		MAX      = 7
	};

	/**
	 * Enum Athena.ELookAtRotationType
	 */
	enum class ELookAtRotationType : uint8_t
	{
		Rate = 0,
		Raw  = 1,
		MAX  = 2
	};

	/**
	 * Enum Athena.EEmoteSequenceType
	 */
	enum class EEmoteSequenceType : uint8_t
	{
		Continuous = 0,
		OneShot    = 1,
		MAX        = 2
	};

	/**
	 * Enum Athena.EWalletCurrencyId
	 */
	enum class EWalletCurrencyId : uint8_t
	{
		Undefined     = 0,
		Gold          = 1,
		WaywardTokens = 2,
		Premium       = 3,
		MAX           = 4
	};

	/**
	 * Enum Athena.EWalletBalanceRequestFailureReason
	 */
	enum class EWalletBalanceRequestFailureReason : uint8_t
	{
		ServiceUnavailable = 0,
		RequestTimeout     = 1,
		PendingRequest     = 2,
		RequestCancelled   = 3,
		MAX                = 4
	};

	/**
	 * Enum Athena.EWalletTransactionRequestFailureReason
	 */
	enum class EWalletTransactionRequestFailureReason : uint8_t
	{
		ServiceUnavailable        = 0,
		PendingRequest            = 1,
		RequestCancelled          = 2,
		InvalidPirateIdentity     = 3,
		InvalidTransactionRequest = 4,
		MAX                       = 5
	};

	/**
	 * Enum Athena.EStyleModifiers
	 */
	enum class EStyleModifiers : uint8_t
	{
		Hide       = 0,
		Emblem     = 1,
		Brig       = 2,
		Accessible = 3,
		MAX        = 4
	};

	/**
	 * Enum Athena.EPossessionsChestType
	 */
	enum class EPossessionsChestType : uint8_t
	{
		Unknown                        = 0,
		EquipmentChest                 = 1,
		ClothingChest                  = 2,
		VanityChest                    = 3,
		ArmoryChest                    = 4,
		ShipCustomizationChest         = 5,
		ShipFlagCustomizationChest     = 6,
		PetChest                       = 7,
		CaptainsShipCustomizationChest = 8,
		TrinketChest                   = 9,
		MAX                            = 10
	};

	/**
	 * Enum Athena.EChestEntitlementActionType
	 */
	enum class EChestEntitlementActionType : uint8_t
	{
		Equip       = 0,
		Unequip     = 1,
		Clear       = 2,
		Randomise   = 3,
		RadialEquip = 4,
		MAX         = 5
	};

	/**
	 * Enum Athena.EMenuNavigationAction
	 */
	enum class EMenuNavigationAction : uint8_t
	{
		EscapeMenu        = 0,
		QuickMenu         = 1,
		VoteToScuttleShip = 2,
		Unsupported       = 3,
		MAX               = 4
	};

	/**
	 * Enum Athena.EShopOfferAvailability
	 */
	enum class EShopOfferAvailability : uint8_t
	{
		Available    = 0,
		AlreadyOwned = 1,
		Locked       = 2,
		Info         = 3,
		Hide         = 4,
		MAX          = 5
	};

	/**
	 * Enum Athena.EShopType
	 */
	enum class EShopType : uint8_t
	{
		Invalid                = 0,
		ShipWright_Liveries    = 1,
		ShipWright_Decorations = 2,
		ShipWright_Trinkets    = 3,
		MAX                    = 4,
		MAX01                  = 5
	};

	/**
	 * Enum Athena.EMultiShopType
	 */
	enum class EMultiShopType : uint8_t
	{
		Invalid    = 0,
		ShipWright = 1,
		MAX        = 2,
		MAX01      = 3
	};

	/**
	 * Enum Athena.EPreventDamageTypeLockReasons
	 */
	enum class EPreventDamageTypeLockReasons : uint8_t
	{
		IsFiredOutOfACannon = 0,
		AIStrategy          = 1,
		Form                = 2,
		IsHiddenInObject    = 3,
		ExternalController  = 4,
		MAX                 = 5
	};

	/**
	 * Enum Athena.ERegenerationState
	 */
	enum class ERegenerationState : uint8_t
	{
		Regenerating = 0,
		Stopped      = 1,
		Paused       = 2,
		MAX          = 3
	};

	/**
	 * Enum Athena.ETeleportActionStateStage
	 */
	enum class ETeleportActionStateStage : uint8_t
	{
		Uninitialised                            = 0,
		Started                                  = 1,
		CharacterFadeCompleteCondition           = 2,
		PreTeleport                              = 3,
		CrewShipSpawnedIfPlayerIsInBrigCondition = 4,
		TeleportCompleteCondition                = 5,
		AsyncLoadCompleteCondition               = 6,
		ActorsRelevantSpawnCondition             = 7,
		PlayerCreatedOnClientSpawnCondition      = 8,
		PlayerLoadoutReceivedSpawnCondition      = 9,
		PlayerEntitlementReceivedSpawnCondition  = 10,
		ClientConditionsCompleteCondition        = 11,
		CharacterReadyForContestRespawnCondition = 12,
		PostTeleport                             = 13,
		Ended                                    = 14,
		MAX                                      = 15
	};

	/**
	 * Enum Athena.ETeleportActionStateReason
	 */
	enum class ETeleportActionStateReason : uint8_t
	{
		Uninitialised                               = 0,
		Test                                        = 1,
		Cheat                                       = 2,
		LeaveConcealingObject                       = 3,
		TeleportPlayerToSafety                      = 4,
		SinkingShip                                 = 5,
		Mermaid                                     = 6,
		RespawnStatue                               = 7,
		ReturnToShip                                = 8,
		PanicTeleport_FoundAssociatedLocation       = 9,
		PanicTeleport_NotFoundAssociatedLocation    = 10,
		PanicTeleport_NoAssociatedLocationsProvided = 11,
		TeleportTriggerObject                       = 12,
		SentToBrig                                  = 13,
		HideOutEntered                              = 14,
		HideOutLeftToSpecificExitPoint              = 15,
		HideOutLeftWithNoExitPoint                  = 16,
		ContestTeleportPlayerToShipOnRestart        = 17,
		DebugTeleportCrewStep                       = 18,
		EnterTunnelOfTheDamned                      = 19,
		ExitTunnelOfTheDamned                       = 20,
		SpawnPlayer                                 = 21,
		SpawnGhost                                  = 22,
		TeleportPlayerFromSafeZone                  = 23,
		TaleProgressStatue                          = 24,
		MAX                                         = 25
	};

	/**
	 * Enum Athena.ETeleportTransformSpace
	 */
	enum class ETeleportTransformSpace : uint8_t
	{
		World          = 0,
		RelativeToBase = 1,
		MAX            = 2
	};

	/**
	 * Enum Athena.ETeleportActionStateConditions
	 */
	enum class ETeleportActionStateConditions : uint8_t
	{
		AllConditions = 0,
		NoConditions  = 1,
		MAX           = 2
	};

	/**
	 * Enum Athena.ETeleportActionStateFadeType
	 */
	enum class ETeleportActionStateFadeType : uint8_t
	{
		Fade        = 0,
		FadeEndOnly = 1,
		NoFade      = 2,
		MAX         = 3
	};

	/**
	 * Enum Athena.EAttitudeTowardActor
	 */
	enum class EAttitudeTowardActor : uint8_t
	{
		Friendly = 0,
		Neutral  = 1,
		Hostile  = 2,
		Alliance = 3,
		MAX      = 4
	};

	/**
	 * Enum Athena.ECharacterType
	 */
	enum class ECharacterType : uint8_t
	{
		Ghost     = 0,
		Character = 1,
		MAX       = 2
	};

	/**
	 * Enum Athena.ETeleportNotificationSource
	 */
	enum class ETeleportNotificationSource : uint8_t
	{
		TeleportState       = 0,
		WaitingToSpawnState = 1,
		MAX                 = 2
	};

	/**
	 * Enum Athena.ETrackedActorType
	 */
	enum class ETrackedActorType : uint8_t
	{
		Unknown                    = 0,
		AI_Fauna                   = 1,
		AI_GhostShip_Captain       = 2,
		AI_GhostShip_MiniBoss      = 3,
		AI_GhostShip_Grunt         = 4,
		AI_Kraken                  = 5,
		AI_Megalodon               = 6,
		AI_OceanCrawler_Crab       = 7,
		AI_OceanCrawler_Eel        = 8,
		AI_OceanCrawler_Hermit     = 9,
		AI_Pets                    = 10,
		AI_Pets_Wielded            = 11,
		AI_Phantom                 = 12,
		AI_Siren                   = 13,
		AI_Shark                   = 14,
		AI_Ship_Aggressive_Large   = 15,
		AI_Ship_Aggressive_Small   = 16,
		AI_Ship_Battle_Large       = 17,
		AI_Ship_Battle_Small       = 18,
		AI_Ship_Passive_Large      = 19,
		AI_Ship_Passive_Small      = 20,
		AI_Skeleton                = 21,
		AI_SwimmingCreature        = 22,
		AshenLordCloud             = 23,
		BarrelsOfPlenty            = 24,
		Booty                      = 25,
		Booty_AshenWindsSkull      = 26,
		Booty_ReapersChest         = 27,
		BuoyantActor               = 28,
		BurnedFragment             = 29,
		Consumable                 = 30,
		Earthquake                 = 31,
		FireworkExplosion          = 32,
		FireworkProjectile         = 33,
		FishingFish                = 34,
		FogBank                    = 35,
		Geyser                     = 36,
		Ghostship_Flameheart_Cloud = 37,
		Haunted_Fort               = 38,
		Mermaid                    = 39,
		MessageInABottle           = 40,
		NPC                        = 41,
		Player                     = 42,
		Pouch_Ammo                 = 43,
		Pouch_Doubloons            = 44,
		Pouch_Gold                 = 45,
		Rowboat                    = 46,
		Rowboat_Cannon             = 47,
		Rowboat_Harpoon            = 48,
		Ship_Large                 = 49,
		Ship_Medium                = 50,
		Ship_Small                 = 51,
		ShipCloud                  = 52,
		Shipwreck                  = 53,
		Shipwreck_Graveyard        = 54,
		ShortRangeMarker           = 55,
		SkeletonThrone             = 56,
		SkullCloud                 = 57,
		Spire                      = 58,
		StatueThreat               = 59,
		StorageContainer           = 60,
		StorageContainerBuoyant    = 61,
		Storm                      = 62,
		SuperHeatedWater           = 63,
		Volcano                    = 64,
		WreckDebris_Land           = 65,
		WreckDebris_Sea            = 66,
		MAX                        = 67,
		MAX01                      = 68
	};

	/**
	 * Enum Athena.ETrackedOwnerType
	 */
	enum class ETrackedOwnerType : uint8_t
	{
		Unknown               = 0,
		Consumable            = 1,
		Booty                 = 2,
		Booty_ReapersChest    = 3,
		Booty_AshenWindsSkull = 4,
		BarrelsOfPlenty       = 5,
		WreckDebris_Land      = 6,
		WreckDebris_Sea       = 7,
		BurnedFragment        = 8,
		MAX                   = 9
	};

	/**
	 * Enum Athena.EVfxCustomLocalSpaceMode
	 */
	enum class EVfxCustomLocalSpaceMode : uint8_t
	{
		Default             = 0,
		ShipSpaceAutoLocal  = 1,
		ShipSpaceAutoPlayer = 2,
		ShipSpaceAutoWorld  = 3,
		MAX                 = 4
	};

	/**
	 * Enum Athena.EVfxRegion
	 */
	enum class EVfxRegion : uint8_t
	{
		None         = 0,
		ShipExterior = 1,
		ShipInterior = 2,
		MAX          = 3
	};

	/**
	 * Enum Athena.EVfxUnderwaterUsage
	 */
	enum class EVfxUnderwaterUsage : uint8_t
	{
		AboveWater = 0,
		UnderWater = 1,
		Both       = 2,
		MAX        = 3
	};

	/**
	 * Enum Athena.EShipAlignmentType
	 */
	enum class EShipAlignmentType : uint8_t
	{
		None                = 0,
		AlignedToShip       = 1,
		AlignedToShipXYOnly = 2,
		MAX                 = 3
	};

	/**
	 * Enum Athena.EShipState
	 */
	enum class EShipState : uint8_t
	{
		PlainSailing             = 0,
		GrindingToHalt           = 1,
		Lowering                 = 2,
		ReduceWaterOcclusionZone = 3,
		KeelingOver              = 4,
		KeeledOver               = 5,
		FinalSinking             = 6,
		Dead                     = 7,
		MAX                      = 8
	};

	/**
	 * Enum Athena.EBowSplashTickReturnType
	 */
	enum class EBowSplashTickReturnType : uint8_t
	{
		NoEffectsPlayed = 0,
		SFXOnly         = 1,
		SFXAndVFX       = 2,
		MAX             = 3
	};

	/**
	 * Enum Athena.EShipAnnouncementAlignment
	 */
	enum class EShipAnnouncementAlignment : uint8_t
	{
		None        = 0,
		Emissary    = 1,
		TheFeared   = 2,
		GoldSeeker  = 3,
		Hunter      = 4,
		TheIllFated = 5,
		Rogue       = 6,
		Voyager     = 7,
		Protector   = 8,
		Servant     = 9,
		MAX         = 10
	};

	/**
	 * Enum Athena.EShipPartCustomizationState
	 */
	enum class EShipPartCustomizationState : uint8_t
	{
		Idle             = 0,
		SearchingForPart = 1,
		CustomizingPart  = 2,
		RegisteringPart  = 3,
		MAX              = 4
	};

	/**
	 * Enum Athena.EShipDynamicsAnchoredState
	 */
	enum class EShipDynamicsAnchoredState : uint8_t
	{
		Unknown = 0,
		Raised  = 1,
		Lowered = 2,
		MAX     = 3
	};

	/**
	 * Enum Athena.EAllianceNotificationType
	 */
	enum class EAllianceNotificationType : uint8_t
	{
		Joined          = 0,
		Formed          = 1,
		Left            = 2,
		Disbanded       = 3,
		OtherCrewJoined = 4,
		OtherCrewLeft   = 5,
		MAX             = 6
	};

	/**
	 * Enum Athena.EAllianceJoinStatus
	 */
	enum class EAllianceJoinStatus : uint8_t
	{
		CannotJoinAlliance = 0,
		CanJoinAlliance    = 1,
		IsInAlliance       = 2,
		MAX                = 3
	};

	/**
	 * Enum Athena.ELoadableState
	 */
	enum class ELoadableState : uint8_t
	{
		Unloaded  = 0,
		Unloading = 1,
		Loading   = 2,
		Loaded    = 3,
		MAX       = 4
	};

	/**
	 * Enum Athena.ECharacterDeathType
	 */
	enum class ECharacterDeathType : uint8_t
	{
		Invalid                                          = 0,
		Killed                                           = 1,
		Despawn                                          = 2,
		OwnershipRemoved                                 = 3,
		NoGameStatePresentDuringPostInitializeComponents = 4,
		MAX                                              = 5
	};

	/**
	 * Enum Athena.EPlayerActivityType
	 */
	enum class EPlayerActivityType : uint8_t
	{
		None              = 0,
		Bailing           = 1,
		Cannon            = 2,
		Cannon_END        = 3,
		Capstan           = 4,
		Capstan_END       = 5,
		CarryingBooty     = 6,
		CarryingBooty_END = 7,
		Dead              = 8,
		Dead_END          = 9,
		Digging           = 10,
		Dousing           = 11,
		EmptyingBucket    = 12,
		Harpoon           = 13,
		Harpoon_END       = 14,
		LoseHealth        = 15,
		Repairing         = 16,
		Sails             = 17,
		Sails_END         = 18,
		UndoingRepair     = 19,
		Wheel             = 20,
		Wheel_END         = 21,
		MAX               = 22,
		MAX01             = 23
	};

	/**
	 * Enum Athena.ERadialMenuInputModality
	 */
	enum class ERadialMenuInputModality : uint8_t
	{
		None     = 0,
		Keyboard = 1,
		Gamepad  = 2,
		MAX      = 3
	};

	/**
	 * Enum Athena.ERadialInventoryType
	 */
	enum class ERadialInventoryType : uint8_t
	{
		None    = 0,
		Item    = 1,
		Map     = 2,
		Phrases = 3,
		Emotes  = 4,
		MAX     = 5
	};

	/**
	 * Enum Athena.EDockableSocketOverlapUpdates
	 */
	enum class EDockableSocketOverlapUpdates : uint8_t
	{
		AllowUpdate = 0,
		BlockUpdate = 1,
		MAX         = 2
	};

	/**
	 * Enum Athena.EActionDisplayPriority
	 */
	enum class EActionDisplayPriority : uint8_t
	{
		Primary   = 0,
		Secondary = 1,
		Tertiary  = 2,
		Total     = 3,
		MAX       = 4
	};

	/**
	 * Enum Athena.EInteractableState
	 */
	enum class EInteractableState : uint8_t
	{
		Interactable         = 0,
		DisableDescribe      = 1,
		DisabledDontDescribe = 2,
		MAX                  = 3
	};

	/**
	 * Enum Athena.ETooltipHighlightType
	 */
	enum class ETooltipHighlightType : uint8_t
	{
		Active    = 0,
		GreyedOut = 1,
		None      = 2,
		MAX       = 3
	};

	/**
	 * Enum Athena.ETooltipSpinnerType
	 */
	enum class ETooltipSpinnerType : uint8_t
	{
		None     = 0,
		Progress = 1,
		MAX      = 2
	};

	/**
	 * Enum Athena.EItemUseSpeed
	 */
	enum class EItemUseSpeed : uint8_t
	{
		Default  = 0,
		Custom   = 1,
		Custom01 = 2,
		MAX      = 3
	};

	/**
	 * Enum Athena.EMaxMoveSpeedScalarReason
	 */
	enum class EMaxMoveSpeedScalarReason : uint8_t
	{
		Digging       = 0,
		Limping       = 1,
		UsingItem     = 2,
		Stunned       = 3,
		MeleeBlocking = 4,
		Testing       = 5,
		Environment   = 6,
		NumReasons    = 7,
		MAX           = 8
	};

	/**
	 * Enum Athena.EWieldableItemAnimVariant
	 */
	enum class EWieldableItemAnimVariant : uint8_t
	{
		Default  = 0,
		Variant1 = 1,
		Variant2 = 2,
		Variant3 = 3,
		Variant4 = 4,
		MAX      = 5,
		MAX01    = 6
	};

	/**
	 * Enum Athena.EWieldableItemBlockingAnimState
	 */
	enum class EWieldableItemBlockingAnimState : uint8_t
	{
		Main     = 0,
		Feedback = 1,
		MAX      = 2
	};

	/**
	 * Enum Athena.EWieldableItemComplexOneShotLookUpType
	 */
	enum class EWieldableItemComplexOneShotLookUpType : uint8_t
	{
		Combo   = 0,
		Heavy   = 1,
		Special = 2,
		MAX     = 3
	};

	/**
	 * Enum Athena.EWieldableItemComplexOneShotAnimType
	 */
	enum class EWieldableItemComplexOneShotAnimType : uint8_t
	{
		MeleeComboAttack = 0,
		MeleeHeavyAttack = 1,
		MAX              = 2
	};

	/**
	 * Enum Athena.EWieldableItemSize
	 */
	enum class EWieldableItemSize : uint8_t
	{
		Small = 0,
		Large = 1,
		MAX   = 2
	};

	/**
	 * Enum Athena.EWieldableItemVisibilityReason
	 */
	enum class EWieldableItemVisibilityReason : uint8_t
	{
		Animation     = 0,
		Interpolation = 1,
		BlocksView    = 2,
		MAX           = 3
	};

	/**
	 * Enum Athena.EItemType
	 */
	enum class EItemType : uint8_t
	{
		Weapon  = 0,
		Item    = 1,
		Quest   = 2,
		Invalid = 3,
		MAX     = 4
	};

	/**
	 * Enum Athena.EWieldItemReturnCode
	 */
	enum class EWieldItemReturnCode : uint8_t
	{
		Success           = 0,
		NoAuthority       = 1,
		UnableToDisplace  = 2,
		InvalidItem       = 3,
		WaitingForUnstash = 4,
		MAX               = 5
	};

	/**
	 * Enum Athena.EDropItemReturnCode
	 */
	enum class EDropItemReturnCode : uint8_t
	{
		NothingToDrop      = 0,
		Success            = 1,
		DroppingProhibited = 2,
		MAX                = 3
	};

	/**
	 * Enum Athena.EStowMethod
	 */
	enum class EStowMethod : uint8_t
	{
		Unequip = 0,
		Stash   = 1,
		MAX     = 2
	};

	/**
	 * Enum Athena.EStashReason
	 */
	enum class EStashReason : uint8_t
	{
		Locomotion     = 0,
		Jumping        = 1,
		Docking        = 2,
		Sprinting      = 3,
		Using          = 4,
		Dead           = 5,
		SpawnOrDespawn = 6,
		AIPartsChange  = 7,
		Emote          = 8,
		MAX            = 9
	};

	/**
	 * Enum Athena.ECanAddItemQueryResult
	 */
	enum class ECanAddItemQueryResult : uint8_t
	{
		Success  = 0,
		SlotFull = 1,
		Invalid  = 2,
		MAX      = 3
	};

	/**
	 * Enum Athena.EItemActionState
	 */
	enum class EItemActionState : uint8_t
	{
		Idle       = 0,
		Starting   = 1,
		Performing = 2,
		Stopping   = 3,
		Cooldown   = 4,
		Resetting  = 5,
		MAX        = 6
	};

	/**
	 * Enum Athena.EItemActionType
	 */
	enum class EItemActionType : uint8_t
	{
		OneShot    = 0,
		WindUp     = 1,
		Continuous = 2,
		MAX        = 3
	};

	/**
	 * Enum Athena.EItemUseStoppedReason
	 */
	enum class EItemUseStoppedReason : uint8_t
	{
		Stopped     = 0,
		Interrupted = 1,
		MAX         = 2
	};

	/**
	 * Enum Athena.EPerspectiveTypes
	 */
	enum class EPerspectiveTypes : uint8_t
	{
		FirstPerson = 0,
		ThirdPerson = 1,
		MAX         = 2
	};

	/**
	 * Enum Athena.EItemLifetimeManagement
	 */
	enum class EItemLifetimeManagement : uint8_t
	{
		Automatic = 0,
		Manual    = 1,
		MAX       = 2
	};

	/**
	 * Enum Athena.EItemRepresentation
	 */
	enum class EItemRepresentation : uint8_t
	{
		None       = 0,
		Wielded    = 1,
		WorldProxy = 2,
		MAX        = 3
	};

	/**
	 * Enum Athena.EDoubleActionItemPriority
	 */
	enum class EDoubleActionItemPriority : uint8_t
	{
		None      = 0,
		Primary   = 1,
		Secondary = 2,
		MAX       = 3
	};

	/**
	 * Enum Athena.EContinuousUseID
	 */
	enum class EContinuousUseID : uint8_t
	{
		In  = 0,
		Out = 1,
		MAX = 2
	};

	/**
	 * Enum Athena.EContinuousUseOverride
	 */
	enum class EContinuousUseOverride : uint8_t
	{
		None           = 0,
		ForcePrimary   = 1,
		ForceSecondary = 2,
		MAX            = 3
	};

	/**
	 * Enum Athena.EItemPassiveState
	 */
	enum class EItemPassiveState : uint8_t
	{
		Idle       = 0,
		Locomotion = 1,
		Jumping    = 2,
		Turning    = 3,
		Swimming   = 4,
		MAX        = 5
	};

	/**
	 * Enum Athena.EActionRelevancy
	 */
	enum class EActionRelevancy : uint8_t
	{
		Primary      = 0,
		PrimaryAlt   = 1,
		Secondary    = 2,
		SecondaryAlt = 3,
		MAX          = 4
	};

	/**
	 * Enum Athena.EBlendedFadeState
	 */
	enum class EBlendedFadeState : uint8_t
	{
		FadingIn  = 0,
		FadingOut = 1,
		Active    = 2,
		Idle      = 3,
		MAX       = 4
	};

	/**
	 * Enum Athena.EShelterUpdateOption
	 */
	enum class EShelterUpdateOption : uint8_t
	{
		Never           = 0,
		OnStartUp       = 1,
		WithinRainZones = 2,
		Always          = 3,
		MAX             = 4
	};

	/**
	 * Enum Athena.ESubmergedState
	 */
	enum class ESubmergedState : uint8_t
	{
		Surfaced           = 0,
		PartiallySubmerged = 1,
		FullySubmerged     = 2,
		MAX                = 3
	};

	/**
	 * Enum Athena.EControllableObjectType
	 */
	enum class EControllableObjectType : uint8_t
	{
		None              = 0,
		Wheel             = 1,
		CapstanArm        = 2,
		Pulley            = 3,
		SailHoist         = 4,
		SailAngle         = 5,
		Cannon            = 6,
		MapTable          = 7,
		KeyedInstrument   = 8,
		Tentacle          = 9,
		Ladder            = 10,
		SkeletonShipWheel = 11,
		Oars              = 12,
		RowboatSeat       = 13,
		Seat              = 14,
		Bed               = 15,
		HarpoonLauncher   = 16,
		WaterPump         = 17,
		WaterSlide        = 18,
		Book              = 19,
		MAX               = 20
	};

	/**
	 * Enum Athena.ELadderType
	 */
	enum class ELadderType : uint8_t
	{
		Generic       = 0,
		BoatSide      = 1,
		BoatCrowsnest = 2,
		ClamberSpot   = 3,
		MAX           = 4
	};

	/**
	 * Enum Athena.ELadderTransitionMode
	 */
	enum class ELadderTransitionMode : uint8_t
	{
		OnTop     = 0,
		OffTop    = 1,
		OnBottom  = 2,
		OffBottom = 3,
		Max       = 4,
		MAX       = 5
	};

	/**
	 * Enum Athena.EMeleeWeaponMovementSpeed
	 */
	enum class EMeleeWeaponMovementSpeed : uint8_t
	{
		Default        = 0,
		SlightlySlowed = 1,
		Slowed         = 2,
		MAX            = 3
	};

	/**
	 * Enum Athena.EMeleeAttackInterruptReason
	 */
	enum class EMeleeAttackInterruptReason : uint8_t
	{
		Stopping = 0,
		Comboing = 1,
		MAX      = 2
	};

	/**
	 * Enum Athena.EMeleeWeaponAttackType
	 */
	enum class EMeleeWeaponAttackType : uint8_t
	{
		Combo   = 0,
		Heavy   = 1,
		Special = 2,
		MAX     = 3
	};

	/**
	 * Enum Athena.ESpawnedItemSource
	 */
	enum class ESpawnedItemSource : uint8_t
	{
		None                = 0,
		Quest               = 1,
		Shipwreck           = 2,
		FloatingAtSea       = 3,
		Island              = 4,
		SkellyFort          = 5,
		AIShip              = 6,
		Megalodon           = 7,
		KrakenTentacle      = 8,
		SunkenCurseArtefact = 9,
		EmergentCaptain     = 10,
		PlayerShip          = 11,
		AggressiveGhostShip = 12,
		Siren               = 13,
		SunkenKingdom       = 14,
		BuriedByPlayer      = 15,
		OceanCrawlers       = 16,
		MAX                 = 17
	};

	/**
	 * Enum Athena.EAmmoEffectState
	 */
	enum class EAmmoEffectState : uint8_t
	{
		Idle       = 0,
		Processing = 1,
		Stopped    = 2,
		MAX        = 3
	};

	/**
	 * Enum Athena.ETreasureMapVerticalAlignment
	 */
	enum class ETreasureMapVerticalAlignment : uint8_t
	{
		Top    = 0,
		Centre = 1,
		MAX    = 2
	};

	/**
	 * Enum Athena.ETreasureMapHorizontalAlignment
	 */
	enum class ETreasureMapHorizontalAlignment : uint8_t
	{
		Left   = 0,
		Centre = 1,
		Right  = 2,
		MAX    = 3
	};

	/**
	 * Enum Athena.ECompassDirections
	 */
	enum class ECompassDirections : uint8_t
	{
		North            = 0,
		NorthByNorthEast = 1,
		NorthEast        = 2,
		EastByNorthEast  = 3,
		East             = 4,
		EastBySouthEast  = 5,
		SouthEast        = 6,
		SouthBySouthEast = 7,
		South            = 8,
		SouthBySouthWest = 9,
		SouthWest        = 10,
		WestBySouthWest  = 11,
		West             = 12,
		WestByNorthWest  = 13,
		NorthWest        = 14,
		NorthByNorthWest = 15,
		NumDirections    = 16,
		MAX              = 17
	};

	/**
	 * Enum Athena.EDefenderLootLevel
	 */
	enum class EDefenderLootLevel : uint8_t
	{
		NotDefended = 0,
		NoLoot      = 1,
		Low         = 2,
		Medium      = 3,
		High        = 4,
		MAX         = 5
	};

	/**
	 * Enum Athena.ERewardType
	 */
	enum class ERewardType : uint8_t
	{
		XP              = 0,
		Gold            = 1,
		Entitlement     = 2,
		WaywardTokens   = 3,
		Level           = 4,
		Emblem          = 5,
		Achievement     = 6,
		PremiumCurrency = 7,
		SeasonXP        = 8,
		Null            = 9,
		MAX             = 10
	};

	/**
	 * Enum Athena.ERewardRequestFailureReason
	 */
	enum class ERewardRequestFailureReason : uint8_t
	{
		FailedToProcess = 0,
		TimedOut        = 1,
		Unknown         = 2,
		MAX             = 3
	};

	/**
	 * Enum Athena.ERewardDestinationType
	 */
	enum class ERewardDestinationType : uint8_t
	{
		Player   = 0,
		Crew     = 1,
		Alliance = 2,
		MAX      = 3
	};

	/**
	 * Enum Athena.EQuestMapIcon
	 */
	enum class EQuestMapIcon : uint8_t
	{
		Unknown               = 0,
		XMarksTheSpot         = 1,
		Riddle                = 2,
		Bounty                = 3,
		Merchant              = 4,
		MessageInABottle      = 5,
		CargoRun              = 6,
		SkeletonOrder         = 7,
		Emissary              = 8,
		Wayfinder             = 9,
		MerchantClue          = 10,
		Fishing               = 11,
		TreasureBuriedByYou   = 12,
		TreasureBuriedByOther = 13,
		Checklist             = 14,
		MAX                   = 15
	};

	/**
	 * Enum Athena.EQuestType
	 */
	enum class EQuestType : uint8_t
	{
		Unknown        = 0,
		XMarksTheSpot  = 1,
		Riddle         = 2,
		Bounty         = 3,
		Merchant       = 4,
		CargoRun       = 5,
		Tale           = 6,
		Matchmake      = 7,
		EmergantVoyage = 8,
		Reward         = 9,
		Staging        = 10,
		MAX            = 11
	};

	/**
	 * Enum Athena.EShowVoyageBannersState
	 */
	enum class EShowVoyageBannersState : uint8_t
	{
		Show     = 0,
		DontShow = 1,
		MAX      = 2
	};

	/**
	 * Enum Athena.EEmergentVoyageSource
	 */
	enum class EEmergentVoyageSource : uint8_t
	{
		Unknown               = 0,
		MessageInABottle      = 1,
		SkeletonOrder         = 2,
		Emissary              = 3,
		CoralMessageInABottle = 4,
		MAX                   = 5
	};

	/**
	 * Enum Athena.EQuestStatus
	 */
	enum class EQuestStatus : uint8_t
	{
		Pending    = 0,
		Starting   = 1,
		InProgress = 2,
		Complete   = 3,
		MAX        = 4
	};

	/**
	 * Enum Athena.EVoyageChangeReason
	 */
	enum class EVoyageChangeReason : uint8_t
	{
		Unknown              = 0,
		PreviousWasCompleted = 1,
		PreviousWasCancelled = 2,
		MAX                  = 3
	};

	/**
	 * Enum Athena.EQuestResultFromDig
	 */
	enum class EQuestResultFromDig : uint8_t
	{
		None      = 0,
		Chest     = 1,
		QuestItem = 2,
		MAX       = 3
	};

	/**
	 * Enum Athena.EVoyageJoinStatus
	 */
	enum class EVoyageJoinStatus : uint8_t
	{
		Other          = 0,
		Start          = 1,
		JoinInProgress = 2,
		MAX            = 3
	};

	/**
	 * Enum Athena.EVoyageLeaveStatus
	 */
	enum class EVoyageLeaveStatus : uint8_t
	{
		Other          = 0,
		Completed      = 1,
		Cancelled      = 2,
		QuitInProgress = 3,
		Migrated       = 4,
		MAX            = 5
	};

	/**
	 * Enum Athena.EVoyageChapterProgressionType
	 */
	enum class EVoyageChapterProgressionType : uint8_t
	{
		DrivenByAnyQuestCompletion      = 0,
		DrivenBySpecificQuestCompletion = 1,
		MAX                             = 2
	};

	/**
	 * Enum Athena.EQuestDistributionMethod
	 */
	enum class EQuestDistributionMethod : uint8_t
	{
		AllAtOnce     = 0,
		PerChapter    = 1,
		FixedChapters = 2,
		MAX           = 3
	};

	/**
	 * Enum Athena.EQuestLocationSelectionMethod
	 */
	enum class EQuestLocationSelectionMethod : uint8_t
	{
		NoRepetitionWithinVoyage           = 0,
		NoRepetitionWithinAdjacentChapters = 1,
		AllIslandsAvailable                = 2,
		MAX                                = 3
	};

	/**
	 * Enum Athena.EQuestPoolSelectionMethod
	 */
	enum class EQuestPoolSelectionMethod : uint8_t
	{
		Sequential = 0,
		Random     = 1,
		MAX        = 2
	};

	/**
	 * Enum Athena.ERiddleActions
	 */
	enum class ERiddleActions : uint8_t
	{
		RaiseLanternAnyone      = 0,
		PlayAnyInstrumentAnyone = 1,
		Dig                     = 2,
		LookAtMap               = 3,
		NumActions              = 4,
		MAX                     = 5
	};

	/**
	 * Enum Athena.ELandmarkUniqueness
	 */
	enum class ELandmarkUniqueness : uint8_t
	{
		Unique    = 0,
		NonUnique = 1,
		MAX       = 2
	};

	/**
	 * Enum Athena.ELandmarkVagueness
	 */
	enum class ELandmarkVagueness : uint8_t
	{
		Vague    = 0,
		NonVague = 1,
		MAX      = 2
	};

	/**
	 * Enum Athena.EEventRunLocation
	 */
	enum class EEventRunLocation : uint8_t
	{
		Client          = 0,
		Server          = 1,
		ClientAndServer = 2,
		MAX             = 3
	};

	/**
	 * Enum Athena.EItemLoadoutDestroyBehaviour
	 */
	enum class EItemLoadoutDestroyBehaviour : uint8_t
	{
		DoNotDestroy = 0,
		Destroy      = 1,
		MAX          = 2
	};

	/**
	 * Enum Athena.EEncounterListenerType
	 */
	enum class EEncounterListenerType : uint8_t
	{
		None   = 0,
		Ship   = 1,
		Player = 2,
		Count  = 3,
		MAX    = 4
	};

	/**
	 * Enum Athena.EEncounterMobility
	 */
	enum class EEncounterMobility : uint8_t
	{
		Static = 0,
		Mobile = 1,
		MAX    = 2
	};

	/**
	 * Enum Athena.EEncounterDimensions
	 */
	enum class EEncounterDimensions : uint8_t
	{
		ThreeDimensions = 0,
		TwoDimensions   = 1,
		MAX             = 2
	};

	/**
	 * Enum Athena.EEncounterType
	 */
	enum class EEncounterType : uint8_t
	{
		None                                 = 0,
		Storm                                = 1,
		BarrelsOfPlenty                      = 2,
		ShipSighting                         = 3,
		ShipEncounter                        = 4,
		ShipwreckEventSighting               = 5,
		ShipwreckEventEncounter              = 6,
		ShipwreckAmbientSighting             = 7,
		ShipwreckAmbientEncounter            = 8,
		SkellyFortSighting                   = 9,
		SkellyFortEncounter                  = 10,
		SkellyFortLegendaryFortSighting      = 11,
		SkellyFortLegendaryFortEncounter     = 12,
		KrakenSighting                       = 13,
		KrakenEncounter                      = 14,
		TinySharkSighting                    = 15,
		TinySharkEncounter                   = 16,
		AIShipSighting                       = 17,
		AIShipEncounter                      = 18,
		FogBank                              = 19,
		BoxOfSecrets                         = 20,
		ReapersChest                         = 21,
		EmergentCaptain                      = 22,
		AncientSkelly                        = 23,
		AshenLordSighting                    = 24,
		AshenLordEncounter                   = 25,
		AggressiveGhostShipsAmbientSighting  = 26,
		AggressiveGhostShipsAmbientEncounter = 27,
		AggressiveGhostShipsEventSighting    = 28,
		AggressiveGhostShipsEventEncounter   = 29,
		SunkenKingdomTreasurySighting        = 30,
		SunkenKingdomTreasuryEncounter       = 31,
		SeaFortSighting                      = 32,
		SeaFortEncounter                     = 33,
		Count                                = 34,
		MAX                                  = 35
	};

	/**
	 * Enum Athena.ENPCDisplayNameType
	 */
	enum class ENPCDisplayNameType : uint8_t
	{
		NPCAndIsland = 0,
		NPCOnly      = 1,
		IslandOnly   = 2,
		MAX          = 3
	};

	/**
	 * Enum Athena.ENPCChatType
	 */
	enum class ENPCChatType : uint8_t
	{
		Chat      = 0,
		Subtitles = 1,
		MAX       = 2
	};

	/**
	 * Enum Athena.EReapersMarkTrackedBootyItemType
	 */
	enum class EReapersMarkTrackedBootyItemType : uint8_t
	{
		None                 = 0,
		GenericBooty         = 1,
		FOTDKey              = 2,
		ReapersBounty        = 3,
		DoubloonReapersChest = 4,
		LegendaryFortKey     = 5,
		MAX                  = 6
	};

	/**
	 * Enum Athena.EReapersMarkTrackedVoyageType
	 */
	enum class EReapersMarkTrackedVoyageType : uint8_t
	{
		None              = 0,
		NonAllianceVoyage = 1,
		AllianceVoyage    = 2,
		MAX               = 3
	};

	/**
	 * Enum Athena.EIslandTextureSourceType
	 */
	enum class EIslandTextureSourceType : uint8_t
	{
		TreasureMap = 0,
		WorldMap    = 1,
		MAX         = 2
	};

	/**
	 * Enum Athena.EWorldMapShipType
	 */
	enum class EWorldMapShipType : uint8_t
	{
		None                 = 0,
		IsInAlliance         = 1,
		IsOwnedShip          = 2,
		IsContestShip        = 3,
		IsReapersTrackedShip = 4,
		IsInTunnel           = 5,
		IsInFaction          = 6,
		IsFactionMaxRank     = 7,
		IsInvadingShip       = 8,
		MAX                  = 9
	};

	/**
	 * Enum Athena.ERiddleActionLocationOffsets
	 */
	enum class ERiddleActionLocationOffsets : uint8_t
	{
		PerformActionAtLocation                           = 0,
		PerformActionAtCompassDirectionOffsetFromLocation = 1,
		MAX                                               = 2
	};

	/**
	 * Enum Athena.ERiddleLocations
	 */
	enum class ERiddleLocations : uint8_t
	{
		NotOnIsland               = 0,
		UniqueNonVagueLandmark    = 1,
		UniqueVagueLandmark       = 2,
		NonUniqueNonVagueLandmark = 3,
		Island                    = 4,
		MAX                       = 5
	};

	/**
	 * Enum Athena.EFeedableType
	 */
	enum class EFeedableType : uint8_t
	{
		None  = 0,
		Meat  = 1,
		Fruit = 2,
		Bait  = 3,
		MAX   = 4
	};

	/**
	 * Enum Athena.EFaunaAnimationSnakeAttackDirection
	 */
	enum class EFaunaAnimationSnakeAttackDirection : uint8_t
	{
		Forwards  = 0,
		Backwards = 1,
		MAX       = 2
	};

	/**
	 * Enum Athena.EFaunaAnimationStartledLevel
	 */
	enum class EFaunaAnimationStartledLevel : uint8_t
	{
		None = 0,
		Low  = 1,
		High = 2,
		MAX  = 3
	};

	/**
	 * Enum Athena.EFaunaAnimationLocation
	 */
	enum class EFaunaAnimationLocation : uint8_t
	{
		Land       = 0,
		Sea        = 1,
		Underwater = 2,
		MAX        = 3
	};

	/**
	 * Enum Athena.EFaunaAnimationState
	 */
	enum class EFaunaAnimationState : uint8_t
	{
		Idle       = 0,
		Locomotion = 1,
		Impact     = 2,
		DyingLoop  = 3,
		Death      = 4,
		Special    = 5,
		MAX        = 6
	};

	/**
	 * Enum Athena.InventoryAction
	 */
	enum class EInventoryAction : uint8_t
	{
		InventoryAction_Take                = 0,
		InventoryAction_Stow                = 1,
		InventoryAction_InventoryAction_MAX = 2
	};

	/**
	 * Enum Athena.InventoryItemState
	 */
	enum class EInventoryItemState : uint8_t
	{
		InventoryItemState_Default                = 0,
		InventoryItemState_Locked                 = 1,
		InventoryItemState_InventoryItemState_MAX = 2
	};

	/**
	 * Enum Athena.EFlameOfFateType
	 */
	enum class EFlameOfFateType : uint8_t
	{
		Default         = 0,
		Cursed          = 1,
		DiedByShark     = 2,
		DiedByVolcano   = 3,
		DiedBySkeleton  = 4,
		DiedByLightning = 5,
		DiedByVenom     = 6,
		DiedByPlayer    = 7,
		MAX             = 8,
		MAX01           = 9
	};

	/**
	 * Enum Athena.ELockAnimationState
	 */
	enum class ELockAnimationState : uint8_t
	{
		None            = 0,
		InterpolatingIn = 1,
		Unlocking       = 2,
		MAX             = 3
	};

	/**
	 * Enum Athena.ECollectorsChestMaterial
	 */
	enum class ECollectorsChestMaterial : uint8_t
	{
		Wood  = 0,
		Stone = 1,
		MAX   = 2
	};

	/**
	 * Enum Athena.EMermaidState
	 */
	enum class EMermaidState : uint8_t
	{
		Rising       = 0,
		Idle         = 1,
		Disappearing = 2,
		MAX          = 3
	};

	/**
	 * Enum Athena.ERomeBeaconAttachType
	 */
	enum class ERomeBeaconAttachType : uint8_t
	{
		Ship   = 0,
		Player = 1,
		MAX    = 2,
		MAX01  = 3
	};

	/**
	 * Enum Athena.EBootyStorageMaterialState
	 */
	enum class EBootyStorageMaterialState : uint8_t
	{
		Empty   = 0,
		Partial = 1,
		Full    = 2,
		MAX     = 3
	};

	/**
	 * Enum Athena.ETransientCampfireStateChange
	 */
	enum class ETransientCampfireStateChange : uint8_t
	{
		Extinguished = 0,
		WoodAdded    = 1,
		Ignited      = 2,
		Stoked       = 3,
		BurnedDown   = 4,
		MAX          = 5
	};

	/**
	 * Enum Athena.EStickinessType
	 */
	enum class EStickinessType : uint8_t
	{
		DontStick        = 0,
		StickTemporarily = 1,
		StickForever     = 2,
		MAX              = 3
	};

	/**
	 * Enum Athena.ENotificationType
	 */
	enum class ENotificationType : uint8_t
	{
		Chat             = 0,
		Server           = 1,
		FormattedChat    = 2,
		STTChat          = 3,
		EmoteDescription = 4,
		MAX              = 5
	};

	/**
	 * Enum Athena.ECutsceneActivatonState
	 */
	enum class ECutsceneActivatonState : uint8_t
	{
		Enabled         = 0,
		Disabled        = 1,
		Active          = 2,
		FinishedPlaying = 3,
		Decommissioned  = 4,
		MAX             = 5
	};

	/**
	 * Enum Athena.ENamedPointCollectionSearchTag
	 */
	enum class ENamedPointCollectionSearchTag : uint8_t
	{
		None                             = 0,
		PirateLegendsVoyage              = 1,
		PirateLegends_HauntedFort        = 2,
		PirateLegends_HauntedIsland      = 3,
		PirateLegends_LyingMap           = 4,
		PirateLegends_PictureMap         = 5,
		PirateLegends_ShipwreckGraveyard = 6,
		PirateLegends_ZoomMap            = 7,
		MAX                              = 8
	};

	/**
	 * Enum Athena.ENamedPointGroupSearchTag
	 */
	enum class ENamedPointGroupSearchTag : uint8_t
	{
		None              = 0,
		ItemSpawnLocation = 1,
		ItemBuryLocation  = 2,
		Exclude           = 3,
		MAX               = 4
	};

	/**
	 * Enum Athena.EWheelAnimationType
	 */
	enum class EWheelAnimationType : uint8_t
	{
		SmallTurn     = 0,
		LeftTurnMid   = 1,
		LeftTurnFast  = 2,
		RightTurnMid  = 3,
		RightTurnFast = 4,
		MAX           = 5
	};

	/**
	 * Enum Athena.EWheelDirection
	 */
	enum class EWheelDirection : uint8_t
	{
		Any           = 0,
		Anticlockwise = 1,
		Clockwise     = 2,
		MAX           = 3
	};

	/**
	 * Enum Athena.EVoyageDifficultyScope
	 */
	enum class EVoyageDifficultyScope : uint8_t
	{
		Tale     = 0,
		Standard = 1,
		Emergent = 2,
		MAX      = 3
	};

	/**
	 * Enum Athena.EMastDamageState
	 */
	enum class EMastDamageState : uint8_t
	{
		Intact     = 0,
		Secured    = 1,
		Upright    = 2,
		FreeToMove = 3,
		MAX        = 4
	};

	/**
	 * Enum Athena.EMastType
	 */
	enum class EMastType : uint8_t
	{
		Front = 0,
		Main  = 1,
		Rear  = 2,
		MAX   = 3
	};

	/**
	 * Enum Athena.ERowBraking
	 */
	enum class ERowBraking : uint8_t
	{
		None       = 0,
		BrakeLeft  = 1,
		BrakeRight = 2,
		BrakeBoth  = 3,
		MAX        = 4
	};

	/**
	 * Enum Athena.EHitRegShotType
	 */
	enum class EHitRegShotType : uint8_t
	{
		Invalid          = 0,
		HitScanShot      = 1,
		TimeOfFlightShot = 2,
		MAX              = 3
	};

	/**
	 * Enum Athena.EHitRegSnapshotDisagreementType
	 */
	enum class EHitRegSnapshotDisagreementType : uint8_t
	{
		NoDisagreement                 = 0,
		DifferentComponentsOnSameActor = 1,
		DifferentActors                = 2,
		DesynchronizedData             = 3,
		MAX                            = 4
	};

	/**
	 * Enum Athena.EStormEffectLockReasons
	 */
	enum class EStormEffectLockReasons : uint8_t
	{
		InsideExclusionVolume   = 0,
		AccessibilityToggledOff = 1,
		MAX                     = 2
	};

	/**
	 * Enum Athena.ERespawnPointOrientation
	 */
	enum class ERespawnPointOrientation : uint8_t
	{
		None    = 0,
		North   = 1,
		South   = 2,
		West    = 3,
		East    = 4,
		Outward = 5,
		Inward  = 6,
		Random  = 7,
		MAX     = 8
	};

	/**
	 * Enum Athena.EContestState
	 */
	enum class EContestState : uint8_t
	{
		Idle        = 0,
		Staging     = 1,
		Contest     = 2,
		PostContest = 3,
		Reward      = 4,
		MAX         = 5
	};

	/**
	 * Enum Athena.EContestScoreId
	 */
	enum class EContestScoreId : uint8_t
	{
		Undefined = 0,
		Silver    = 1,
		MAX       = 2
	};

	/**
	 * Enum Athena.DrowningState
	 */
	enum class EDrowningState : uint8_t
	{
		DrowningState_NotDrowning       = 0,
		DrowningState_Drowning          = 1,
		DrowningState_Gulping           = 2,
		DrowningState_ResetDrowning     = 3,
		DrowningState_DrowningState_MAX = 4
	};

	/**
	 * Enum Athena.EMechanismActionActivationMode
	 */
	enum class EMechanismActionActivationMode : uint8_t
	{
		Any = 0,
		All = 1,
		MAX = 2
	};

	/**
	 * Enum Athena.EMechanismActionState
	 */
	enum class EMechanismActionState : uint8_t
	{
		Active   = 0,
		Inactive = 1,
		MAX      = 2
	};

	/**
	 * Enum Athena.EMechanismActionType
	 */
	enum class EMechanismActionType : uint8_t
	{
		OneShot    = 0,
		Continuous = 1,
		MAX        = 2
	};

	/**
	 * Enum Athena.EMechanismTriggerState
	 */
	enum class EMechanismTriggerState : uint8_t
	{
		Active   = 0,
		Inactive = 1,
		Disabled = 2,
		MAX      = 3
	};

	/**
	 * Enum Athena.EMechanismTriggerType
	 */
	enum class EMechanismTriggerType : uint8_t
	{
		OneShot    = 0,
		Continuous = 1,
		MAX        = 2
	};

	/**
	 * Enum Athena.EAnimatedMechanismTickCost
	 */
	enum class EAnimatedMechanismTickCost : uint8_t
	{
		Low  = 0,
		High = 1,
		MAX  = 2
	};

	/**
	 * Enum Athena.EMechanismAnimationEventType
	 */
	enum class EMechanismAnimationEventType : uint8_t
	{
		OneShot    = 0,
		Continuous = 1,
		MAX        = 2
	};

	/**
	 * Enum Athena.ETimedDoorCheckpointState
	 */
	enum class ETimedDoorCheckpointState : uint8_t
	{
		Lowering = 0,
		Jammed   = 1,
		MAX      = 2
	};

	/**
	 * Enum Athena.ETimedDoorState
	 */
	enum class ETimedDoorState : uint8_t
	{
		Lowering = 0,
		Closed   = 1,
		Opening  = 2,
		Jammed   = 3,
		MAX      = 4
	};

	/**
	 * Enum Athena.ESimpleAnimatedMechanismActionMode
	 */
	enum class ESimpleAnimatedMechanismActionMode : uint8_t
	{
		OneShot              = 0,
		OneShotRetriggerable = 1,
		Continuous           = 2,
		MAX                  = 3
	};

	/**
	 * Enum Athena.ECollisionShapeType
	 */
	enum class ECollisionShapeType : uint8_t
	{
		Sphere = 0,
		Box    = 1,
		MAX    = 2
	};

	/**
	 * Enum Athena.ESwitchMechanismTriggerRandomSelectionMode
	 */
	enum class ESwitchMechanismTriggerRandomSelectionMode : uint8_t
	{
		Any          = 0,
		InactiveOnly = 1,
		MAX          = 2
	};

	/**
	 * Enum Athena.EVFXMechanismAnimationEventMode
	 */
	enum class EVFXMechanismAnimationEventMode : uint8_t
	{
		FixedRelativeOffset                = 0,
		FixedMechanismVFXComponentLocation = 1,
		AttachedToSceneComponent           = 2,
		MAX                                = 3
	};

	/**
	 * Enum Athena.EOverrideState
	 */
	enum class EOverrideState : uint8_t
	{
		Free             = 0,
		StartingOverride = 1,
		EndingOverride   = 2,
		Overridden       = 3,
		MAX              = 4
	};

	/**
	 * Enum Athena.EEventRoomState
	 */
	enum class EEventRoomState : uint8_t
	{
		Inactive  = 0,
		Waiting   = 1,
		Active    = 2,
		Completed = 3,
		Aftermath = 4,
		MAX       = 5
	};

	/**
	 * Enum Athena.EWreckSpawnBlockType
	 */
	enum class EWreckSpawnBlockType : uint8_t
	{
		AlwaysBlock       = 0,
		NeverBlock        = 1,
		PotentialBlockage = 2,
		MAX               = 3
	};

	/**
	 * Enum Athena.EWreckSpawnCheckFlag
	 */
	enum class EWreckSpawnCheckFlag : uint8_t
	{
		None                            = 0,
		Players                         = 1,
		Ships                           = 2,
		AmbientWrecks                   = 3,
		CustomWrecks                    = 4,
		Islands                         = 5,
		AmbientWrecksWithNearPlayers    = 6,
		AmbientWrecksWithoutNearPlayers = 7,
		SeaRocks                        = 8,
		MAX                             = 9
	};

	/**
	 * Enum Athena.EBaitType
	 */
	enum class EBaitType : uint8_t
	{
		NoBait     = 0,
		EarthWorms = 1,
		Grubs      = 2,
		Leeches    = 3,
		MAX        = 4
	};

	/**
	 * Enum Athena.EFishSize
	 */
	enum class EFishSize : uint8_t
	{
		Medium = 0,
		Large  = 1,
		MAX    = 2
	};

	/**
	 * Enum Athena.EFishSpawnTimeOfDay
	 */
	enum class EFishSpawnTimeOfDay : uint8_t
	{
		AnyTime   = 0,
		OnlyDay   = 1,
		OnlyNight = 2,
		MAX       = 3
	};

	/**
	 * Enum Athena.EFishAnimationState
	 */
	enum class EFishAnimationState : uint8_t
	{
		SwimmingLoop = 0,
		Fighting     = 1,
		Tired        = 2,
		Escaped      = 3,
		Caught       = 4,
		MAX          = 5
	};

	/**
	 * Enum Athena.EFishingFishState
	 */
	enum class EFishingFishState : uint8_t
	{
		NotSet                         = 0,
		RisingFromTheDepths            = 1,
		AttachedToFloat_MovingToFloat  = 2,
		AttachedToFloat_Battling       = 3,
		AttachedToFloat_Tired          = 4,
		AttachedToFloat_Caught         = 5,
		AttachedToFloat_Caught_Instant = 6,
		Escaping                       = 7,
		MAX                            = 8
	};

	/**
	 * Enum Athena.EFishingFloatState
	 */
	enum class EFishingFloatState : uint8_t
	{
		NotSet              = 0,
		AttachedToRod       = 1,
		Casting             = 2,
		CastingFailed       = 3,
		FloatingOnWater     = 4,
		BringingInCatch     = 5,
		Retracting          = 6,
		ViolentlyRetracting = 7,
		MAX                 = 8
	};

	/**
	 * Enum Athena.EFishingMiniGamePlayerInputBattlingDirection
	 */
	enum class EFishingMiniGamePlayerInputBattlingDirection : uint8_t
	{
		BattlingAgainstLeft  = 0,
		BattlingAgainstRight = 1,
		BattlingAgainstAway  = 2,
		MAX                  = 3
	};

	/**
	 * Enum Athena.EFishingMiniGamePlayerInputDirection
	 */
	enum class EFishingMiniGamePlayerInputDirection : uint8_t
	{
		None    = 0,
		Left    = 1,
		Away    = 2,
		Right   = 3,
		Towards = 4,
		MAX     = 5
	};

	/**
	 * Enum Athena.EFishingMiniGameEscapeDirection
	 */
	enum class EFishingMiniGameEscapeDirection : uint8_t
	{
		None  = 0,
		Left  = 1,
		Away  = 2,
		Right = 3,
		MAX   = 4
	};

	/**
	 * Enum Athena.EFishingMiniGameState
	 */
	enum class EFishingMiniGameState : uint8_t
	{
		Battling   = 0,
		Recovering = 1,
		MAX        = 2
	};

	/**
	 * Enum Athena.EFishingRodServerState
	 */
	enum class EFishingRodServerState : uint8_t
	{
		NotBeingUsed                          = 0,
		PreparingToCast                       = 1,
		VerifyingCastLocation                 = 2,
		Casting                               = 3,
		DelayBeforeSpawningFish               = 4,
		RequestFishSpawnWhenPossible          = 5,
		WaitingForAsyncLoadToFinish           = 6,
		WaitingForFishToBite                  = 7,
		FishMovingInToBite                    = 8,
		FishOnRodAndWaitingForPlayerInput     = 9,
		FishMovingToMinimumDistanceFromPlayer = 10,
		FishingMiniGameUnderway               = 11,
		FishCaught                            = 12,
		ReelingInAComedyItem                  = 13,
		ComedyItemCaught                      = 14,
		MAX                                   = 15
	};

	/**
	 * Enum Athena.EFishingRodRetractLineVisuals
	 */
	enum class EFishingRodRetractLineVisuals : uint8_t
	{
		None    = 0,
		Normal  = 1,
		Violent = 2,
		MAX     = 3
	};

	/**
	 * Enum Athena.EFishingRodBattlingState
	 */
	enum class EFishingRodBattlingState : uint8_t
	{
		NotBattling        = 0,
		Battling_Tiring    = 1,
		Battling_NotTiring = 2,
		Battling_Tired     = 3,
		MAX                = 4
	};

	/**
	 * Enum Athena.EFishingState
	 */
	enum class EFishingState : uint8_t
	{
		None         = 0,
		Casting      = 1,
		CastForwards = 2,
		CastSuccess  = 3,
		CastFailed   = 4,
		Fishing      = 5,
		IntoFighting = 6,
		Fighting     = 7,
		Success      = 8,
		Failure      = 9,
		MAX          = 10
	};

	/**
	 * Enum Athena.EMusicalInstrumentType
	 */
	enum class EMusicalInstrumentType : uint8_t
	{
		Banjo      = 0,
		Bass       = 1,
		Concertina = 2,
		Drums      = 3,
		HurdyGurdy = 4,
		OneManBand = 5,
		Sousaphone = 6,
		Ukulele    = 7,
		VoiceBox   = 8,
		Any        = 9,
		Total      = 10,
		MAX        = 11
	};

	/**
	 * Enum Athena.EShantyEnsembleOption
	 */
	enum class EShantyEnsembleOption : uint8_t
	{
		TryToJoinExistingNearbyEnsemble = 0,
		ForceNewEnsemble                = 1,
		MAX                             = 2
	};

	/**
	 * Enum Athena.EDigDirection
	 */
	enum class EDigDirection : uint8_t
	{
		None     = 0,
		Exhuming = 1,
		Burying  = 2,
		MAX      = 3
	};

	/**
	 * Enum Athena.EPetMontageAnimationType
	 */
	enum class EPetMontageAnimationType : uint8_t
	{
		None           = 0,
		OneShot        = 1,
		LoopingOneShot = 2,
		LoopingStaged  = 3,
		MAX            = 4
	};

	/**
	 * Enum Athena.EPetMontageAnimationState
	 */
	enum class EPetMontageAnimationState : uint8_t
	{
		None               = 0,
		OneShot            = 1,
		ContinuousIn       = 2,
		ContinuousLoop     = 3,
		ContinuousOut      = 4,
		ExitContinuousLoop = 5,
		MAX                = 6
	};

	/**
	 * Enum Athena.EAthenaAnimationPetRoamingState
	 */
	enum class EAthenaAnimationPetRoamingState : uint8_t
	{
		Idle            = 0,
		Locomotion      = 1,
		LocomtionScared = 2,
		Unique          = 3,
		React           = 4,
		Call            = 5,
		Concealed       = 6,
		FlyCannon       = 7,
		Cheer           = 8,
		Interested      = 9,
		Talking         = 10,
		Happy           = 11,
		Caged           = 12,
		Grumpy          = 13,
		Angry           = 14,
		Dance           = 15,
		Cleaning        = 16,
		Exit            = 17,
		Arrive          = 18,
		Startled        = 19,
		Inactive        = 20,
		TakingOff       = 21,
		Landing         = 22,
		Flying          = 23,
		Yawn            = 24,
		Scared          = 25,
		Protective      = 26,
		Vomit           = 27,
		Chew            = 28,
		Sneeze          = 29,
		Sleep           = 30,
		Hangout_A       = 31,
		Hangout_B       = 32,
		Hangout_C       = 33,
		LookAround      = 34,
		Meme            = 35,
		MAX             = 36
	};

	/**
	 * Enum Athena.EAthenaAnimationPetHeldReactionState
	 */
	enum class EAthenaAnimationPetHeldReactionState : uint8_t
	{
		None          = 0,
		Chew          = 1,
		PositiveReact = 2,
		NegativeReact = 3,
		RefuseReact   = 4,
		MAX           = 5
	};

	/**
	 * Enum Athena.EAthenaAnimationPetHeldState
	 */
	enum class EAthenaAnimationPetHeldState : uint8_t
	{
		Idle       = 0,
		Underwater = 1,
		UnEquip    = 2,
		Equip      = 3,
		Inactive   = 4,
		Drop       = 5,
		Stroke     = 6,
		Give       = 7,
		MAX        = 8
	};

	/**
	 * Enum Athena.EAthenaAnimationPetSpawnState
	 */
	enum class EAthenaAnimationPetSpawnState : uint8_t
	{
		Null      = 0,
		BeingHeld = 1,
		Roaming   = 2,
		MAX       = 3
	};

	/**
	 * Enum Athena.EWorldRegion
	 */
	enum class EWorldRegion : uint8_t
	{
		BlueSeaOfPlenty  = 0,
		TheWilds         = 1,
		WideSeaOfPlunder = 2,
		DevilsRoar       = 3,
		ShoresOfGold     = 4,
		MAX              = 5
	};

	/**
	 * Enum Athena.MapInventoryItemState
	 */
	enum class EMapInventoryItemState : uint8_t
	{
		MapInventoryItemState_Default                   = 0,
		MapInventoryItemState_Locked                    = 1,
		MapInventoryItemState_MapInventoryItemState_MAX = 2
	};

	/**
	 * Enum Athena.EEventFortDestructionReason
	 */
	enum class EEventFortDestructionReason : uint8_t
	{
		Defeated = 0,
		Despawn  = 1,
		MAX      = 2
	};

	/**
	 * Enum Athena.ESeaFortState
	 */
	enum class ESeaFortState : uint8_t
	{
		Inactive = 0,
		Dormant  = 1,
		Battle   = 2,
		MAX      = 3
	};

	/**
	 * Enum Athena.EPrisonerPosition
	 */
	enum class EPrisonerPosition : uint8_t
	{
		None     = 0,
		Hitting  = 1,
		Kneeling = 2,
		Stood    = 3,
		MAX      = 4
	};

	/**
	 * Enum Athena.EShipType
	 */
	enum class EShipType : uint8_t
	{
		Sloop      = 0,
		Brigantine = 1,
		Galleon    = 2,
		Invalid    = 3,
		MAX        = 4
	};

	/**
	 * Enum Athena.ECanvasBlendMode
	 */
	enum class ECanvasBlendMode : uint8_t
	{
		Opaque                           = 0,
		Masked                           = 1,
		Translucent                      = 2,
		Additive                         = 3,
		Modulate                         = 4,
		MaskedDistanceField              = 5,
		MaskedDistanceFieldShadowed      = 6,
		TranslucentDistanceField         = 7,
		TranslucentDistanceFieldShadowed = 8,
		AlphaComposite                   = 9,
		AlphaBlend                       = 10,
		TranslucentAlphaOnly             = 11,
		PremultipliedAlpha               = 12,
		MAX                              = 13
	};

	/**
	 * Enum Athena.EWidgetVisibilityGroup
	 */
	enum class EWidgetVisibilityGroup : uint8_t
	{
		Persistent   = 0,
		AlwaysHidden = 1,
		Group1       = 2,
		Group2       = 3,
		MAX          = 4
	};

	/**
	 * Enum Athena.EWieldableBookPageType
	 */
	enum class EWieldableBookPageType : uint8_t
	{
		Single = 0,
		Double = 1,
		MAX    = 2
	};

	/**
	 * Enum Athena.EWieldableBookPageRenderingMode
	 */
	enum class EWieldableBookPageRenderingMode : uint8_t
	{
		NoPagesRendered                             = 0,
		DrawLeftPageAsCurrentOnly                   = 1,
		DrawLeftPageAsPreviousAndRightPageAsCurrent = 2,
		DrawLeftPageAsCurrentAndRightPageAsNext     = 3,
		MAX                                         = 4
	};

	/**
	 * Enum Athena.ERenderPageResult
	 */
	enum class ERenderPageResult : uint8_t
	{
		RenderedPage = 0,
		NoWorkDone   = 1,
		MAX          = 2
	};

	/**
	 * Enum Athena.EEventLogEntryType
	 */
	enum class EEventLogEntryType : uint8_t
	{
		None                  = 0,
		PlayerDied            = 1,
		ArrivedAtIsland       = 2,
		ArrivedAtShrine       = 3,
		DepartedIsland        = 4,
		DepartedShrine        = 5,
		BuriedTreasure        = 6,
		VoyageComplete        = 7,
		FortComplete          = 8,
		DamnedFortComplete    = 9,
		TallTaleComplete      = 10,
		LordFought            = 11,
		FlameheartFought      = 12,
		GhostShipFought       = 13,
		SkellyShipFought      = 14,
		KrakenEncountered     = 15,
		MegEncountered        = 16,
		FoundMessageInABottle = 17,
		FoundTreasure         = 18,
		AllianceFormed        = 19,
		AllianceDisbanded     = 20,
		Sunk                  = 21,
		SailedDistance        = 22,
		ShipwreckExplored     = 23,
		FightPlayers          = 24,
		EndedCaptaincy        = 25,
		EnteredSea            = 26,
		BattleNonCaptainsShip = 27,
		BattleCaptainsShip    = 28,
		MAX                   = 29
	};

	/**
	 * Enum Athena.ECaptainsLogPageType
	 */
	enum class ECaptainsLogPageType : uint8_t
	{
		Invalid = 0,
		Ship    = 1,
		Crew    = 2,
		Session = 3,
		Log     = 4,
		MAX     = 5
	};

	/**
	 * Enum Athena.ESwimmingMode
	 */
	enum class ESwimmingMode : uint8_t
	{
		SwimmingMode_None     = 0,
		SwimmingMode_Swimming = 1,
		SwimmingMode_Sinking  = 2,
		SwimmingMode_MAX      = 3
	};

	/**
	 * Enum Athena.ESwimmingCreatureDeathCustomEventEnum
	 */
	enum class ESwimmingCreatureDeathCustomEventEnum : uint8_t
	{
		None             = 0,
		StartSinking     = 1,
		StartSinkingAnim = 2,
		MAX              = 3
	};

	/**
	 * Enum Athena.EBeckonNPCGroup
	 */
	enum class EBeckonNPCGroup : uint8_t
	{
		Default   = 0,
		Larinna   = 1,
		Belle     = 2,
		Pendragon = 3,
		Test      = 4,
		Test2     = 5,
		MAX       = 6
	};

	/**
	 * Enum Athena.EBeckonGesture
	 */
	enum class EBeckonGesture : uint8_t
	{
		Default = 0,
		Welcome = 1,
		Goodbye = 2,
		Test    = 3,
		Test2   = 4,
		MAX     = 5
	};

	/**
	 * Enum Athena.EAggressiveGhostShipCannonFacingDirection
	 */
	enum class EAggressiveGhostShipCannonFacingDirection : uint8_t
	{
		Left  = 0,
		Right = 1,
		MAX   = 2
	};

	/**
	 * Enum Athena.EAggressiveGhostShipSpawnDirectionType
	 */
	enum class EAggressiveGhostShipSpawnDirectionType : uint8_t
	{
		Random                    = 0,
		AlwaysClockwise           = 1,
		AlwaysAntiClockwise       = 2,
		MatchNearbyEncounter      = 3,
		OppositeToNearbyEncounter = 4,
		MAX                       = 5
	};

	/**
	 * Enum Athena.EAggressiveGhostShipType
	 */
	enum class EAggressiveGhostShipType : uint8_t
	{
		Grunt                 = 0,
		FormationGrunt        = 1,
		FormationLeader       = 2,
		CaptainFormationGrunt = 3,
		Captain               = 4,
		MAX                   = 5
	};

	/**
	 * Enum Athena.EAggressiveGhostShipAllegiance
	 */
	enum class EAggressiveGhostShipAllegiance : uint8_t
	{
		HostileToPlayers  = 0,
		FriendlyToPlayers = 1,
		MAX               = 2
	};

	/**
	 * Enum Athena.FAggressiveGhostShipEncounterWaveProgressAnnounceMusicType
	 */
	enum class EFAggressiveGhostShipEncounterWaveProgressAnnounceMusicType : uint8_t
	{
		FAggressiveGhostShipEncounterWaveProgressAnnounceMusicType_None                                                           = 0,
		FAggressiveGhostShipEncounterWaveProgressAnnounceMusicType_Formation                                                      = 1,
		FAggressiveGhostShipEncounterWaveProgressAnnounceMusicType_FinalWaveCaptain                                               = 2,
		FAggressiveGhostShipEncounterWaveProgressAnnounceMusicType_FinalWaveFlameheart                                            = 3,
		FAggressiveGhostShipEncounterWaveProgressAnnounceMusicType_EncounterComplete                                              = 4,
		FAggressiveGhostShipEncounterWaveProgressAnnounceMusicType_FAggressiveGhostShipEncounterWaveProgressAnnounceMusicType_MAX = 5
	};

	/**
	 * Enum Athena.EAggressiveGhostShipTarget
	 */
	enum class EAggressiveGhostShipTarget : uint8_t
	{
		None                   = 0,
		Player                 = 1,
		NearPlayer             = 2,
		Ship                   = 3,
		NearShip               = 4,
		MermaidStatue          = 5,
		NearMermaidStatue      = 6,
		EnemyGhostShip         = 7,
		NearEnemyGhostShip     = 8,
		CannonRowboat          = 9,
		NearCannonRowboat      = 10,
		GenericExtraTarget     = 11,
		NearGenericExtraTarget = 12,
		Anywhere               = 13,
		MAX                    = 14
	};

	/**
	 * Enum Athena.EHauntedFortPhase
	 */
	enum class EHauntedFortPhase : uint8_t
	{
		NONE         = 0,
		Emplacements = 1,
		Fort         = 2,
		Destroyed    = 3,
		MAX          = 4
	};

	/**
	 * Enum Athena.ENavigationDirection
	 */
	enum class ENavigationDirection : uint8_t
	{
		None  = 0,
		Left  = 1,
		Right = 2,
		Up    = 3,
		Down  = 4,
		MAX   = 5
	};

	/**
	 * Enum Athena.ERevealState
	 */
	enum class ERevealState : uint8_t
	{
		Hidden        = 0,
		FarRevealed   = 1,
		CloseRevealed = 2,
		MAX           = 3
	};

	/**
	 * Enum Athena.ETransientActorDiscardType
	 */
	enum class ETransientActorDiscardType : uint8_t
	{
		MarkForDestruction = 0,
		Unregister         = 1,
		Count              = 2,
		MAX                = 3
	};

	/**
	 * Enum Athena.ESittingActionStateDockingMode
	 */
	enum class ESittingActionStateDockingMode : uint8_t
	{
		FindFloor            = 0,
		AttachDirectlyToSeat = 1,
		MAX                  = 2
	};

	/**
	 * Enum Athena.ESleepingActionStateDockingMode
	 */
	enum class ESleepingActionStateDockingMode : uint8_t
	{
		FindFloor            = 0,
		AttachDirectlyToSeat = 1,
		MAX                  = 2
	};

	/**
	 * Enum Athena.ESeatStatTimeOfDay
	 */
	enum class ESeatStatTimeOfDay : uint8_t
	{
		Sunrise   = 0,
		Morning   = 1,
		MidDay    = 2,
		Afternoon = 3,
		Sunset    = 4,
		Night     = 5,
		Unknown   = 6,
		MAX       = 7
	};

	/**
	 * Enum Athena.EAthenaAnimationCapstanState
	 */
	enum class EAthenaAnimationCapstanState : uint8_t
	{
		Neutral  = 0,
		Positive = 1,
		Negative = 2,
		MAX      = 3
	};

	/**
	 * Enum Athena.EAthenaAnimationJumpingState
	 */
	enum class EAthenaAnimationJumpingState : uint8_t
	{
		None         = 0,
		Jumping      = 1,
		Falling      = 2,
		Impact       = 3,
		JumpFinished = 4,
		PreImpact    = 5,
		MAX          = 6
	};

	/**
	 * Enum Athena.EAthenaAnimationLadderState
	 */
	enum class EAthenaAnimationLadderState : uint8_t
	{
		None     = 0,
		ClimbOn  = 1,
		ClimbOff = 2,
		Climbing = 3,
		MAX      = 4
	};

	/**
	 * Enum Athena.EAthenaAnimationLadderTransitionState
	 */
	enum class EAthenaAnimationLadderTransitionState : uint8_t
	{
		None   = 0,
		Bottom = 1,
		Top    = 2,
		MAX    = 3
	};

	/**
	 * Enum Athena.EIKFootPlantingState
	 */
	enum class EIKFootPlantingState : uint8_t
	{
		On  = 0,
		Off = 1,
		MAX = 2
	};

	/**
	 * Enum Athena.EIKSolverType
	 */
	enum class EIKSolverType : uint8_t
	{
		NormalSolver = 0,
		LODSolver    = 1,
		MAX          = 2
	};

	/**
	 * Enum Athena.EIKState
	 */
	enum class EIKState : uint8_t
	{
		On  = 0,
		Off = 1,
		MAX = 2
	};

	/**
	 * Enum Athena.EItemBlockingSubState
	 */
	enum class EItemBlockingSubState : uint8_t
	{
		None       = 0,
		Main       = 1,
		Feedback   = 2,
		InFeedback = 3,
		MAX        = 4
	};

	/**
	 * Enum Athena.EComplexOneShotAttackType
	 */
	enum class EComplexOneShotAttackType : uint8_t
	{
		CombatLocomotion    = 0,
		CombatStatic        = 1,
		CombatSwimming      = 2,
		CombatHeavy         = 3,
		CombatHeavySwimming = 4,
		MAX                 = 5
	};

	/**
	 * Enum Athena.EComplexOneShotSubState
	 */
	enum class EComplexOneShotSubState : uint8_t
	{
		WarmUp          = 0,
		WarmUpFromBlock = 1,
		Action          = 2,
		Recover         = 3,
		HeavyAttackStun = 4,
		MAX             = 5
	};

	/**
	 * Enum Athena.EAthenaAnimationWheelState
	 */
	enum class EAthenaAnimationWheelState : uint8_t
	{
		Neutral  = 0,
		Positive = 1,
		Negative = 2,
		MAX      = 3
	};

	/**
	 * Enum Athena.EObjectPitchTargetingStates
	 */
	enum class EObjectPitchTargetingStates : uint8_t
	{
		None            = 0,
		StandardPassive = 1,
		StandardWater   = 2,
		Action          = 3,
		Action_1_Water  = 4,
		Action01        = 5,
		Action_2_Water  = 6,
		MAX             = 7
	};

	/**
	 * Enum Athena.EObjectPitchTargetingLimbs
	 */
	enum class EObjectPitchTargetingLimbs : uint8_t
	{
		None     = 0,
		RightArm = 1,
		LeftArm  = 2,
		BothArms = 3,
		MAX      = 4
	};

	/**
	 * Enum Athena.EAnimationWaterPumpState
	 */
	enum class EAnimationWaterPumpState : uint8_t
	{
		None          = 0,
		PumpForwards  = 1,
		PumpBackwards = 2,
		ExitPumping   = 3,
		MAX           = 4
	};

	/**
	 * Enum Athena.EWieldedItemAnimationState
	 */
	enum class EWieldedItemAnimationState : uint8_t
	{
		Equipping          = 0,
		Unequipping        = 1,
		Idle               = 2,
		Unequipped         = 3,
		ContinuousUse      = 4,
		OutOfContinuousUse = 5,
		OneShot            = 6,
		ComplexOneShot     = 7,
		Blocking           = 8,
		MAX                = 9
	};

	/**
	 * Enum Athena.EAthenaAITeam
	 */
	enum class EAthenaAITeam : uint8_t
	{
		Players                   = 0,
		Skeletons                 = 1,
		Fauna_Chickens            = 2,
		Fauna_Pigs                = 3,
		Fauna_Snakes              = 4,
		NeutralSwimmingCreature   = 5,
		Sharks                    = 6,
		TinyShark                 = 7,
		Kraken                    = 8,
		KrakenTentacle            = 9,
		NeutralCreatureCharacters = 10,
		Pets                      = 11,
		Fire                      = 12,
		AggressiveGhostShip       = 13,
		Sirens                    = 14,
		LordPinch                 = 15,
		OceanCrawlers             = 16,
		Phantoms                  = 17,
		PlayerAllied              = 18,
		Max                       = 19,
		MAX                       = 20
	};

	/**
	 * Enum Athena.EIslandType
	 */
	enum class EIslandType : uint8_t
	{
		Resource                  = 0,
		Outpost                   = 1,
		Small                     = 2,
		Medium                    = 3,
		Large                     = 4,
		Fort                      = 5,
		FortOfTheDamned           = 6,
		Reef                      = 7,
		SeaPost                   = 8,
		Tutorial                  = 9,
		ReapersHideout            = 10,
		Sunken                    = 11,
		SunkenKingdomNonStarlight = 12,
		SeaFortPrime1             = 13,
		SeaFortPrime2             = 14,
		SeaFortOvergrown1         = 15,
		SeaFortOvergrown2         = 16,
		SeaFortPrison1            = 17,
		SeaFortPrison2            = 18,
		None                      = 19,
		Max                       = 20,
		MAX                       = 21
	};

	/**
	 * Enum Athena.EIslandActiveEventType
	 */
	enum class EIslandActiveEventType : uint8_t
	{
		None     = 0,
		Shrouded = 1,
		MAX      = 2
	};

	/**
	 * Enum Athena.EIslandReservationState
	 */
	enum class EIslandReservationState : uint8_t
	{
		NotReserved       = 0,
		PartiallyReserved = 1,
		FullyReserved     = 2,
		MAX               = 3
	};

	/**
	 * Enum Athena.EGameplayEventSignalType
	 */
	enum class EGameplayEventSignalType : uint8_t
	{
		SkellyFort           = 0,
		SkellyShip           = 1,
		AshenLord            = 2,
		FlameheartGhostShips = 3,
		MAX                  = 4,
		MAX01                = 5
	};

	/**
	 * Enum Athena.EGameEventStatus
	 */
	enum class EGameEventStatus : uint8_t
	{
		Failed    = 0,
		Triggered = 1,
		Complete  = 2,
		MAX       = 3
	};

	/**
	 * Enum Athena.EEncounterActorRemovedReason
	 */
	enum class EEncounterActorRemovedReason : uint8_t
	{
		Defeated  = 0,
		Despawned = 1,
		Deleted   = 2,
		MAX       = 3
	};

	/**
	 * Enum Athena.EGameEventSchedulerEventType
	 */
	enum class EGameEventSchedulerEventType : uint8_t
	{
		Unknown                    = 0,
		AI_Kraken                  = 1,
		AI_Megalodon               = 2,
		AI_Ship_Aggressive         = 3,
		AI_Ship_Passive            = 4,
		ShipCloud                  = 5,
		SkullCloud                 = 6,
		Ghostship_Flameheart_Cloud = 7,
		AshenLordCloud             = 8,
		LegendarySkullCloud        = 9,
		MAX                        = 10
	};

	/**
	 * Enum Athena.EBootyTypes
	 */
	enum class EBootyTypes : uint8_t
	{
		Invalid          = 0,
		TreasureChest    = 1,
		BountySkull      = 2,
		MerchantCrate    = 3,
		GunpowderBarrel  = 4,
		TreasureArtifact = 5,
		AncientChest     = 6,
		PirateLordBooty  = 7,
		BoxOfSecrets     = 8,
		CargoRunCrate    = 9,
		MermaidGem       = 10,
		CollectorsChest  = 11,
		DroppedPouch     = 12,
		FishedItem       = 13,
		Food             = 14,
		TaleArtifact     = 15,
		CampaignBooty    = 16,
		ReapersBooty     = 17,
		ReapersBounty    = 18,
		RitualSkull      = 19,
		AshenBooty       = 20,
		AshenGift        = 21,
		EmissaryFlotsam  = 22,
		GoldMound        = 23,
		MerchantManifest = 24,
		BreathOfTheSea   = 25,
		CaptainsLog      = 26,
		NonSellable      = 27,
		MAX              = 28
	};

	/**
	 * Enum Athena.EItemOwnershipType
	 */
	enum class EItemOwnershipType : uint8_t
	{
		NotOwned           = 0,
		Owned              = 1,
		FirstOwner         = 2,
		FirstOwnerFromCrew = 3,
		OriginalOwner      = 4,
		Stolen             = 5,
		FirstStolenByCrew  = 6,
		MAX                = 7
	};

	/**
	 * Enum Athena.EShovelDigType
	 */
	enum class EShovelDigType : uint8_t
	{
		Success              = 0,
		PatDownSuccess       = 1,
		DeflectOffHardGround = 2,
		Invalid              = 3,
		None                 = 4,
		MAX                  = 5
	};

	/**
	 * Enum Athena.EIngestionState
	 */
	enum class EIngestionState : uint8_t
	{
		Idle           = 0,
		InToIngestion  = 1,
		OutOfIngestion = 2,
		MAX            = 3
	};

	/**
	 * Enum Athena.EMatchmakingVisibilityState
	 */
	enum class EMatchmakingVisibilityState : uint8_t
	{
		Public  = 0,
		Private = 1,
		MAX     = 2
	};

	/**
	 * Enum Athena.EScuttleState
	 */
	enum class EScuttleState : uint8_t
	{
		Scuttled                   = 0,
		NotScuttled                = 1,
		Disabled_TunnelOfTheDamned = 2,
		MAX                        = 3
	};

	/**
	 * Enum Athena.EBrigState
	 */
	enum class EBrigState : uint8_t
	{
		Unbriggable         = 0,
		Free                = 1,
		InBrig_Releasable   = 2,
		InBrig_Unreleasable = 3,
		MAX                 = 4
	};

	/**
	 * Enum Athena.ECrewOwnershipState
	 */
	enum class ECrewOwnershipState : uint8_t
	{
		Neutral  = 0,
		Assigned = 1,
		MAX      = 2
	};

	/**
	 * Enum Athena.ECrewDestroyedReason
	 */
	enum class ECrewDestroyedReason : uint8_t
	{
		AllCrewMembersRemoved = 0,
		ServerMigrated        = 1,
		MAX                   = 2
	};

	/**
	 * Enum Athena.EBrigReleaseReason
	 */
	enum class EBrigReleaseReason : uint8_t
	{
		VoteToRelease   = 0,
		AutoRelease     = 1,
		QuitGameRelease = 2,
		MAX             = 3
	};

	/**
	 * Enum Athena.EShipRegion
	 */
	enum class EShipRegion : uint8_t
	{
		None                  = 0,
		TopDeck_Bow           = 1,
		TopDeck_MainStairs    = 2,
		TopDeck_Hatch         = 3,
		TopDeck_CaptainsCabin = 4,
		TopDeck_WheelDeck     = 5,
		MapDeck_Front         = 6,
		MapDeck_MainStairs    = 7,
		MapDeck_Table         = 8,
		MapDeck_RearStairs    = 9,
		BrigDeck_Stairs       = 10,
		BrigDeck_OutsideBrig  = 11,
		BrigDeck_InsideBrig   = 12,
		MAX                   = 13
	};

	/**
	 * Enum Athena.EShipDeck
	 */
	enum class EShipDeck : uint8_t
	{
		BottomDeck = 0,
		MidDeck    = 1,
		TopDeck    = 2,
		MAX        = 3
	};

	/**
	 * Enum Athena.EBuoyantObjectState
	 */
	enum class EBuoyantObjectState : uint8_t
	{
		Rising       = 0,
		Floating     = 1,
		Sinking      = 2,
		Disappearing = 3,
		MAX          = 4
	};

	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * ScriptStruct Athena.PlayerStat
	 * Size -> 0x0004
	 */
	struct FPlayerStat
	{
	public:
		uint32_t                                                   StatId;                                                  // 0x0000(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
	};

	/**
	 * ScriptStruct Athena.FlameSpecificDataEntry
	 * Size -> 0x0020
	 */
	struct FFlameSpecificDataEntry
	{
	public:
		EFlameOfFateType                                           FlameType;                                               // 0x0000(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		unsigned char                                              UnknownData_9OIJ[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FStringAssetReference                               TextureAsset;                                            // 0x0008(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		struct FPlayerStat                                         StatToFireWhenKilled;                                    // 0x0018(0x0004) Edit, DisableEditOnInstance
		unsigned char                                              UnknownData_QP9D[0x4];                                   // 0x001C(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Athena.ShantyInstrumentData
	 * Size -> 0x0028
	 */
	struct FShantyInstrumentData
	{
	public:
		EMusicalInstrumentType                                     InstrumentType;                                          // 0x0000(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		unsigned char                                              UnknownData_HF4Z[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UWwiseEvent*                                         PlayLead;                                                // 0x0008(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UWwiseEvent*                                         PlayAccompaniment;                                       // 0x0010(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UWwiseEvent*                                         StopLead;                                                // 0x0018(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UWwiseEvent*                                         StopAccompaniment;                                       // 0x0020(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
	};

	/**
	 * ScriptStruct Athena.ShantyData
	 * Size -> 0x0030
	 */
	struct FShantyData
	{
	public:
		class FName                                                ShantyName;                                              // 0x0000(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		TArray<struct FShantyInstrumentData>                       InstrumentData;                                          // 0x0008(0x0010) Edit, ZeroConstructor
		int32_t                                                    LengthOfShantyInMs;                                      // 0x0018(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		unsigned char                                              UnknownData_ZPIW[0x4];                                   // 0x001C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UClass*                                              UnlockEntitlement;                                       // 0x0020(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash
		struct FPlayerStat                                         OnShantyPlayedStat;                                      // 0x0028(0x0004) Edit
		bool                                                       CanRandomPlay;                                           // 0x002C(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		bool                                                       CanBeSelected;                                           // 0x002D(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		bool                                                       DisableMigrationWhilePlaying;                            // 0x002E(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_IJ8M[0x1];                                   // 0x002F(0x0001) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Athena.ControlObjectActionRuleParams
	 * Size -> 0x0010
	 */
	struct FControlObjectActionRuleParams
	{
	public:
		TArray<EWieldableItemSize>                                 WieldableItemSizesToDisableControl;                      // 0x0000(0x0010) Edit, BlueprintVisible, ZeroConstructor
	};

	/**
	 * ScriptStruct Athena.MastCollisionProfiles
	 * Size -> 0x0028
	 */
	struct FMastCollisionProfiles
	{
	public:
		class FName                                                CollisionDisabledProfile;                                // 0x0000(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class FName                                                PlayerAndItemsCollisionProfile;                          // 0x0008(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class FName                                                PlayerOnlyCollisionProfile;                              // 0x0010(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class FName                                                ItemsOnlyCollisionProfile;                               // 0x0018(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class FName                                                ProjectilesOnlyCollisionProfile;                         // 0x0020(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
	};

	/**
	 * ScriptStruct Athena.MastPhysicsComponents
	 * Size -> 0x0038
	 */
	struct FMastPhysicsComponents
	{
	public:
		class UPrimitiveComponent*                                 MastBaseComponent;                                       // 0x0000(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UPrimitiveComponent*                                 MastTopComponent;                                        // 0x0008(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UPrimitiveComponent*                                 MastWeldedPhysicsBodyComponent;                          // 0x0010(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UPrimitiveComponent*                                 WeldedCrowsNestComponent;                                // 0x0018(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UPrimitiveComponent*                                 UnweldedCrowsNestComponent;                              // 0x0020(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		TArray<class UPrimitiveComponent*>                         UnweldedCrossBeamComponents;                             // 0x0028(0x0010) BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference
	};

	/**
	 * ScriptStruct Athena.MastDamageAudioParams
	 * Size -> 0x00B0
	 */
	struct FMastDamageAudioParams
	{
	public:
		struct FWwiseEmitter                                       MastHingeAudioEmitter;                                   // 0x0000(0x0020)
		class UWwiseObjectPoolWrapper*                             MastHingeAudioPool;                                      // 0x0020(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FWwiseEmitter                                       MastImpactAudioEmitter;                                  // 0x0028(0x0020)
		class UWwiseObjectPoolWrapper*                             MastImpactAudioPool;                                     // 0x0048(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UWwiseEvent*                                         MastDamaged;                                             // 0x0050(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UWwiseEvent*                                         MastFallingStart;                                        // 0x0058(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UWwiseEvent*                                         MastFallingStop;                                         // 0x0060(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UWwiseEvent*                                         MasthHoistingStart;                                      // 0x0068(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UWwiseEvent*                                         MastHoistingStop;                                        // 0x0070(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UWwiseEvent*                                         MastHoistingComplete;                                    // 0x0078(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UWwiseEvent*                                         MastFallComplete;                                        // 0x0080(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UWwiseEvent*                                         MastFallenStop;                                          // 0x0088(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class FName                                                MastDamageLevelAudioSwitch;                              // 0x0090(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class FName                                                MastHoistingSpeedAudioSwitch;                            // 0x0098(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class FName                                                MastAngleRTPC;                                           // 0x00A0(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class FName                                                MastFallingSpeedRTPC;                                    // 0x00A8(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
	};

	/**
	 * ScriptStruct Athena.IntentPredictorParams
	 * Size -> 0x0018
	 */
	struct FIntentPredictorParams
	{
	public:
		float                                                      MaxError;                                                // 0x0000(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      MinError;                                                // 0x0004(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      MinCorrectionVelocity;                                   // 0x0008(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      MinValue;                                                // 0x000C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      MaxValue;                                                // 0x0010(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		bool                                                       WrapCorrectionToValueRange;                              // 0x0014(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_FIKX[0x3];                                   // 0x0015(0x0003) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Athena.IntentPredictor
	 * Size -> 0x001C
	 */
	struct FIntentPredictor
	{
	public:
		unsigned char                                              UnknownData_4HNK[0x4];                                   // 0x0000(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FIntentPredictorParams                              Params;                                                  // 0x0004(0x0018) Edit
	};

	/**
	 * ScriptStruct Athena.ImpactDamageEvent
	 * Size -> 0x0058
	 */
	struct FImpactDamageEvent
	{
	public:
		struct FGuid                                               AttackId;                                                // 0x0000(0x0010) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		class UClass*                                              DamagerType;                                             // 0x0010(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash
		class AActor*                                              DirectInstigator;                                        // 0x0018(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class AActor*                                              RootInstigator;                                          // 0x0020(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FVector                                             Location;                                                // 0x0028(0x000C) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		struct FVector                                             SurfaceNormal;                                           // 0x0034(0x000C) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		struct FVector                                             Velocity;                                                // 0x0040(0x000C) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      DamageAmount;                                            // 0x004C(0x0004) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		int32_t                                                    DamageSpread;                                            // 0x0050(0x0004) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		EHealthChangedReason                                       Reason;                                                  // 0x0054(0x0001) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		bool                                                       DealFriendlyFireDamage;                                  // 0x0055(0x0001) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_1KPC[0x2];                                   // 0x0056(0x0002) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Athena.AchievementCriteria
	 * Size -> 0x0018
	 */
	struct FAchievementCriteria
	{
	public:
		struct FPlayerStat                                         PlayerStat;                                              // 0x0000(0x0004) Edit
		unsigned char                                              UnknownData_F6CC[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		uint64_t                                                   Threshold;                                               // 0x0008(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		EPlayerStatsOperator                                       Operator;                                                // 0x0010(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		unsigned char                                              UnknownData_5WC9[0x7];                                   // 0x0011(0x0007) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Athena.AchievementDefinition
	 * Size -> 0x0018
	 */
	struct FAchievementDefinition
	{
	public:
		class FName                                                DevCenterId;                                             // 0x0000(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		TArray<struct FAchievementCriteria>                        UnlockCriteria;                                          // 0x0008(0x0010) Edit, ZeroConstructor
	};

	/**
	 * ScriptStruct Athena.FogBankManagerFogAvoidanceArea
	 * Size -> 0x0010
	 */
	struct FFogBankManagerFogAvoidanceArea
	{
	public:
		struct FVector                                             Location;                                                // 0x0000(0x000C) ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      Radius;                                                  // 0x000C(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
	};

	/**
	 * ScriptStruct Athena.QuestVariable
	 * Size -> 0x0020
	 */
	struct FQuestVariable
	{
	public:
		unsigned char                                              UnknownData_O52Z[0x18];                                  // 0x0000(0x0018) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FName                                                ParamName;                                               // 0x0018(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
	};

	/**
	 * ScriptStruct Athena.QuestVariableVector
	 * Size -> 0x0000 (FullSize[0x0020] - InheritedSize[0x0020])
	 */
	struct FQuestVariableVector : public FQuestVariable
	{	};

	/**
	 * ScriptStruct Athena.QuestVariableFloat
	 * Size -> 0x0000 (FullSize[0x0020] - InheritedSize[0x0020])
	 */
	struct FQuestVariableFloat : public FQuestVariable
	{	};

	/**
	 * ScriptStruct Athena.QuestVariableActor
	 * Size -> 0x0000 (FullSize[0x0020] - InheritedSize[0x0020])
	 */
	struct FQuestVariableActor : public FQuestVariable
	{	};

	/**
	 * ScriptStruct Athena.WaterPuzzleWaterLevel
	 * Size -> 0x000C
	 */
	struct FWaterPuzzleWaterLevel
	{
	public:
		float                                                      WaterLevel;                                              // 0x0000(0x0004) Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      FillTransitionTime;                                      // 0x0004(0x0004) Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      DrainTransitionTime;                                     // 0x0008(0x0004) Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash
	};

	/**
	 * ScriptStruct Athena.WaterPuzzleRepData
	 * Size -> 0x0008
	 */
	struct FWaterPuzzleRepData
	{
	public:
		int32_t                                                    CurrentWaterLevelIndex;                                  // 0x0000(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		bool                                                       TransitionDueToReset;                                    // 0x0004(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_IL4G[0x3];                                   // 0x0005(0x0003) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Athena.ItemLoadoutCapacity
	 * Size -> 0x0010
	 */
	struct FItemLoadoutCapacity
	{
	public:
		class UClass*                                              ItemCategory;                                            // 0x0000(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash
		int32_t                                                    Capacity;                                                // 0x0008(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		unsigned char                                              UnknownData_HKPW[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Athena.ItemLoadout
	 * Size -> 0x0020
	 */
	struct FItemLoadout
	{
	public:
		TArray<struct FItemLoadoutCapacity>                        Capacities;                                              // 0x0000(0x0010) Edit, ZeroConstructor
		TArray<class UClass*>                                      Items;                                                   // 0x0010(0x0010) Edit, ZeroConstructor, UObjectWrapper
	};

	/**
	 * ScriptStruct Athena.ItemSpawnParams
	 * Size -> 0x0028
	 */
	struct FItemSpawnParams
	{
	public:
		struct FWeightedProbabilityRange                           Total;                                                   // 0x0000(0x0020) Edit
		float                                                      AllowedAngleDeviation;                                   // 0x0020(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      MaxZ;                                                    // 0x0024(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
	};

	/**
	 * ScriptStruct Athena.ItemSpawnTransform
	 * Size -> 0x0040
	 */
	struct FItemSpawnTransform
	{
	public:
		struct FTransform                                          Transform;                                               // 0x0000(0x0030) Edit, BlueprintVisible, IsPlainOldData, NoDestructor
		class UWeightedItemDescSpawnDataAsset*                     ReferencedSpawnDistributionAsset;                        // 0x0030(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		int32_t                                                    Weight;                                                  // 0x0038(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		unsigned char                                              UnknownData_AZBQ[0x4];                                   // 0x003C(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Athena.ItemSpawnTransformWithRandomQuantity
	 * Size -> 0x0040
	 */
	struct FItemSpawnTransformWithRandomQuantity
	{
	public:
		struct FTransform                                          Transform;                                               // 0x0000(0x0030) Edit, BlueprintVisible, IsPlainOldData, NoDestructor
		class UWeightedItemDescSpawnDataAssetWithRandomQuantity*   ReferencedSpawnDistributionAssetWithRandomQuantity;      // 0x0030(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      SpawnRadius;                                             // 0x0038(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		unsigned char                                              UnknownData_M6U6[0x4];                                   // 0x003C(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Athena.SpawnInstance
	 * Size -> 0x0040
	 */
	struct FSpawnInstance
	{
	public:
		unsigned char                                              UnknownData_OJ06[0x30];                                  // 0x0000(0x0030) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UItemSpawnData*                                      ItemSpawnData;                                           // 0x0030(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		bool                                                       CustomLifetimeManagement;                                // 0x0038(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_JK28[0x7];                                   // 0x0039(0x0007) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Athena.SpawnedItem
	 * Size -> 0x0050
	 */
	struct FSpawnedItem
	{
	public:
		TWeakObjectPtr<class AActor>                               SpawnedActor;                                            // 0x0000(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper
		class UItemSpawnData*                                      ItemSpawnData;                                           // 0x0008(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		unsigned char                                              UnknownData_B18Z[0x30];                                  // 0x0010(0x0030) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		bool                                                       CustomLifetimeManagement;                                // 0x0040(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_V6B4[0xF];                                   // 0x0041(0x000F) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Athena.LookAtOffset
	 * Size -> 0x00A0
	 */
	struct FLookAtOffset
	{
	public:
		float                                                      LookAtPitchRate;                                         // 0x0000(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      LookAtYawRate;                                           // 0x0004(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      LookAtYawRawScale;                                       // 0x0008(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      LookAtPitchRawScale;                                     // 0x000C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		unsigned char                                              UnknownData_WO9D[0x90];                                  // 0x0010(0x0090) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Athena.CloudVisualParameters
	 * Size -> 0x0070
	 */
	struct FCloudVisualParameters
	{
	public:
		bool                                                       RenderInMainPass;                                        // 0x0000(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_LOGA[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FVector                                             ScalingVector;                                           // 0x0004(0x000C) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		struct FVector2D                                           BillboardScale;                                          // 0x0010(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		struct FVector2D                                           BillboardRandomScale;                                    // 0x0018(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		struct FVector2D                                           BillboardRearCutOff;                                     // 0x0020(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		struct FVector2D                                           BillboardForeCutOff;                                     // 0x0028(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		struct FVector2D                                           BillboardSink;                                           // 0x0030(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      BillboardScaleAlphaDependence;                           // 0x0038(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      BillboardRotationRate;                                   // 0x003C(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      DistanceFadeExponent;                                    // 0x0040(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      TurbulenceScale;                                         // 0x0044(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      TurbulenceStrength;                                      // 0x0048(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      FluffCullDistance;                                       // 0x004C(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UMaterialInterface*                                  MaterialTemplatePointCloudSolid;                         // 0x0050(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UMaterialInterface*                                  MaterialTemplatePointCloudFluffy;                        // 0x0058(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UMaterialInterface*                                  MaterialTemplateStreetCloudSolid;                        // 0x0060(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UMaterialInterface*                                  MaterialTemplateStreetCloudFluffy;                       // 0x0068(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
	};

	/**
	 * ScriptStruct Athena.TiledCloudProperties
	 * Size -> 0x0024
	 */
	struct FTiledCloudProperties
	{
	public:
		struct FVector2D                                           TilePosition;                                            // 0x0000(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		int32_t                                                    CloudTypeIndex;                                          // 0x0008(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      RelativeRadius;                                          // 0x000C(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      Scale;                                                   // 0x0010(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      PressureThreshold;                                       // 0x0014(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      RotationYaw;                                             // 0x0018(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      OverlapTolerance;                                        // 0x001C(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		unsigned char                                              UnknownData_JX85[0x4];                                   // 0x0020(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Athena.RenderedCloudProperties
	 * Size -> 0x0030
	 */
	struct FRenderedCloudProperties
	{
	public:
		struct FVector                                             WorldPosition;                                           // 0x0000(0x000C) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      Fade;                                                    // 0x000C(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      Storminess;                                              // 0x0010(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      RotationYaw;                                             // 0x0014(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      StreetRotationFront;                                     // 0x0018(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      StreetRotationBack;                                      // 0x001C(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		bool                                                       Visible;                                                 // 0x0020(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		bool                                                       FluffVisible;                                            // 0x0021(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		bool                                                       IsStreetCloud;                                           // 0x0022(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		bool                                                       UpdatesThisFrame;                                        // 0x0023(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_GCJ9[0xC];                                   // 0x0024(0x000C) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Athena.CloudTypeDefinition
	 * Size -> 0x0030
	 */
	struct FCloudTypeDefinition
	{
	public:
		class UStaticMesh*                                         CloudMesh;                                               // 0x0000(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UStaticMesh*                                         CloudFluffyMesh;                                         // 0x0008(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FVector2D                                           ScaleRange;                                              // 0x0010(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		struct FVector2D                                           StorminessRange;                                         // 0x0018(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      ProbabilityWeight;                                       // 0x0020(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      OverlapTolerance;                                        // 0x0024(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		bool                                                       IsStreetCloud;                                           // 0x0028(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		bool                                                       CastsShadow;                                             // 0x0029(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_7AUP[0x6];                                   // 0x002A(0x0006) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Athena.CloudTypeNormalizedWeight
	 * Size -> 0x0018
	 */
	struct FCloudTypeNormalizedWeight
	{
	public:
		struct FLinearColor                                        LodScreenPercentages;                                    // 0x0000(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      ProbabilityWeight;                                       // 0x0010(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      MeshRadius;                                              // 0x0014(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
	};

	/**
	 * ScriptStruct Athena.ActorId
	 * Size -> 0x0010
	 */
	struct FActorId
	{
	public:
		class FString                                              ActorLocalName;                                          // 0x0000(0x0010) ZeroConstructor, HasGetValueTypeHash
	};

	/**
	 * ScriptStruct Athena.WeakActorHandle
	 * Size -> 0x0028
	 */
	struct FWeakActorHandle
	{
	public:
		struct FActorId                                            ActorId;                                                 // 0x0000(0x0010)
		struct FNetActorPtr                                        NetActorPtr;                                             // 0x0010(0x0014)
		bool                                                       Valid;                                                   // 0x0024(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_GK56[0x3];                                   // 0x0025(0x0003) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Athena.WalkConditionsParams
	 * Size -> 0x0008
	 */
	struct FWalkConditionsParams
	{
	public:
		float                                                      WalkSpeedMultiplier;                                     // 0x0000(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      WalkStopThreshold;                                       // 0x0004(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
	};

	/**
	 * ScriptStruct Athena.SprintConditionsParams
	 * Size -> 0x000C
	 */
	struct FSprintConditionsParams
	{
	public:
		float                                                      ForwardInputVectorTolerance;                             // 0x0000(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      MinVelocityForwardDot;                                   // 0x0004(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      MinVelocityMagnitude;                                    // 0x0008(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
	};

	/**
	 * ScriptStruct Athena.AchievementKillOpponentFromBehindWithBlunderbuss
	 * Size -> 0x0004
	 */
	struct FAchievementKillOpponentFromBehindWithBlunderbuss
	{
	public:
		float                                                      FacingDirAngleTolerance;                                 // 0x0000(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash
	};

	/**
	 * ScriptStruct Athena.AchievementHeavyAttackRivalOffTheirShip
	 * Size -> 0x0010
	 */
	struct FAchievementHeavyAttackRivalOffTheirShip
	{
	public:
		class AAthenaCharacter*                                    Character;                                               // 0x0000(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      TimeWindowInSeconds;                                     // 0x0008(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		unsigned char                                              UnknownData_74RD[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Athena.AchievementBlockThenHitAndGetBlockedThenTakeHit
	 * Size -> 0x0010
	 */
	struct FAchievementBlockThenHitAndGetBlockedThenTakeHit
	{
	public:
		class AAthenaPlayerCharacter*                              Character;                                               // 0x0000(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      TimeWindowInSeconds;                                     // 0x0008(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		unsigned char                                              UnknownData_L704[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Athena.AchievementHaveADrinkWithAnotherCrewAtAnOutpost
	 * Size -> 0x0020
	 */
	struct FAchievementHaveADrinkWithAnotherCrewAtAnOutpost
	{
	public:
		class AAthenaPlayerCharacter*                              Character;                                               // 0x0000(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		unsigned char                                              UnknownData_MY9G[0x10];                                  // 0x0008(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      RangeOfCheckInMetres;                                    // 0x0018(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      DrinkConsumedVolumeThreshold;                            // 0x001C(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash
	};

	/**
	 * ScriptStruct Athena.AchievementKillOpponentInContest
	 * Size -> 0x0008
	 */
	struct FAchievementKillOpponentInContest
	{
	public:
		unsigned char                                              UnknownData_L7HP[0x8];                                   // 0x0000(0x0008) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Athena.AthenaPlayerCharacterModelSwap
	 * Size -> 0x0068
	 */
	struct FAthenaPlayerCharacterModelSwap
	{
	public:
		class USkeletalMesh*                                       FirstPersonMesh;                                         // 0x0000(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UClass*                                              FirstPersonAnimSetDataId;                                // 0x0008(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash
		struct FPirateGeneratorAdditionalBakeInfo                  FirstPersonAdditionalBakeInfo;                           // 0x0010(0x0020)
		class USkeletalMesh*                                       ThirdPersonMesh;                                         // 0x0030(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UClass*                                              ThirdPersonAnimSetDataId;                                // 0x0038(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash
		struct FPirateGeneratorAdditionalBakeInfo                  ThirdPersonAdditionalBakeInfo;                           // 0x0040(0x0020)
		unsigned char                                              UnknownData_300U[0x8];                                   // 0x0060(0x0008) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Athena.QuestVariableAsset
	 * Size -> 0x0000 (FullSize[0x0020] - InheritedSize[0x0020])
	 */
	struct FQuestVariableAsset : public FQuestVariable
	{	};

	/**
	 * ScriptStruct Athena.Alliance
	 * Size -> 0x0028
	 */
	struct FAlliance
	{
	public:
		struct FGuid                                               AllianceId;                                              // 0x0000(0x0010) ZeroConstructor, IsPlainOldData, NoDestructor
		TArray<struct FGuid>                                       Crews;                                                   // 0x0010(0x0010) ZeroConstructor
		unsigned char                                              AllianceIndex;                                           // 0x0020(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		unsigned char                                              UnknownData_UEAI[0x7];                                   // 0x0021(0x0007) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Athena.CrewAllianceJoinStatus
	 * Size -> 0x0014
	 */
	struct FCrewAllianceJoinStatus
	{
	public:
		struct FGuid                                               CrewId;                                                  // 0x0000(0x0010) ZeroConstructor, IsPlainOldData, NoDestructor
		EAllianceJoinStatus                                        AllianceJoinStatus;                                      // 0x0010(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		EAllianceJoinStatus                                        LastAllianceJoinStatus;                                  // 0x0011(0x0001) ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash
		unsigned char                                              UnknownData_HP2T[0x2];                                   // 0x0012(0x0002) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Athena.NPCAnimationSequence
	 * Size -> 0x0010
	 */
	struct FNPCAnimationSequence
	{
	public:
		class UAnimSequenceBase*                                   AnimationSequence;                                       // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimMontage*                                        FacialAdditive;                                          // 0x0008(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
	};

	/**
	 * ScriptStruct Athena.NPCOneShotAnimationElement
	 * Size -> 0x0018
	 */
	struct FNPCOneShotAnimationElement
	{
	public:
		class FName                                                SequenceName;                                            // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		TArray<struct FNPCAnimationSequence>                       OneShotSequence;                                         // 0x0008(0x0010) Edit, BlueprintVisible, ZeroConstructor
	};

	/**
	 * ScriptStruct Athena.NPCAnimationContinuousCycle
	 * Size -> 0x0030
	 */
	struct FNPCAnimationContinuousCycle
	{
	public:
		struct FNPCAnimationSequence                               In;                                                      // 0x0000(0x0010) Edit, BlueprintVisible
		TArray<struct FNPCAnimationSequence>                       Loop;                                                    // 0x0010(0x0010) Edit, BlueprintVisible, ZeroConstructor
		struct FNPCAnimationSequence                               Out;                                                     // 0x0020(0x0010) Edit, BlueprintVisible
	};

	/**
	 * ScriptStruct Athena.NPCContinuousAnimationElement
	 * Size -> 0x0038
	 */
	struct FNPCContinuousAnimationElement
	{
	public:
		class FName                                                SequenceName;                                            // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FNPCAnimationContinuousCycle                        ContinuousSequence;                                      // 0x0008(0x0030) Edit, BlueprintVisible
	};

	/**
	 * ScriptStruct Athena.AnimNotifyWwiseObserver
	 * Size -> 0x0020
	 */
	struct FAnimNotifyWwiseObserver
	{
	public:
		class UWwiseEvent*                                         OnEventPosted;                                           // 0x0000(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		bool                                                       PreventPlayingPostedEvent;                               // 0x0008(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_3664[0x7];                                   // 0x0009(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class UWwiseEvent*>                                 AdditionalEventsToTrigger;                               // 0x0010(0x0010) Edit, ZeroConstructor
	};

	/**
	 * ScriptStruct Athena.QuestVariableClass
	 * Size -> 0x0000 (FullSize[0x0020] - InheritedSize[0x0020])
	 */
	struct FQuestVariableClass : public FQuestVariable
	{	};

	/**
	 * ScriptStruct Athena.OneShotAnimationElement
	 * Size -> 0x0020
	 */
	struct FOneShotAnimationElement
	{
	public:
		class FName                                                SequenceName;                                            // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		TArray<class UAnimSequence*>                               OneShotSequence;                                         // 0x0008(0x0010) Edit, BlueprintVisible, ZeroConstructor
		float                                                      EffectTime;                                              // 0x0018(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      BlendTime;                                               // 0x001C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
	};

	/**
	 * ScriptStruct Athena.AnimationContinuousCycle
	 * Size -> 0x0048
	 */
	struct FAnimationContinuousCycle
	{
	public:
		class UAnimSequence*                                       In;                                                      // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      InEffectTime;                                            // 0x0008(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		unsigned char                                              UnknownData_KE00[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class UAnimSequence*>                               Loop;                                                    // 0x0010(0x0010) Edit, BlueprintVisible, ZeroConstructor
		class UBlendSpace1D*                                       LoopHitReact;                                            // 0x0020(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       Out;                                                     // 0x0028(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		TArray<class UAnimSequence*>                               OutAlternates;                                           // 0x0030(0x0010) Edit, BlueprintVisible, ZeroConstructor
		float                                                      OutUndockTime;                                           // 0x0040(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		unsigned char                                              UnknownData_JNI6[0x4];                                   // 0x0044(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Athena.ContinuousAnimationElement
	 * Size -> 0x0058
	 */
	struct FContinuousAnimationElement
	{
	public:
		class FName                                                SequenceName;                                            // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FAnimationContinuousCycle                           ContinuousSequence;                                      // 0x0008(0x0048) Edit, BlueprintVisible
		float                                                      BlendTime;                                               // 0x0050(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		unsigned char                                              UnknownData_0JDY[0x4];                                   // 0x0054(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Athena.SkeletonCustomAnimationDataStructure
	 * Size -> 0x0038
	 */
	struct FSkeletonCustomAnimationDataStructure
	{
	public:
		TArray<struct FOneShotAnimationElement>                    OneShotSequences;                                        // 0x0000(0x0010) Edit, BlueprintVisible, ZeroConstructor
		TArray<struct FContinuousAnimationElement>                 ContinuousSequences;                                     // 0x0010(0x0010) Edit, BlueprintVisible, ZeroConstructor
		class UNPCHeldObjectData*                                  WieldableCosmeticItemList;                               // 0x0020(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		TArray<class UWwiseEvent*>                                 AudioEvents;                                             // 0x0028(0x0010) Edit, BlueprintVisible, ZeroConstructor
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationLocomotion
	 * Size -> 0x0068
	 */
	struct FAthenaAnimationLocomotion
	{
	public:
		struct FVector                                             CharacterVelocity;                                       // 0x0000(0x000C) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      WantedMovementSpeed;                                     // 0x000C(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      HalfWantedMovementSpeed;                                 // 0x0010(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		bool                                                       CharacterMoving;                                         // 0x0014(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		bool                                                       RunStopWanted;                                           // 0x0015(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_GD81[0x2];                                   // 0x0016(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      TurnRate;                                                // 0x0018(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      CurrentYaw;                                              // 0x001C(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      CurrentDirection;                                        // 0x0020(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		bool                                                       TurningActive;                                           // 0x0024(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		bool                                                       TurningLeft;                                             // 0x0025(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		bool                                                       IsSwimming;                                              // 0x0026(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		bool                                                       IsUnderwaterSwimming;                                    // 0x0027(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      BlendedTurnRate;                                         // 0x0028(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      MinimumMoveSpeedToTriggerRunStop;                        // 0x002C(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      InterpSpeed;                                             // 0x0030(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      TurnRateToDisableTurns;                                  // 0x0034(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      TurningAnimationExplicitTime;                            // 0x0038(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      FixedBlendedTurnRateForAI;                               // 0x003C(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		bool                                                       IsInAITurn;                                              // 0x0040(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_Y6NM[0x17];                                  // 0x0041(0x0017) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UAthenaAnimationInstance*                            CachedOwner;                                             // 0x0058(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		unsigned char                                              UnknownData_2R7U[0x8];                                   // 0x0060(0x0008) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationObjectLocomotionAnimations
	 * Size -> 0x0040
	 */
	struct FAthenaAnimationObjectLocomotionAnimations
	{
	public:
		class UBlendSpace*                                         Locomotion1;                                             // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UBlendSpace*                                         Locomotion2;                                             // 0x0008(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UBlendSpace*                                         Locomotion3;                                             // 0x0010(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UBlendSpace*                                         Locomotion4;                                             // 0x0018(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       LocomotionTurningLeft;                                   // 0x0020(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       LocomotionTurningRight;                                  // 0x0028(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       LocomotionOutOf;                                         // 0x0030(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UBlendSpace*                                         LocomotionSwimming;                                      // 0x0038(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationObjectJumpingAnimations
	 * Size -> 0x0020
	 */
	struct FAthenaAnimationObjectJumpingAnimations
	{
	public:
		class UBlendSpace*                                         Start;                                                   // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UBlendSpace*                                         Cycle;                                                   // 0x0008(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UBlendSpace*                                         PreImpact;                                               // 0x0010(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UBlendSpace*                                         LandLight;                                               // 0x0018(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationObjectEquipAnimations
	 * Size -> 0x0040
	 */
	struct FAthenaAnimationObjectEquipAnimations
	{
	public:
		class UAnimSequence*                                       Equip;                                                   // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UBlendSpace*                                         EquipAsBlendSpace;                                       // 0x0008(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UBlendSpace*                                         EquipSwimming;                                           // 0x0010(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       UnEquip;                                                 // 0x0018(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UBlendSpace*                                         UnEquipAsBlendSpace;                                     // 0x0020(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       Pickup;                                                  // 0x0028(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       Drop;                                                    // 0x0030(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		bool                                                       UseEquipBlendSpace;                                      // 0x0038(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		bool                                                       UseUnequipBlendSpace;                                    // 0x0039(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_ZP79[0x6];                                   // 0x003A(0x0006) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationObjectIdleAnimations
	 * Size -> 0x0018
	 */
	struct FAthenaAnimationObjectIdleAnimations
	{
	public:
		class UAnimSequence*                                       Idle1;                                                   // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       Idle2;                                                   // 0x0008(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       Idle3;                                                   // 0x0010(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationObjectActionOneShot
	 * Size -> 0x0040
	 */
	struct FAthenaAnimationObjectActionOneShot
	{
	public:
		TArray<class UAnimSequence*>                               MainAction;                                              // 0x0000(0x0010) Edit, BlueprintVisible, ZeroConstructor
		TArray<class UBlendSpace*>                                 MainActionLocomotion;                                    // 0x0010(0x0010) Edit, BlueprintVisible, ZeroConstructor
		TArray<class UAnimSequence*>                               AlternateAction;                                         // 0x0020(0x0010) Edit, BlueprintVisible, ZeroConstructor
		TArray<class UBlendSpace*>                                 AlternateActionLocomotion;                               // 0x0030(0x0010) Edit, BlueprintVisible, ZeroConstructor
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationObjectActionContinuousSwimming
	 * Size -> 0x0020
	 */
	struct FAthenaAnimationObjectActionContinuousSwimming
	{
	public:
		class UBlendSpace*                                         MainInSwimming;                                          // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UBlendSpace*                                         MainOneShotInSwimming;                                   // 0x0008(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UBlendSpace*                                         MainCycleSwimming;                                       // 0x0010(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UBlendSpace*                                         MainOutSwimming;                                         // 0x0018(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationLocomotionTurningAnimData
	 * Size -> 0x0008
	 */
	struct FAthenaAnimationLocomotionTurningAnimData
	{
	public:
		class UAnimSequence*                                       Turn90;                                                  // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationObjectActionContinuousStruct
	 * Size -> 0x00A8
	 */
	struct FAthenaAnimationObjectActionContinuousStruct
	{
	public:
		class UAnimSequence*                                       MainInto;                                                // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UBlendSpace*                                         MainIntoLocomotion;                                      // 0x0008(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       OneShotInto;                                             // 0x0010(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       MainCycleIdle;                                           // 0x0018(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UBlendSpace*                                         MainCycleLocomotion;                                     // 0x0020(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		bool                                                       UseMainCycleJump;                                        // 0x0028(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_8AQF[0x7];                                   // 0x0029(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FAthenaAnimationObjectJumpingAnimations             MainCycleJump;                                           // 0x0030(0x0020) Edit, BlueprintVisible
		class UAnimSequence*                                       MainOutOf;                                               // 0x0050(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UBlendSpace*                                         MainOutOfLocomotion;                                     // 0x0058(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FAthenaAnimationObjectActionContinuousSwimming      MainSwimming;                                            // 0x0060(0x0020) Edit, BlueprintVisible
		struct FAthenaAnimationLocomotionTurningAnimData           TurningLeftAlt;                                          // 0x0080(0x0008) Edit, BlueprintVisible
		struct FAthenaAnimationLocomotionTurningAnimData           TurningRightAlt;                                         // 0x0088(0x0008) Edit, BlueprintVisible
		class UAnimSequence*                                       TurnOutAlt;                                              // 0x0090(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		bool                                                       IgnoreOverlayHandAdditiveForAction;                      // 0x0098(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_VFPC[0x7];                                   // 0x0099(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UAnimSequence*                                       CustomAdditiveForAction;                                 // 0x00A0(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationObjectActionContinuous
	 * Size -> 0x0150
	 */
	struct FAthenaAnimationObjectActionContinuous
	{
	public:
		struct FAthenaAnimationObjectActionContinuousStruct        MainContinuousActions;                                   // 0x0000(0x00A8) Edit, BlueprintVisible
		struct FAthenaAnimationObjectActionContinuousStruct        AlternateContinuousActions;                              // 0x00A8(0x00A8) Edit, BlueprintVisible
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationObjectActionOneShotPitchOverride
	 * Size -> 0x0020
	 */
	struct FAthenaAnimationObjectActionOneShotPitchOverride
	{
	public:
		TArray<class UBlendSpace1D*>                               MainAction;                                              // 0x0000(0x0010) Edit, BlueprintVisible, ZeroConstructor
		TArray<class UBlendSpace1D*>                               AlternateAction;                                         // 0x0010(0x0010) Edit, BlueprintVisible, ZeroConstructor
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationObjectJumpingAnimationsPitchOverride
	 * Size -> 0x0020
	 */
	struct FAthenaAnimationObjectJumpingAnimationsPitchOverride
	{
	public:
		class UBlendSpace1D*                                       Start;                                                   // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UBlendSpace1D*                                       Cycle;                                                   // 0x0008(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UBlendSpace1D*                                       PreImpact;                                               // 0x0010(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UBlendSpace1D*                                       LandLight;                                               // 0x0018(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationObjectActionContinuousStructPitchOverride
	 * Size -> 0x0078
	 */
	struct FAthenaAnimationObjectActionContinuousStructPitchOverride
	{
	public:
		class UBlendSpace1D*                                       MainInto;                                                // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UBlendSpace1D*                                       MainCycleIdle;                                           // 0x0008(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UBlendSpace1D*                                       MainCycleLocomotion;                                     // 0x0010(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		TArray<class UBlendSpace1D*>                               VariantCycleIdle;                                        // 0x0018(0x0010) Edit, BlueprintVisible, ZeroConstructor
		bool                                                       UseMainCycleJump;                                        // 0x0028(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		bool                                                       IgnoreFullBody;                                          // 0x0029(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_L4VW[0x6];                                   // 0x002A(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FAthenaAnimationObjectJumpingAnimationsPitchOverride MainCycleJump;                                           // 0x0030(0x0020) Edit, BlueprintVisible
		class UBlendSpace1D*                                       MainOutOf;                                               // 0x0050(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FAthenaAnimationObjectActionContinuousSwimming      MainSwimming;                                            // 0x0058(0x0020) Edit, BlueprintVisible
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationObjectActionContinuousPitchOverride
	 * Size -> 0x00F0
	 */
	struct FAthenaAnimationObjectActionContinuousPitchOverride
	{
	public:
		struct FAthenaAnimationObjectActionContinuousStructPitchOverride MainContinuousActions;                                   // 0x0000(0x0078) Edit, BlueprintVisible
		struct FAthenaAnimationObjectActionContinuousStructPitchOverride AlternateContinuousActions;                              // 0x0078(0x0078) Edit, BlueprintVisible
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationObjectComplexOneShot
	 * Size -> 0x0028
	 */
	struct FAthenaAnimationObjectComplexOneShot
	{
	public:
		class UAnimSequence*                                       WarmUp;                                                  // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       WarmUpFromBlock;                                         // 0x0008(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       Action;                                                  // 0x0010(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       Recover;                                                 // 0x0018(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       HeavyAttackStunRecover;                                  // 0x0020(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationObjectMeleeV2SpecialAttack
	 * Size -> 0x0050
	 */
	struct FAthenaAnimationObjectMeleeV2SpecialAttack
	{
	public:
		struct FAthenaAnimationObjectComplexOneShot                Attack;                                                  // 0x0000(0x0028) Edit, BlueprintVisible
		struct FAthenaAnimationObjectComplexOneShot                SwimmingAttack;                                          // 0x0028(0x0028) Edit, BlueprintVisible
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationObjectMeleeV2
	 * Size -> 0x0140
	 */
	struct FAthenaAnimationObjectMeleeV2
	{
	public:
		TArray<struct FAthenaAnimationObjectComplexOneShot>        ComboAttacks;                                            // 0x0000(0x0010) Edit, BlueprintVisible, ZeroConstructor
		TArray<struct FAthenaAnimationObjectComplexOneShot>        ComboAttacksStatic;                                      // 0x0010(0x0010) Edit, BlueprintVisible, ZeroConstructor
		TArray<struct FAthenaAnimationObjectComplexOneShot>        SwimmingComboAttacks;                                    // 0x0020(0x0010) Edit, BlueprintVisible, ZeroConstructor
		struct FAthenaAnimationObjectComplexOneShot                HeavyAttack;                                             // 0x0030(0x0028) Edit, BlueprintVisible
		struct FAthenaAnimationObjectComplexOneShot                SwimmingHeavyAttack;                                     // 0x0058(0x0028) Edit, BlueprintVisible
		TArray<struct FAthenaAnimationObjectMeleeV2SpecialAttack>  SpecialAttacks;                                          // 0x0080(0x0010) Edit, BlueprintVisible, ZeroConstructor
		class UAnimSequence*                                       BlockingMainInto;                                        // 0x0090(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       BlockingIntoFromCombat;                                  // 0x0098(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UBlendSpace*                                         BlockingMainBlendSpace;                                  // 0x00A0(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		TArray<class UAnimSequence*>                               BlockingFeedbackSequences;                               // 0x00A8(0x0010) Edit, BlueprintVisible, ZeroConstructor
		class UAnimSequence*                                       BlockingOut;                                             // 0x00B8(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       BlockingMainIntoSwimming;                                // 0x00C0(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UBlendSpace*                                         BlockingMainBlendSpaceSwimming;                          // 0x00C8(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		TArray<class UAnimSequence*>                               BlockingFeedbackSequencesSwimming;                       // 0x00D0(0x0010) Edit, BlueprintVisible, ZeroConstructor
		class UAnimSequence*                                       BlockingOutSwimming;                                     // 0x00E0(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FAthenaAnimationObjectJumpingAnimations             BlockingJump;                                            // 0x00E8(0x0020) Edit, BlueprintVisible
		class UBlendSpace*                                         CombatLocomotion;                                        // 0x0108(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       CombatLocomotionTurningLeft;                             // 0x0110(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       CombatLocomotionTurningRight;                            // 0x0118(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       CombatLocomotionTurnOut;                                 // 0x0120(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UBlendSpace*                                         Dodge;                                                   // 0x0128(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UBlendSpace*                                         LungeWarmupLocomotion;                                   // 0x0130(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		unsigned char                                              AttacksRespectFullBodyFlag : 1;                          // 0x0138(0x0001) BIT_FIELD Edit, DisableEditOnInstance, NoDestructor
		unsigned char                                              UnknownData_35MO[0x7];                                   // 0x0139(0x0007) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Athena.WieldAnimationParams
	 * Size -> 0x0040
	 */
	struct FWieldAnimationParams
	{
	public:
		EWieldAnimationLocation                                    WieldLocation;                                           // 0x0000(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		unsigned char                                              UnknownData_E4RU[0xF];                                   // 0x0001(0x000F) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FTransform                                          PropOffset;                                              // 0x0010(0x0030) Edit, BlueprintVisible, IsPlainOldData, NoDestructor
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationObjectFacial
	 * Size -> 0x0070
	 */
	struct FAthenaAnimationObjectFacial
	{
	public:
		TArray<class UAnimMontage*>                                PrimaryContinuous;                                       // 0x0000(0x0010) Edit, BlueprintVisible, ZeroConstructor
		TArray<class UAnimMontage*>                                SecondaryContinuous;                                     // 0x0010(0x0010) Edit, BlueprintVisible, ZeroConstructor
		TArray<class UAnimMontage*>                                PrimaryOneShot;                                          // 0x0020(0x0010) Edit, BlueprintVisible, ZeroConstructor
		TArray<class UAnimMontage*>                                SecondaryOneShot;                                        // 0x0030(0x0010) Edit, BlueprintVisible, ZeroConstructor
		TArray<class UAnimMontage*>                                MeleeBlocking;                                           // 0x0040(0x0010) Edit, BlueprintVisible, ZeroConstructor
		TArray<class UAnimMontage*>                                MeleeAttack;                                             // 0x0050(0x0010) Edit, BlueprintVisible, ZeroConstructor
		TArray<class UAnimMontage*>                                MeleeBlockReact;                                         // 0x0060(0x0010) Edit, BlueprintVisible, ZeroConstructor
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationSkeletonKnockbackLocomotion
	 * Size -> 0x0010
	 */
	struct FAthenaAnimationSkeletonKnockbackLocomotion
	{
	public:
		class UAnimSequence*                                       Forwards;                                                // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       Backwards;                                               // 0x0008(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationSkeletonKnockbackLocomotionStrength
	 * Size -> 0x0020
	 */
	struct FAthenaAnimationSkeletonKnockbackLocomotionStrength
	{
	public:
		struct FAthenaAnimationSkeletonKnockbackLocomotion         LowStrength;                                             // 0x0000(0x0010) Edit, BlueprintVisible
		struct FAthenaAnimationSkeletonKnockbackLocomotion         HighStrength;                                            // 0x0010(0x0010) Edit, BlueprintVisible
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationCoreObjectAnimations
	 * Size -> 0x0910
	 */
	struct FAthenaAnimationCoreObjectAnimations
	{
	public:
		struct FAthenaAnimationObjectLocomotionAnimations          Locomotion;                                              // 0x0000(0x0040) Edit, BlueprintVisible
		struct FAthenaAnimationObjectLocomotionAnimations          AlternateLocomotion;                                     // 0x0040(0x0040) Edit, BlueprintVisible
		struct FAthenaAnimationObjectJumpingAnimations             Jumping;                                                 // 0x0080(0x0020) Edit, BlueprintVisible
		struct FAthenaAnimationObjectJumpingAnimations             AlternateJumping;                                        // 0x00A0(0x0020) Edit, BlueprintVisible
		struct FAthenaAnimationObjectEquipAnimations               Equipping;                                               // 0x00C0(0x0040) Edit, BlueprintVisible
		struct FAthenaAnimationObjectIdleAnimations                Idles;                                                   // 0x0100(0x0018) Edit, BlueprintVisible
		struct FAthenaAnimationObjectIdleAnimations                AlternateIdles;                                          // 0x0118(0x0018) Edit, BlueprintVisible
		struct FAthenaAnimationObjectActionOneShot                 ActionPrimarySingle;                                     // 0x0130(0x0040) Edit, BlueprintVisible
		struct FAthenaAnimationObjectActionContinuous              ActionPrimaryContinuous;                                 // 0x0170(0x0150) Edit, BlueprintVisible
		bool                                                       PrimaryActionPitchOverride;                              // 0x02C0(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_481O[0x7];                                   // 0x02C1(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FAthenaAnimationObjectActionOneShotPitchOverride    ActionPrimarySinglePitchOverride;                        // 0x02C8(0x0020) Edit, BlueprintVisible
		struct FAthenaAnimationObjectActionContinuousPitchOverride ActionPrimaryContinuousPitchOverride;                    // 0x02E8(0x00F0) Edit, BlueprintVisible
		struct FAthenaAnimationObjectActionOneShot                 ActionSecondarySingle;                                   // 0x03D8(0x0040) Edit, BlueprintVisible
		struct FAthenaAnimationObjectActionContinuous              ActionSecondaryContinuous;                               // 0x0418(0x0150) Edit, BlueprintVisible
		bool                                                       SecondaryActionPitchOverride;                            // 0x0568(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_LW5S[0x7];                                   // 0x0569(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FAthenaAnimationObjectActionOneShotPitchOverride    ActionSecondarySinglePitchOverride;                      // 0x0570(0x0020) Edit, BlueprintVisible
		struct FAthenaAnimationObjectActionContinuousPitchOverride ActionSecondaryContinuousPitchOverride;                  // 0x0590(0x00F0) Edit, BlueprintVisible
		struct FAthenaAnimationObjectMeleeV2                       MeleeV2;                                                 // 0x0680(0x0140) Edit, BlueprintVisible
		class UAnimSequence*                                       HandAdditive;                                            // 0x07C0(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      HandAdditiveDeactivationBlendTime;                       // 0x07C8(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		unsigned char                                              UnknownData_QWIG[0x4];                                   // 0x07CC(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FTransform                                          OffsetLeftHand;                                          // 0x07D0(0x0030) Edit, BlueprintVisible, IsPlainOldData, NoDestructor
		struct FTransform                                          OffsetRightHand;                                         // 0x0800(0x0030) Edit, BlueprintVisible, IsPlainOldData, NoDestructor
		struct FWieldAnimationParams                               Params;                                                  // 0x0830(0x0040) Edit, BlueprintVisible
		struct FAthenaAnimationObjectFacial                        Facial;                                                  // 0x0870(0x0070) Edit, BlueprintVisible
		bool                                                       RangedWeapon;                                            // 0x08E0(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		bool                                                       UseAlternateAsTransition;                                // 0x08E1(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_CSKQ[0x6];                                   // 0x08E2(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FAthenaAnimationSkeletonKnockbackLocomotionStrength KnockBack;                                               // 0x08E8(0x0020) Edit, BlueprintVisible
		class UAnimSequence*                                       ScreamStun;                                              // 0x0908(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationObjectTargetingOptions
	 * Size -> 0x003C
	 */
	struct FAthenaAnimationObjectTargetingOptions
	{
	public:
		EObjectPitchTargetingLimbs                                 ArmSelection;                                            // 0x0000(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		unsigned char                                              UnknownData_WF26[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      UpperClampTargetingAngle;                                // 0x0004(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      LowerClampTargetingAngle;                                // 0x0008(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      ShoulderInfluenceUpper;                                  // 0x000C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      ShoulderInfluenceLower;                                  // 0x0010(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FVector                                             VirtualPivotOffsetUpper;                                 // 0x0014(0x000C) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		struct FVector                                             VirtualPivotOffsetLower;                                 // 0x0020(0x000C) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		bool                                                       LockHandOrientation;                                     // 0x002C(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_O6HJ[0x3];                                   // 0x002D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FVector                                             VirtualPivotOffsetLerped;                                // 0x0030(0x000C) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationPitchControlStates
	 * Size -> 0x0168
	 */
	struct FAthenaAnimationPitchControlStates
	{
	public:
		struct FAthenaAnimationObjectTargetingOptions              StandardPassive;                                         // 0x0000(0x003C) Edit, BlueprintVisible, Protected
		struct FAthenaAnimationObjectTargetingOptions              StandardWater;                                           // 0x003C(0x003C) Edit, BlueprintVisible, Protected
		struct FAthenaAnimationObjectTargetingOptions              Action1;                                                 // 0x0078(0x003C) Edit, BlueprintVisible, Protected
		struct FAthenaAnimationObjectTargetingOptions              Action1Water;                                            // 0x00B4(0x003C) Edit, BlueprintVisible, Protected
		struct FAthenaAnimationObjectTargetingOptions              Action2;                                                 // 0x00F0(0x003C) Edit, BlueprintVisible, Protected
		struct FAthenaAnimationObjectTargetingOptions              Action2Water;                                            // 0x012C(0x003C) Edit, BlueprintVisible, Protected
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationFirstPersonTurnDelay
	 * Size -> 0x000C
	 */
	struct FAthenaAnimationFirstPersonTurnDelay
	{
	public:
		float                                                      MaxAngle;                                                // 0x0000(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      DelayOutSpeed;                                           // 0x0004(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      DelayInSpeed;                                            // 0x0008(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationFirstPersonTurnDelayStates
	 * Size -> 0x0020
	 */
	struct FAthenaAnimationFirstPersonTurnDelayStates
	{
	public:
		struct FAthenaAnimationFirstPersonTurnDelay                PassiveState;                                            // 0x0000(0x000C) Edit, BlueprintVisible
		struct FAthenaAnimationFirstPersonTurnDelay                ContinuousUse;                                           // 0x000C(0x000C) Edit, BlueprintVisible
		float                                                      TurnDelayAngle;                                          // 0x0018(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      InvTurnDelayAngle;                                       // 0x001C(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationLoadObjectsWrapper
	 * Size -> 0x0AA0
	 */
	struct FAthenaAnimationLoadObjectsWrapper
	{
	public:
		struct FAthenaAnimationCoreObjectAnimations                ObjectAnimation;                                         // 0x0000(0x0910) Edit, BlueprintVisible
		struct FAthenaAnimationPitchControlStates                  ObjectTargeting3rdPerson;                                // 0x0910(0x0168) Edit, BlueprintVisible
		struct FAthenaAnimationFirstPersonTurnDelayStates          FirstPersonTurnDelay;                                    // 0x0A78(0x0020) Edit, BlueprintVisible
		class UClass*                                              ObjectId;                                                // 0x0A98(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationHandHeldItemParams
	 * Size -> 0x0020
	 */
	struct FAthenaAnimationHandHeldItemParams
	{
	public:
		bool                                                       LeftArmOverlayActive;                                    // 0x0000(0x0001) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		bool                                                       RightArmOverlayActive;                                   // 0x0001(0x0001) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		bool                                                       UpperBodyOverlayActive;                                  // 0x0002(0x0001) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		bool                                                       FullBodyOverlayActive;                                   // 0x0003(0x0001) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		bool                                                       SpineOverlayActive;                                      // 0x0004(0x0001) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		bool                                                       SpineLockActive;                                         // 0x0005(0x0001) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		bool                                                       ObjectActive;                                            // 0x0006(0x0001) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		bool                                                       ObjectOverrideStateActive;                               // 0x0007(0x0001) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class FString                                              OverlayAnimationName;                                    // 0x0008(0x0010) BlueprintVisible, ZeroConstructor, HasGetValueTypeHash
		EItemPassiveState                                          ObjectPassiveState;                                      // 0x0018(0x0001) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		bool                                                       QuickStow;                                               // 0x0019(0x0001) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		bool                                                       Reload;                                                  // 0x001A(0x0001) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		bool                                                       ContinuousInteractionCustomLocomotionEnabled;            // 0x001B(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_JHCJ[0x4];                                   // 0x001C(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationIdleVariantChange
	 * Size -> 0x0010
	 */
	struct FAthenaAnimationIdleVariantChange
	{
	public:
		float                                                      CurrentTime;                                             // 0x0000(0x0004) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      TriggerTime;                                             // 0x0004(0x0004) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		int32_t                                                    VariantID;                                               // 0x0008(0x0004) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		bool                                                       VariantCompleted;                                        // 0x000C(0x0001) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_P3G8[0x3];                                   // 0x000D(0x0003) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Athena.HandOnWheelAnimationRanges
	 * Size -> 0x0040
	 */
	struct FHandOnWheelAnimationRanges
	{
	public:
		struct FFloatRange                                         LeftHandOnWheelA;                                        // 0x0000(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		struct FFloatRange                                         LeftHandOnWheelB;                                        // 0x0010(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		struct FFloatRange                                         RightHandOnWheelA;                                       // 0x0020(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		struct FFloatRange                                         RightHandOnWheelB;                                       // 0x0030(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
	};

	/**
	 * ScriptStruct Athena.WheelIKActivationRanges
	 * Size -> 0x0040
	 */
	struct FWheelIKActivationRanges
	{
	public:
		struct FFloatRange                                         LeftArmDownRangeA;                                       // 0x0000(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		struct FFloatRange                                         LeftArmDownRangeB;                                       // 0x0010(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		struct FFloatRange                                         RightArmDownRangeA;                                      // 0x0020(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		struct FFloatRange                                         RightArmDownRangeB;                                      // 0x0030(0x0010) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationWheel
	 * Size -> 0x01D0
	 */
	struct FAthenaAnimationWheel
	{
	public:
		struct FSocketId                                           LeftHandMaleSocket;                                      // 0x0000(0x0020) Edit, DisableEditOnInstance
		struct FSocketId                                           RightHandMaleSocket;                                     // 0x0020(0x0020) Edit, DisableEditOnInstance
		struct FSocketId                                           LeftHandFemaleSocket;                                    // 0x0040(0x0020) Edit, DisableEditOnInstance
		struct FSocketId                                           RightHandFemaleSocket;                                   // 0x0060(0x0020) Edit, DisableEditOnInstance
		float                                                      TranslationStrength;                                     // 0x0080(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      RotationStrength;                                        // 0x0084(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      BlendInSpeed;                                            // 0x0088(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      BlendOutSpeed;                                           // 0x008C(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FHandOnWheelAnimationRanges                         HandOnWheelAnimationRanges;                              // 0x0090(0x0040) Edit, DisableEditOnInstance
		struct FWheelIKActivationRanges                            WheelArmIKDownWithinRange;                               // 0x00D0(0x0040) Edit, DisableEditOnInstance
		EWheelAnimationType                                        WheelAnimationType;                                      // 0x0110(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		unsigned char                                              UnknownData_5BEW[0x3];                                   // 0x0111(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      WheelTime;                                               // 0x0114(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      WheelDirection;                                          // 0x0118(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      RightFingerAlpha;                                        // 0x011C(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      LeftFingerAlpha;                                         // 0x0120(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      FullBodyAlpha;                                           // 0x0124(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      WheelDockingHandClaspAlpha;                              // 0x0128(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		bool                                                       LeftWheelArmDown;                                        // 0x012C(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		bool                                                       RightWheelArmDown;                                       // 0x012D(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_74Y9[0x2];                                   // 0x012E(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class AActor*                                              ControlledObject;                                        // 0x0130(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		unsigned char                                              UnknownData_GEZ0[0x98];                                  // 0x0138(0x0098) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationCapstan
	 * Size -> 0x0158
	 */
	struct FAthenaAnimationCapstan
	{
	public:
		float                                                      IntentInterpSpeed;                                       // 0x0000(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FVector2D                                           CapstanAngularVelocityRange;                             // 0x0004(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		struct FVector2D                                           AnimationRemapSpeedRange;                                // 0x000C(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      AngularVelocityInterpSpeed;                              // 0x0014(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FSocketId                                           LeftHandMaleSocket;                                      // 0x0018(0x0020) Edit, DisableEditOnInstance
		struct FSocketId                                           RightHandMaleSocket;                                     // 0x0038(0x0020) Edit, DisableEditOnInstance
		struct FSocketId                                           LeftHandFemaleSocket;                                    // 0x0058(0x0020) Edit, DisableEditOnInstance
		struct FSocketId                                           RightHandFemaleSocket;                                   // 0x0078(0x0020) Edit, DisableEditOnInstance
		float                                                      TranslationStrength;                                     // 0x0098(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      RotationStrength;                                        // 0x009C(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      BlendInSpeed;                                            // 0x00A0(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      BlendOutSpeed;                                           // 0x00A4(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		bool                                                       AnimationOverride;                                       // 0x00A8(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		EAthenaAnimationCapstanState                               CapstanState;                                            // 0x00A9(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		unsigned char                                              UnknownData_NV7I[0x2];                                   // 0x00AA(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      AngularVelocityWanted;                                   // 0x00AC(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class AActor*                                              ControlledObject;                                        // 0x00B0(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		unsigned char                                              UnknownData_XX8T[0xA0];                                  // 0x00B8(0x00A0) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationControllableFacialAnimData
	 * Size -> 0x0030
	 */
	struct FAthenaAnimationControllableFacialAnimData
	{
	public:
		class UBlendSpace1D*                                       Capstan;                                                 // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       SailAction;                                              // 0x0008(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       SailIdle;                                                // 0x0010(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       CannonFire;                                              // 0x0018(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       CannonAim;                                               // 0x0020(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       HarpoonFire;                                             // 0x0028(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationFacialAnimData
	 * Size -> 0x0090
	 */
	struct FAthenaAnimationFacialAnimData
	{
	public:
		int32_t                                                    FacialIdleAnimationIndex0;                               // 0x0000(0x0004) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		int32_t                                                    FacialIdleAnimationIndex1;                               // 0x0004(0x0004) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		TArray<class UAnimSequence*>                               IdleAnimations;                                          // 0x0008(0x0010) Edit, BlueprintVisible, ZeroConstructor
		class UAnimSequence*                                       Death;                                                   // 0x0018(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       HitReact;                                                // 0x0020(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FAthenaAnimationControllableFacialAnimData          Controllables;                                           // 0x0028(0x0030) Edit, BlueprintVisible
		class UAnimMontage*                                        Sick;                                                    // 0x0058(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       Cough;                                                   // 0x0060(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       Talk;                                                    // 0x0068(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       UnderwaterIdle;                                          // 0x0070(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimMontage*                                        CurrentFacialMontage;                                    // 0x0078(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimMontage*                                        PlayingFacialMontage;                                    // 0x0080(0x0008) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		EFacialPriority                                            CurrentFacialPriority;                                   // 0x0088(0x0001) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		unsigned char                                              UnknownData_MDK9[0x7];                                   // 0x0089(0x0007) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationFire
	 * Size -> 0x0020
	 */
	struct FAthenaAnimationFire
	{
	public:
		float                                                      MinimumDistanceToStartCoughing;                          // 0x0000(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		unsigned char                                              Coughing : 1;                                            // 0x0004(0x0001) BIT_FIELD BlueprintVisible, BlueprintReadOnly, NoDestructor
		unsigned char                                              UnknownData_O21B[0x1B];                                  // 0x0005(0x001B) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationRowboatAnimationsFirstPerson
	 * Size -> 0x0030
	 */
	struct FAthenaAnimationRowboatAnimationsFirstPerson
	{
	public:
		class UAnimSequence*                                       SitDown;                                                 // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       Stand;                                                   // 0x0008(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       Idle;                                                    // 0x0010(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       Row;                                                     // 0x0018(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       Recover;                                                 // 0x0020(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       Brake;                                                   // 0x0028(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationRowboatAnimationsThirdPerson
	 * Size -> 0x0050
	 */
	struct FAthenaAnimationRowboatAnimationsThirdPerson
	{
	public:
		class UAnimSequence*                                       SitDown;                                                 // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       Stand;                                                   // 0x0008(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       Idle;                                                    // 0x0010(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UBlendSpace1D*                                       Row;                                                     // 0x0018(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UBlendSpace1D*                                       Recover;                                                 // 0x0020(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UBlendSpace1D*                                       IntoRow;                                                 // 0x0028(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UBlendSpace1D*                                       IntoRowBrake;                                            // 0x0030(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UBlendSpace1D*                                       BrakeRow;                                                // 0x0038(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UBlendSpace1D*                                       BrakeRecover;                                            // 0x0040(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UBlendSpace1D*                                       BrakeIdle;                                               // 0x0048(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationRowboatAnimationsPassenger
	 * Size -> 0x0018
	 */
	struct FAthenaAnimationRowboatAnimationsPassenger
	{
	public:
		class UAnimSequence*                                       PassengerIntoSitting;                                    // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       PassengerSittingIdle;                                    // 0x0008(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       PassengerStand;                                          // 0x0010(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationRowboatParams
	 * Size -> 0x00C8
	 */
	struct FAthenaAnimationRowboatParams
	{
	public:
		bool                                                       InLeftArmRow;                                            // 0x0000(0x0001) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		bool                                                       InLeftArmRecover;                                        // 0x0001(0x0001) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		bool                                                       InRightArmRow;                                           // 0x0002(0x0001) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		bool                                                       InRightArmRecover;                                       // 0x0003(0x0001) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      LeftArmForce;                                            // 0x0004(0x0004) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      LeftArmRecover;                                          // 0x0008(0x0004) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      RightArmForce;                                           // 0x000C(0x0004) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      RightArmRecover;                                         // 0x0010(0x0004) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		ERowBraking                                                Braking;                                                 // 0x0014(0x0001) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		bool                                                       BrakingLeftOrBoth;                                       // 0x0015(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		bool                                                       BrakingRightOrBoth;                                      // 0x0016(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_5QER[0x1];                                   // 0x0017(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    Direction;                                               // 0x0018(0x0004) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		bool                                                       PlayIdle;                                                // 0x001C(0x0001) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		bool                                                       LeftArmInactive;                                         // 0x001D(0x0001) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		bool                                                       RightArmInactive;                                        // 0x001E(0x0001) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_P3E5[0x1];                                   // 0x001F(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FVector                                             CameraAdjustment;                                        // 0x0020(0x000C) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		bool                                                       IsSeated;                                                // 0x002C(0x0001) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_86QT[0x3];                                   // 0x002D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FAthenaAnimationRowboatAnimationsFirstPerson        RowBoatAnimationsFirstPerson;                            // 0x0030(0x0030) BlueprintVisible
		struct FAthenaAnimationRowboatAnimationsThirdPerson        RowBoatAnimationsThirdPerson;                            // 0x0060(0x0050) BlueprintVisible
		struct FAthenaAnimationRowboatAnimationsPassenger          RowBoatAnimationsPassenger;                              // 0x00B0(0x0018) BlueprintVisible
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationRowing
	 * Size -> 0x00C0
	 */
	struct FAthenaAnimationRowing
	{
	public:
		class AActor*                                              ControlledObject;                                        // 0x0000(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class AActor*                                              CachedPlayerCharacter;                                   // 0x0008(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UClass*                                              CosmeticOarClass;                                        // 0x0010(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		unsigned char                                              UnknownData_PNQR[0xA8];                                  // 0x0018(0x00A8) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationWaterPumpAnimData
	 * Size -> 0x0028
	 */
	struct FAthenaAnimationWaterPumpAnimData
	{
	public:
		class UAnimSequence*                                       IntoWaterPump;                                           // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       WaterPumpIdle;                                           // 0x0008(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       WaterPumpAction;                                         // 0x0010(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       WaterPumpActionOverlay;                                  // 0x0018(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       OutOfWaterPump;                                          // 0x0020(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationWaterPumpParams
	 * Size -> 0x000C
	 */
	struct FAthenaAnimationWaterPumpParams
	{
	public:
		float                                                      WaterPumpHandlePosition;                                 // 0x0000(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      WaterPumpHandlePreviousPosition;                         // 0x0004(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		bool                                                       WaterPumpHandleInMotion;                                 // 0x0008(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_H113[0x3];                                   // 0x0009(0x0003) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationFishingParams
	 * Size -> 0x0034
	 */
	struct FAthenaAnimationFishingParams
	{
	public:
		EFishingState                                              FishingState;                                            // 0x0000(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		bool                                                       InFishing;                                               // 0x0001(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_0IZZ[0x2];                                   // 0x0002(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FVector2D                                           RodBend;                                                 // 0x0004(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      ReelSpeed;                                               // 0x000C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		bool                                                       CastFailed;                                              // 0x0010(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		bool                                                       IsFishHookedAndVisible;                                  // 0x0011(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_XXAD[0x2];                                   // 0x0012(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FVector2D                                           PlayerInputForce;                                        // 0x0014(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      TensionShake;                                            // 0x001C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      LineSnapShake;                                           // 0x0020(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		bool                                                       IKIsActive;                                              // 0x0024(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_E79M[0x3];                                   // 0x0025(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      IKBlendInSpeed;                                          // 0x0028(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      IKBlendIOutSpeed;                                        // 0x002C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		bool                                                       IsComedyItem;                                            // 0x0030(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		EFishingState                                              FishingJIPState;                                         // 0x0031(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		unsigned char                                              UnknownData_KX1O[0x2];                                   // 0x0032(0x0002) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationFishing
	 * Size -> 0x0340
	 */
	struct FAthenaAnimationFishing
	{
	public:
		bool                                                       AnimationOverride;                                       // 0x0000(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_V3E8[0x31F];                                 // 0x0001(0x031F) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class AActor*                                              FishingRodActor;                                         // 0x0320(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class AActor*                                              FishingFloat;                                            // 0x0328(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAthenaAnimationInstance*                            OwningAnimationInstance;                                 // 0x0330(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		unsigned char                                              UnknownData_BARW[0x8];                                   // 0x0338(0x0008) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationWaterSlideControlAnimData
	 * Size -> 0x0020
	 */
	struct FAthenaAnimationWaterSlideControlAnimData
	{
	public:
		class UAnimSequence*                                       Into;                                                    // 0x0000(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       Action;                                                  // 0x0008(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       Outof;                                                   // 0x0010(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		bool                                                       IsSliding;                                               // 0x0018(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_OIWW[0x7];                                   // 0x0019(0x0007) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationJumping
	 * Size -> 0x00D0
	 */
	struct FAthenaAnimationJumping
	{
	public:
		EAthenaAnimationJumpingState                               JumpingState;                                            // 0x0000(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		unsigned char                                              UnknownData_EC72[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      PreImpactTime;                                           // 0x0004(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		int32_t                                                    JumpSequence;                                            // 0x0008(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		int32_t                                                    LandingSequence;                                         // 0x000C(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		unsigned char                                              FiredFromActor : 1;                                      // 0x0010(0x0001) BIT_FIELD BlueprintVisible, BlueprintReadOnly, NoDestructor
		unsigned char                                              Jumping : 1;                                             // 0x0010(0x0001) BIT_FIELD BlueprintVisible, BlueprintReadOnly, NoDestructor
		unsigned char                                              UnknownData_8HZ1[0xBF];                                  // 0x0011(0x00BF) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationWaterPump
	 * Size -> 0x0030
	 */
	struct FAthenaAnimationWaterPump
	{
	public:
		unsigned char                                              UnknownData_DNX8[0x10];                                  // 0x0000(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class AActor*                                              WaterPump;                                               // 0x0010(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		unsigned char                                              UnknownData_EKCQ[0x18];                                  // 0x0018(0x0018) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationLODSettings
	 * Size -> 0x0003
	 */
	struct FAthenaAnimationLODSettings
	{
	public:
		EIKState                                                   IKState;                                                 // 0x0000(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		EIKSolverType                                              IKSolverType;                                            // 0x0001(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		EIKFootPlantingState                                       IKFootPlantingState;                                     // 0x0002(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationWieldedItemStateMachine
	 * Size -> 0x0510
	 */
	struct FAthenaAnimationWieldedItemStateMachine
	{
	public:
		EWieldedItemAnimationState                                 CurrentState;                                            // 0x0000(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		EWieldedItemAnimationState                                 PreviousState;                                           // 0x0001(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		bool                                                       ExpectingTransition;                                     // 0x0002(0x0001) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_XTDI[0x5];                                   // 0x0003(0x0005) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UClass*                                              ContinuousUseInputId;                                    // 0x0008(0x0008) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash
		class UClass*                                              OutOfContinuousUseInputId;                               // 0x0010(0x0008) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash
		class UClass*                                              OneShotUseInputId;                                       // 0x0018(0x0008) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash
		bool                                                       OneShotIsAlternate;                                      // 0x0020(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		bool                                                       ContinuousIsAlternate;                                   // 0x0021(0x0001) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		EWieldableItemAnimVariant                                  OneShotAnimationVariant;                                 // 0x0022(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		bool                                                       IdleIsAlternate;                                         // 0x0023(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		bool                                                       UsePrimaryContinuousAnimations;                          // 0x0024(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		bool                                                       UsePrimaryContinuousOutOfAnimations;                     // 0x0025(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		bool                                                       UsePrimaryOneShotAnimations;                             // 0x0026(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_RLT5[0x29];                                  // 0x0027(0x0029) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UAnimSequence*                                       LastValidAnimSequence;                                   // 0x0050(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UBlendSpace1D*                                       LastValidBlendspace;                                     // 0x0058(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class AActor*                                              PreviousWieldedItem;                                     // 0x0060(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		bool                                                       DuplicateTransition;                                     // 0x0068(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_Q909[0x3];                                   // 0x0069(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FName                                                WieldSockets[0x7];                                       // 0x006C(0x0038) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		unsigned char                                              UnknownData_M5FB[0x46C];                                 // 0x00A4(0x046C) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationLoadObjectByID
	 * Size -> 0x0930
	 */
	struct FAthenaAnimationLoadObjectByID
	{
	public:
		int32_t                                                    LoadedObjectID;                                          // 0x0000(0x0004) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		bool                                                       ObjectFound;                                             // 0x0004(0x0001) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_3DJS[0x3];                                   // 0x0005(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UClass*                                              CharacterType;                                           // 0x0008(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash
		class UScriptStruct*                                       DestinationStruct;                                       // 0x0010(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		unsigned char                                              UnknownData_FJF4[0x8];                                   // 0x0018(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FAthenaAnimationCoreObjectAnimations                LoadedObjectAnimations;                                  // 0x0020(0x0910) BlueprintVisible
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationActiveOneShotAnimationStruct
	 * Size -> 0x0020
	 */
	struct FAthenaAnimationActiveOneShotAnimationStruct
	{
	public:
		class UAnimSequence*                                       Action;                                                  // 0x0000(0x0008) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UBlendSpace1D*                                       ActionPitchOverride;                                     // 0x0008(0x0008) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UBlendSpace*                                         ActionLocomotion;                                        // 0x0010(0x0008) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		bool                                                       UsePitchOverride;                                        // 0x0018(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		bool                                                       LocomotingWithPitchOverrideDisabled;                     // 0x0019(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		bool                                                       IdleWithPitchOverrideDisabled;                           // 0x001A(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_TGSC[0x5];                                   // 0x001B(0x0005) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationObjectActionOneShotPlayingStruct
	 * Size -> 0x0028
	 */
	struct FAthenaAnimationObjectActionOneShotPlayingStruct
	{
	public:
		class UAnimSequence*                                       Action;                                                  // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       ActionVariant1;                                          // 0x0008(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       ActionVariant2;                                          // 0x0010(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       ActionVariant3;                                          // 0x0018(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       ActionVariant4;                                          // 0x0020(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationActiveItemComplexAnimData
	 * Size -> 0x0038
	 */
	struct FAthenaAnimationActiveItemComplexAnimData
	{
	public:
		class UAnimSequence*                                       WarmUp;                                                  // 0x0000(0x0008) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       HeavyWarmUp;                                             // 0x0008(0x0008) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       Action;                                                  // 0x0010(0x0008) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       Recover;                                                 // 0x0018(0x0008) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       HeavyAttackStunRecover;                                  // 0x0020(0x0008) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		EWieldableItemComplexOneShotAnimType                       AnimType;                                                // 0x0028(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		unsigned char                                              UnknownData_ID4X[0x3];                                   // 0x0029(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      WarmUpPlaySpeed;                                         // 0x002C(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		unsigned char                                              IsHeavyAttackActive : 1;                                 // 0x0030(0x0001) BIT_FIELD BlueprintVisible, BlueprintReadOnly, NoDestructor
		unsigned char                                              UnknownData_EYLD[0x7];                                   // 0x0031(0x0007) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationObjectComplexOneShotPlaySpeeds
	 * Size -> 0x0014
	 */
	struct FAthenaAnimationObjectComplexOneShotPlaySpeeds
	{
	public:
		float                                                      WarmUpPlaySpeed;                                         // 0x0000(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      WarmUpFromBlockPlaySpeed;                                // 0x0004(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      ActionPlaySpeed;                                         // 0x0008(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      RecoverPlaySpeed;                                        // 0x000C(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      HeavyAttackStunRecoverPlaySpeed;                         // 0x0010(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationObjectMeleeBlocking
	 * Size -> 0x0060
	 */
	struct FAthenaAnimationObjectMeleeBlocking
	{
	public:
		class UAnimSequence*                                       BlockingInto;                                            // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       BlockingIntoFromCombat;                                  // 0x0008(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UBlendSpace*                                         BlockingMainBlendSpace;                                  // 0x0010(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       BlockingFeedbackSequenceA;                               // 0x0018(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       BlockingFeedbackSequenceB;                               // 0x0020(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       BlockingOut;                                             // 0x0028(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UBlendSpace*                                         Dodge;                                                   // 0x0030(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       BlockingIntoSwimming;                                    // 0x0038(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UBlendSpace*                                         BlockingMainBlendSpaceSwimming;                          // 0x0040(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       BlockingFeedbackSequenceASwimming;                       // 0x0048(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       BlockingFeedbackSequenceBSwimming;                       // 0x0050(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       BlockingOutSwimming;                                     // 0x0058(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationFishingAnimations
	 * Size -> 0x0090
	 */
	struct FAthenaAnimationFishingAnimations
	{
	public:
		class UAnimSequence*                                       CastIntoHoldBack;                                        // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UBlendSpace*                                         CastHoldBackLoop;                                        // 0x0008(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       CastForwards;                                            // 0x0010(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       CastHoldLoop;                                            // 0x0018(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       CastToFishing;                                           // 0x0020(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       CastFail;                                                // 0x0028(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UBlendSpace*                                         Fishing;                                                 // 0x0030(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UBlendSpace1D*                                       FishingAdditive;                                         // 0x0038(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UBlendSpace1D*                                       IntoFighting;                                            // 0x0040(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UBlendSpace*                                         FightingCentral;                                         // 0x0048(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UBlendSpace1D*                                       FightingAdditive;                                        // 0x0050(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UBlendSpace1D*                                       Linesnap;                                                // 0x0058(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       SuccessReelIn;                                           // 0x0060(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       ComedyItemSuccessReelIn;                                 // 0x0068(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       ShakingAdditive;                                         // 0x0070(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       LineSnapShakingAdditive;                                 // 0x0078(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       FishingToIdle;                                           // 0x0080(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       FishingToUnequip;                                        // 0x0088(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationAsyncLoadedFishingAnimations
	 * Size -> 0x01E0
	 */
	struct FAthenaAnimationAsyncLoadedFishingAnimations
	{
	public:
		TAssetPtr<class UAnimSequence>                             CastIntoHoldBack;                                        // 0x0000(0x001C) ELEMENT_SIZE_MISMATCH Edit, UObjectWrapper, HasGetValueTypeHash
		unsigned char                                              UnknownData_4AM8[0x4];                                   // 0x001C(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
		TAssetPtr<class UBlendSpace>                               CastHoldBackLoop;                                        // 0x0020(0x001C) ELEMENT_SIZE_MISMATCH Edit, UObjectWrapper, HasGetValueTypeHash
		unsigned char                                              UnknownData_XAVG[0x4];                                   // 0x003C(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
		TAssetPtr<class UAnimSequence>                             CastForwards;                                            // 0x0040(0x001C) ELEMENT_SIZE_MISMATCH Edit, UObjectWrapper, HasGetValueTypeHash
		unsigned char                                              UnknownData_J7IM[0x4];                                   // 0x005C(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
		TAssetPtr<class UAnimSequence>                             CastHoldLoop;                                            // 0x0060(0x001C) ELEMENT_SIZE_MISMATCH Edit, UObjectWrapper, HasGetValueTypeHash
		unsigned char                                              UnknownData_HFAO[0x4];                                   // 0x007C(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
		TAssetPtr<class UAnimSequence>                             CastToFishing;                                           // 0x0080(0x001C) ELEMENT_SIZE_MISMATCH Edit, UObjectWrapper, HasGetValueTypeHash
		unsigned char                                              UnknownData_A5NK[0x4];                                   // 0x009C(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
		TAssetPtr<class UAnimSequence>                             CastFail;                                                // 0x00A0(0x001C) ELEMENT_SIZE_MISMATCH Edit, UObjectWrapper, HasGetValueTypeHash
		unsigned char                                              UnknownData_R75G[0x4];                                   // 0x00BC(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
		class UBlendSpace*                                         Fishing;                                                 // 0x00C0(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UBlendSpace1D*                                       FishingAdditive;                                         // 0x00C8(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		TAssetPtr<class UBlendSpace1D>                             IntoFighting;                                            // 0x00D0(0x001C) ELEMENT_SIZE_MISMATCH Edit, UObjectWrapper, HasGetValueTypeHash
		unsigned char                                              UnknownData_G02V[0x4];                                   // 0x00EC(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
		TAssetPtr<class UBlendSpace>                               FightingCentral;                                         // 0x00F0(0x001C) ELEMENT_SIZE_MISMATCH Edit, UObjectWrapper, HasGetValueTypeHash
		unsigned char                                              UnknownData_G80N[0x4];                                   // 0x010C(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
		TAssetPtr<class UBlendSpace1D>                             FightingAdditive;                                        // 0x0110(0x001C) ELEMENT_SIZE_MISMATCH Edit, UObjectWrapper, HasGetValueTypeHash
		unsigned char                                              UnknownData_I74N[0x4];                                   // 0x012C(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
		TAssetPtr<class UBlendSpace1D>                             Linesnap;                                                // 0x0130(0x001C) ELEMENT_SIZE_MISMATCH Edit, UObjectWrapper, HasGetValueTypeHash
		unsigned char                                              UnknownData_YU2L[0x4];                                   // 0x014C(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
		class UAnimSequence*                                       SuccessReelIn;                                           // 0x0150(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		TAssetPtr<class UAnimSequence>                             ComedyItemSuccessReelIn;                                 // 0x0158(0x001C) ELEMENT_SIZE_MISMATCH Edit, UObjectWrapper, HasGetValueTypeHash
		unsigned char                                              UnknownData_IVQ0[0x4];                                   // 0x0174(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
		TAssetPtr<class UAnimSequence>                             ShakingAdditive;                                         // 0x0178(0x001C) ELEMENT_SIZE_MISMATCH Edit, UObjectWrapper, HasGetValueTypeHash
		unsigned char                                              UnknownData_0YIC[0x4];                                   // 0x0194(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
		TAssetPtr<class UAnimSequence>                             LineSnapShakingAdditive;                                 // 0x0198(0x001C) ELEMENT_SIZE_MISMATCH Edit, UObjectWrapper, HasGetValueTypeHash
		unsigned char                                              UnknownData_F5M0[0x4];                                   // 0x01B4(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
		class UAnimSequence*                                       FishingToIdle;                                           // 0x01B8(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		TAssetPtr<class UAnimSequence>                             FishingToUnequip;                                        // 0x01C0(0x001C) ELEMENT_SIZE_MISMATCH Edit, UObjectWrapper, HasGetValueTypeHash
		unsigned char                                              UnknownData_TYRH[0x4];                                   // 0x01DC(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	};

	/**
	 * ScriptStruct Athena.AthenaAnimationAsyncLoadedLocomotionAnimations
	 * Size -> 0x0100
	 */
	struct FAthenaAnimationAsyncLoadedLocomotionAnimations
	{
	public:
		TAssetPtr<class UBlendSpace>                               Locomotion1;                                             // 0x0000(0x001C) ELEMENT_SIZE_MISMATCH Edit, UObjectWrapper, HasGetValueTypeHash
		unsigned char                                              UnknownData_QZRP[0x4];                                   // 0x001C(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
		TAssetPtr<class UBlendSpace>                               Locomotion2;                                             // 0x0020(0x001C) ELEMENT_SIZE_MISMATCH Edit, UObjectWrapper, HasGetValueTypeHash
		unsigned char                                              UnknownData_IJHI[0x4];                                   // 0x003C(0x0004) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
		TAssetPtr<class UBlendSpace>                               Locomotion3;                                             // 0x0040(0x001C) ELEMENT_SIZE_MISMATCH Edit, UObjectWrapper, HasGetValueTypeHash
